{
  "1": {
    "Title": [
      "2.0"
    ],
    "Director": [
      "Shankar"
    ],
    "Starring": [
      "Rajinikanth",
      "Akshay Kumar",
      "Amy Jackson",
      "Sudhanshu Pandey"
    ],
    "Running Time": 147,
    "Country": [
      "India"
    ],
    "Language": [
      "Tamil"
    ],
    "Time": [],
    "Location": [
      "Chennai"
    ],
    "Text": "2.0 is a 2018 Indian Tamil-language science fiction action film written and directed by S. Shankar. Produced by Subaskaran under the banner of Lyca Productions. As the second installment in the Enthiran franchise, 2.0 is a standalone sequel to Enthiran (2010), featuring Rajinikanth reprising the roles of Vaseegaran and Chitti, alongside Akshay Kumar and Amy Jackson. Sudhanshu Pandey, Adil Hussain, Kalabhavan Shajohn, and K. Ganesh appear in supporting roles. The film follows the conflict between Chitti, the once dismantled humanoid robot, and Pakshi Rajan, a former ornithologist who seeks vengeance upon cell phone users to prevent avian population decline. The soundtrack is composed by A. R. Rahman, with lyrics written by Madhan Karky and Na. Muthukumar. Produced on an estimated budget of ₹543 crore (US$76 million), 2.0 is the most expensive Indian film to date. Production began in 2015, with principal photography conducted at AVM Studios later that year. The first schedule was filmed at EVP World. Scenes were primarily shot in India, particularly in Chennai's Madras Boat Club and Delhi's Jawaharlal Nehru Stadium. Filming was completed by August 2017. The film is the first in Indian cinema to be natively shot in 3D, which was done by cinematographer Nirav Shah. Legacy Effects made their return to construct prosthetic makeup and animatronics, with visual effects supervised by V. Srinivas Mohan. Editing was handled by Anthony and production design was conducted by T. Muthuraj. 2.0 was released worldwide in both 3D and conventional format on 29 November 2018, along with its dubbed versions in Hindi and Telugu. It received generally positive reviews upon release. Critics particularly praised the film's visual effects, performances of Rajinikanth and Kumar, and social message; the pace and screenplay received criticism. It earned ₹117.34 crore (US$16 million) worldwide on its first day, which was the second highest ever for an Indian film. The film crossed ₹520 crore (US$72 million) in its opening weekend to be the highest-grossing film worldwide for that week. 2.0 is the second highest-grossing film in India and is the sixth highest-grossing Indian film worldwide.  Plot Vaseegaran introduces Nila, his new humanoid robot, to a group of students. Shortly thereafter, a student's smartphone suddenly starts flying, exhibiting avian characteristics. Before long, cell phones all over Chennai begin to fly away, leaving the city in chaos. At an emergency council meeting initiated by the government, Vaseegaran enunciates that it is beyond conventional science to fight what he considers a fifth force, and proposes reinstating Chitti, which was dismantled in 2010. But Dhinendra Bohra, who lost his father to Chitti's anger, opposes, and the council decides to seek help from the military, thereby vetoing Vaseegaran's proposal. The growing stream of cell phones leaves havoc in its path, killing a mobile phone wholesaler Jayanth Kumar, a transmission tower owner Manoj Lulla, and the state's telecom minister Vaira Moorthy. To prevent further damage, S. Vijay Kumar, the Home Minister, unofficially gives Vaseegaran permission to rebuild Chitti. Chitti traces the mobile phones. Vaseegaran then learns from Chitti that the bird is powered by the aura of a human being, which exudes negative energy. The radiation from the antennae of such signal transmitters and auras of other living organisms are positively charged while those of the dead are negatively charged, allowing the parabolic transmitters to repel the bird. Had it entered the electromagnetic field produced by the transmitters, the radiation from the antennae would  neutralize the bird, preventing it from reassembling. Vaseegaran replicates a smaller version of those transmitters to destroy the bird. During neutralization, Vaseegaran learns that the negative aura is from Pakshi Rajan. Pakshi Rajan used to be an ornithologist who owned the now abandoned house where birds would come and live with him. Gradually, high-frequency radiation from the newly set up cell towers starts killing the birds due to the rapid growth of mobile phone industries. Pakshi then visits Jayanth Kumar, Manoj Lulla, and the telecom minister in order to request them to stop their unjust and unlawful activities but it is in vain. He also organizes conferences and protests against the exorbitant use of cell phones but receives no support. Ultimately, all his birds die, and a distraught Pakshi Rajan hangs himself to death from a cell tower. His life energy, along with that of numerous dead birds, combine together to form an aura that manipulates mobile phones into any form through electromagnetic radiation. Chitti reactivates the transmitters and neutralizes Pakshi, storing his energy in a containment circuit. But jealous of Chitti's resurgence, Dhinendra sneaks into the AIRD Institute and frees Pakshi's aura from the containment circuit. The aura enters Vaseegaran, enabling Pakshi Rajan to possess his body and attack humans. Chitti hesitates to kill him, as it would mean killing Vaseegaran too. Taking advantage of this, Pakshi disassembles Chitti. Nila takes Chitti back to the lab and rebuilds its body, replacing its microchip with the red chip created by Bohra, which results in Chitti's violent configuration, version 2.0, being in control. Nila constrains it from harming anyone but Pakshi Rajan. Chitti then creates more versions of its likeness. Meanwhile, Pakshi takes over a crowded football stadium and exposes Dhinendra to radiation from the nearby cell towers, incinerating and killing him. Chitti, along with its army of robots, arrives and confronts him, resulting in a battle between the two. However, its battery drains, and it rushes to the nearest power station. During this time, microbots resembling Chitti, called Kutti version 3.0, arrive mounted on white pigeons and confront Pakshi Rajan, who cannot kill the spectators now as it would mean that the pigeons would also get killed. At one point Pakshi's aura leaves Vaseegaran's body. The microbots then lead his aura to the signal transmission site, where Pakshi Rajan is eliminated. Vaseegaran recovers in the hospital and tells Vijay Kumar, who comes to see him, that he feels Pakshi Rajan was a virtuous person who became a victim of the corrupt society. He also suggests that everyone should limit the use of phones, and conserve the lives of birds as much as possible. Chitti, now restored to its original version, begins a relationship with Nila, to which Vaseegaran gives his consent. In a post-credits scene, Sana asks Vaseegaran over the phone about the probability of mobile phones flying again. Immediately, Vaseegaran's mobile flies out of his hand and morphs into Kutti 3.0, saying, \"I am your grandson\".  Cast Rajinikanth in three roles as Vaseegaran, a scientist who created a sophisticated robot in his likeness with a desire to commission it into the Indian Army. He introduced the robot as Chitti. Chitti, an advanced \"andro-humanoid\" robot. It was designed with a speed capacity of 1 Terahertz (Hz) and a memory capacity of 1 Zettabyte. Kutti, a microbot created by Chitti 2.0,  that can transform and disguise itself as a mobile phone. Akshay Kumar as Pakshi RajanAn ornithologist who operated a bird sanctuary, Pakshi Rajan protests excessive use of mobile phones fearing that high-frequency electromagnetic radiation from cell sites is threatening avian life. He reports it to Jayanth, the telecommunications minister, and Manoj, but they disregard the matter intentionally. Deeply frustrated, Pakshi hangs himself to death from a cell tower. Now his aura, combined with the negative energy of deceased birds, can control cell phones with electromagnetic radiation, which happens to be considered a fifth force. Pakshi's Tamil and Telugu voice is dubbed by Jayaprakash.Amy Jackson as NilaA domestic and feminine humanoid robot created by Vaseegaran, whose name is a contraction of \"Nice, Intelligent, Lovely Assistant\". This robot is meant to be a friend, helper, and caretaker. It can drive, perform forensic analysis, jump walls and disable electronic alarms. Later, it falls in love with Chitti. Nila's Tamil and Telugu voice is dubbed by Raveena Ravi.Sudhanshu Pandey as Dhinendra \"Dhina\" BohraA scientist and the son of Dr. Bohra, who was once killed by Chitti. After his father's death, Dhina assumes the robot to be Vaseegaran's alter-ego and wishes to take revenge on him. He happens to be the first person to voice against the reinstatement of Chitti in the government meeting. Later, he also becomes jealous of Chitti's resurgence and, sneaking into the AIRD Institute, he frees Pakshi's aura from the containment circuit.Adil Hussain as Minister S. Vijay KumarThe Home Minister who gives unofficial permission to Vaseegaran for Chitti's reactivation.Ishari K. Ganesh as Jayanth Kumar Kalabhavan Shajohn as Vaira Moorthy, Minister of Telecommunications Kaizaad Kotwal as Manoj Lulla Anant Mahadevan as Head of the meeting Mayilsamy as the personal assistant of Vaira Moorthy Priya Prince as Pakshi Rajan's mother Mayur Bansiwal as Pakshi Rajan's father Sanchana Natarajan as a student visiting Vaseegaran's lab Maya S. Krishnan as a student visiting Vaseegaran's lab Murali Satagopan as a student visiting Vaseegaran's lab Avijit Dutt as Dr.Sam Savitha Reddy as Sana (voice only)  Production Development The commercial success of Enthiran (2010) prompted the makers of the film to immediately consider making a sequel. By March 2011, the original film's cinematographer, Rathnavelu, revealed that initial pre-production work on a sequel had begun with the same technical team. S. Shankar, the director of Enthiran, moved on to work on Nanban (2012) and I (2015) and planned to reunite with the same producers as the original was released, with Shankar revealing that he was unsure if the film \"will happen at all\" during an interview in 2014. While finishing the production of I, Shankar drafted the scripts of three more feature films, including a sequel to Enthiran.Pre-production work for the film had reportedly started in June 2015 with Lyca Productions deciding to finance the project. Along with Shankar and Rajinikanth, composer A. R. Rahman and editor Anthony remained on the development team for the sequel, while Jeyamohan was added to write the screenplay. Shankar also began briefing the film's art director T. Muthuraj and visual effects supervisor V. Srinivas Mohan about their involvement in the film. Shankar had initially inquired about K. V. Anand's availability. This was before Nirav Shah joined the technical team as a cinematographer in mid-2015 and visited specialist studios in the United States to research filming methods for 3D shoots.Jeyamohan finished work on the script of the film in September 2015 and revealed that the story would be a direct continuation of the 2010 film, with filming only set to start following the completion of Rajinikanth's commitments in Kabali (2016). The original film's screenplay writer, Madhan Karky, helped Jeyamohan on some of the more technical dialogue in the script. While the film does include characters and references to events from its predecessor, it is primarily a standalone sequel. A press release coinciding with the start of the film's shoot also revealed that Resul Pookutty would handle sound designing, Legacy Effects would take care of animatronics work, and Mary E. Vogt would design special costumes. Stunt choreographer Kenny Bates and visual effects specialists John Hughes and Walt Jones were also signed to work on the film. Unadjusted for inflation, 2.0 is so far the most expensive Indian film.  Casting Shankar held initial discussions with Kamal Haasan, Aamir Khan, and then Vikram about portraying a further role, though none of the three actors signed on to appear in the film. Subsequently, the team held talks with Hollywood actor Arnold Schwarzenegger for the role, who agreed to work on the film for a record remuneration. The makers then opted against signing Schwarzenegger, though there have been conflicting reasons regarding this decision. British actress Amy Jackson signed on to work on the film in October 2015 and visited Los Angeles as a part of the team's pre-production work. In late November 2015, Rajinikanth also travelled to Los Angeles to meet the film's producers and complete costume trials and initial motion capture effects work for the film. After further negotiations with actors including Hrithik Roshan and Neil Nitin Mukesh, the makers signed on Akshay Kumar to portray the role for which Schwarzenegger was initially considered.Sudhanshu Pandey joined the cast of the film during March 2016 and revealed that he would portray a scientist who is the son of Professor Bohra from the original film. Adil Hussain began working on the film in July 2016, and, as a part of his role, undertook extensive research into the life of news reporters. In September 2016, Malayalam actor Kalabhavan Shajohn confirmed that he had tried out for a role in the film after Shankar was impressed with his performance in Drishyam and had signed him on.  Filming An official launch event was to be held on 12 December 2015, coinciding with Rajinikanth's birthday. However, the team chose to avoid publicity as a result of the 2015 South Indian floods. Instead, the team held a low key launch event at the AVM Studios on 7 December, with the director and the producers in attendance. Titled 2.0, the film then began its first scheduled shooting on 16 December 2015 at a set erected in the outskirts of Chennai at EVP World. On the first day of the shoot, a scene featuring Rajinikanth and several dwarf actors was shot at the erected set, while the team's principal cast and crew also assembled for a photo shoot. The first schedule of the film, consisting of Rajinikanth and Amy Jackson, continued in Chennai until 30 December 2015. The team then worked on a second schedule throughout the middle of January 2016 in Chennai and shot scenes featuring Rajinikanth at Mohan Studios and by Madras Boat Club. Shankar continued filming portions not involving the lead actors throughout February 2016 in Chennai, with a car chase sequence shot in Royapettah. Another schedule to shoot a song was initially set to be held at Salar de Uyuni in Bolivia but was canceled due to bad weather, and the team opted not to travel to the country.Akshay began shooting for the film in Chennai at the beginning of March 2016 and took part in a schedule held at the EVP Film City studio in Chennai. A set of a mobile phone store was built on site, while night scenes involving robotic equipment and military tanks were also canned. The team subsequently moved to Delhi in order to hold a forty-five-day schedule, continuing on from the same scenes with military tanks that were shot in Chennai. Subsequently, the team filmed sequences at Jawaharlal Nehru Stadium depicting an Indian Super League match between Chennaiyin FC and Mumbai City FC, with hundreds of junior artists recruited to act as supporters. Actors Amitabh Bachchan and Abhishek Bachchan visited the film's set at the stadium with the media reporting that the pair were set to make cameo appearances, though the claim was later denied by the team. Rajinikanth then joined the team in Delhi at the end of March to continue shooting for the project, with the climax sequences being filmed. Action scenes incorporating robotic equipment were filmed throughout early April in Delhi, with cinematographer Nirav Shah using helicams to capture sequences involving the three lead actors.Another ten-day schedule took place in May 2016 in Chennai, with scenes being shot at the EVP Film City studios as well as at The Forum Vijaya shopping mall. During the shoot at the studios, the visual effects designer Srinivas Mohan digitally converted a green screen sequence into locations including the Red Fort and the Parliament from Delhi after the team were unable to secure shooting permission there. By June 2016, Shankar revealed that after one hundred days of shooting, scenes including the climax and two major action sequences had been completed and that the film was fifty per cent complete. Adil Hussain and Kalabhavan Shajohn began their work in the film during July 2016 in Chennai, while the rest of the cast were given an extended break after Rajinikanth fell ill. Production continued throughout August and early September 2016 without the lead actors in Saligramam in Chennai, where the team shot action sequences of luxury cars being blown up. Following his illness and subsequent recovery, Rajinikanth returned to the sets of the film in early October after a break of close to four months. He shot for scenes alongside Amy Jackson in Chennai, where he was featured fighting huge birds created using animatronic technology with actor Riyaz Khan also joining the cast. Soon after the schedule finished in early October, Shankar revealed that the film was two-thirds complete, following one hundred and fifty days of shooting.Another schedule began in early November at EVP Film City in Chennai with all of the lead cast and continued throughout the month. All filming was completed except for one song that featured a set erected in Chennai. Jackson was given ten days of practice by choreographer Bosco. Filming was completed in August 2017. Principal photography was concluded on 22 October 2017.  Music In 2015, during pre-production phase of the film, it was announced that A. R. Rahman would be composing the soundtrack and original score of 2.0. In an interview with Archana Chandhok on Zee Tamil, Rajinikanth revealed that director Shankar wanted to make 2.0 without any songs. Plans for recording a title track and a background song failed. The track \"Enthira Logathu Sundariye\" made its way after taking into account that the screenplay of the film was entirely subject-oriented and moves at a frenetic pace. Keeping audiences in consideration, a \"breather\" form of a song was recorded. However, Rahman was still not convinced and felt that an album should have a minimum of four songs to provide listeners with a wholesome experience.In an interview with Press Trust of India, Rahman stated that 2.0 was a tough film to score. Recording of \"Endhira Logathu Sundariye\" was completed by early August 2017. The song, reported as a romantic number with dance included, was shot indoors in a 12-day schedule in August 2017. Recording of the Hindi version (\"Mehanical Sundariye\") of the track was completed on October 29, 2017.A promotional music event for releasing two songs \"Endhira Logathu Sundariye\" and \"Raajali\" was held at Burj Al Arab, Dubai on October 27, 2017. Both these tracks were released on digital music platforms the same day. A. R. Rahman and his music team performed these two songs and an additional track \"Pullinangal\" at the event. A symphony of an estimated 125 musicians was present to perform live. \"Pullinangal\"'s Hindi version (\"Nanhi Si Jaan\") was recorded in June 2018. The track \"Pullinangal\" was released as a part of the soundtrack album on November 6, 2018. About this, Rahman stated that he initially wanted to release more background themes rather than songs. Recording of the original score began in London and Rahman's Los Angeles studios in 2016. Unlike previous projects, Rahman began finalizing the original background score six months back prior to release because he felt that the scenes were very heavy and it needed a lot of work.  Track listing Marketing and release In November 2016, it was revealed that 2.0 was scheduled for release during Diwali on 18 October 2017. In April 2017, Raju Mahalingam, the film's former producer, announced that the film's release had been postponed to 25 January 2018 citing better incorporation of visual effects. The release date was later moved to 14 April 2018. The release date was once again moved to 27 April 2018 but instead Kaala took that spot resulting in another delay of the film. The making video of the film was revealed on 25 August 2017. The film, which contains approximately 1,000 visual effects shots according to producers, was delayed numerous times while the computer-generated imagery (CGI) work was being completed by numerous effects studios. The film was finally slated to be released in cinemas on 29 November 2018.The teaser of 2.0 was released on Ganesh Chaturti, 13 September 2018, in both 3D and 2D. The 3D version was positively received, while some expressed disappointment with the 2D. Its 2D teaser video has been viewed over 32 million times in 24 hours. The film topic was trended and top searched queries on Google Trends for a week. But the teaser did not mention the release date. According to the source, \"There may be a lot of VFX work left in the film and they do not want to delay things too much. This is why, the makers Lyca Productions  seem to have put out the teaser so that they can keep the audiences busy.\" In addition to its original language, the film will be released in 14 other languages with dubbed versions. The film has recovered approximately ₹370 crore (US$51 million) from satellite, digital and music rights. This includes, but is not limited to, about ₹110 crore (US$15 million) for satellite and digital rights and ₹50 crore (US$7.0 million) for digital rights, the latter sold to Amazon Prime Video.Ahead of the film's release, the Cellular Operators Association of India (COAI) lodged a complaint, demanding that the Central Board of Film Certification (CBFC) certificate of the film be revoked for \"promoting anti-scientific attitudes towards mobile phones and cellular networks\". The organisation alleged the producers \"falsely depicting mobile phones and mobile towers as harmful to living creatures and the environment including birds and human beings\". Meanwhile, a Lyca Productions spokesperson said, \"We are under no obligation to toe the line and the film does not hunt or defames [sic] anyone.\" Various studies in India have proven that electromagnetic radiation from cell sites has a detrimental effect on bird health.In China, the film is set to release on 19 May 2019 in 10,000 theatres with 56,000 screenings, which includes 47,000 3D screenings, reportedly the largest release ever for an Indian film in the country, with a Mandarin dub and subtitles.  Reception Box office 2.0 was released in about 6900 screens in India and over 2000 screens overseas. On its opening day, 2.0 earned about ₹80 crore (US$11 million) gross collection in India (all versions), which was the second highest ever for an Indian film after Baahubali 2: The Conclusion (2017)'s ₹154 crore (US$21 million). This was around ₹64 crore nett. Its worldwide gross was over ₹117.34 crore (US$16 million), which was also the second highest worldwide collection for an Indian film on its first day after Baahubali 2. On its second day, the film went on to be number one at the Australian box office. In Malaysia, the film had an all-time highest opening for any Tamil film. On its second day, the film earned around ₹45 crore nett in India. The all-India business of 2.0 increased to ₹56-57 crore nett on Saturday (the third day) owing to positive word-of-mouth in North India, while the collections in South India saw a minor drop. Its all-India total increased to ₹165.5 crore nett. On its third day, the film earned around ₹290 crore (US$40 million) worldwide in all languages, including ₹85 crore (US$12 million) from overseas markets.At the American box office, the film surpassed the lifetime business of Rajinikanth's previous film Lingaa (2014) in just two days. The film debuted at number 11 at the American box office, earning $4.09 million. The screen count was increased from 20 to 75 in Pakistan on its second day to meet the demand. 2.0 grossed US$14.75 million (₹1.03 billion) in first five days in overseas markets. On its fourth day, a Sunday, business picked up over India, which led the film to accumulate an opening weekend collection of around ₹400 crore (US$56 million), the highest amount earned by any film in the week of 29 November to 2 December, ahead of Fantastic Beasts: The Crimes of Grindelwald (2018). Collections in India, discounting overseas, were ₹291 crore (US$40 million) gross (₹229 crore nett) in all languages. This pushed it ahead of Enthiran, which was the previous highest-grossing film from Tamil cinema with an earning of ₹205 crore nett in India. In its four-day opening weekend, the film opened at number one at the United Arab Emirates box office, earning $2.5 million, ahead of Creed II (2018).On its fifth day, the film earned around ₹451 crore (US $56 million) worldwide in all languages, including ₹114 crore (US $16 million) from international markets. In North India, its Hindi version earned around ₹111 crore (US $16 million). Along with the sixth day business of ₹24 crore nett, the film earned ₹282.31 crore nett in India. It did record business in the southern Indian states of Tamil Nadu and Kerala. By the end of seven days, the film earned ₹480 crore (US$67 million) worldwide, which included ₹362 crore (US$50 million) in India and US$15 million (₹1.18 billion) in overseas markets. The extended first week worldwide collection was ₹520 crore (US$72 million).  Critical response On the review aggregation website Rotten Tomatoes, 2.0 has a 75% approval rating based on 12 reviews and an average rating of 6.5/10.  India 2.0 received generally positive reviews from critics in India. Shankar's direction, visual effects, performances of Rajinikanth and Kumar, suspense and social message received  praise, while the introduction, script, and dialogues drew criticism. Taran Adarsh gave the film five stars out of five and applauded Shankar as \"a visionary... He hits the ball out of the park this time. Akshay Kumar is fantastic, while Rajinikanth is the boss\". A critic for Bollywood Hungama gave it four and a half stars out of five and similarly commended Shankar, \"[His] direction is highly effective and he proves once again why he's one of our best filmmakers. He doesn't get overwhelmed by the technology available and makes correct use of it\". S Subhakeerthana of The Indian Express gave it four stars out of five: \"Shankar has raised the bar in filmmaking in terms of visualisation, grandeur, and every frame of his fascinates you as a viewer\". Business Today's Ramesh Bala gave it four stars out of five, and found Kumar to be the film's spotlight: \"He has rocked both as Birdman and as a normal man in an emotional flashback\".Writing for Hindustan Times, Raja Sen rated 2.0 three and a half stars out of five, terming Rajinikanth as \"smarter than a smartphone\" and counted him and Kumar among the film's strengths. A critic for the Indo-Asian News Service also gave three and a half stars out of five and wrote, \"Unlike most science-fiction films, 2.0 takes the commercial route to entertain, thus does come across as illogical at places, but that's what makes it insanely fun\". Devesh Sharma of Filmfare also gave three and a half stars out of five. M. Suganth of The Times of India gave it three stars out of five; he stated that there is a sense of \"just going through the motions in the first half,\" but found that the action sequences and chemistry between the leads helped keep the film enjoyable for most of its run-time. Writing for Film Companion, Anupama Chopra also gave the film three stars out of five: \"2.0 is visually overpowering – the VFX are mostly first-rate – but the screenplay doesn't offer the seamless mix of romance, drama and comedy [as the predecessor]\".Janani K, film critic for India Today, gave 2.0 three stars out of five and appreciated the film's theme, but felt it could be better presented, writing, \"Though it is a much-need message, it could have been explained in an intriguing manner rather than the pedantic treatment it gets\". Rajeev Masand also gave it three stars out of five. Shubhra Gupta of The Indian Express gave the film two stars out of five, describing it as \"dull as ditchwater in the first half, perking up a little in the second, with a half-way watchable Akshay Kumar, and a Rajinikanth coming into his own right towards the end, for a bit\". Pragati Saxena of National Herald concurred with Gupta and criticized the pace and dullness of the film. Writing for CNN-News18, Rohit Vats also rated two stars out of five and criticised the writing, opining, \"[Shankar's] characters haven't evolved the way the world around them has\". Saibal Chatterjee of NDTV also gave two stars out of five and said, \"Bunkum is bunkum no matter how big the bucks behind it are\".  Overseas Simon Abrahams of RogerEbert.com gave the film three and a half stars out of four and stated, \"Against all reason–against all common sense–2.0 works, and in a big, big way\". Shilpa Jamkhandikar of Reuters wrote, \"This film certainly has the look and feel of a big-ticket Hollywood production, and that alone is worth the price of the ticket\". Kumar Shyam of The National gave it three and a half stars out of five and wrote, \"2.0 is a very clever spectacle not to be missed for its sheer audacity and scale\". Rafael Motamayor of Polygon wrote, \"2.0's biggest draw is its impressive use of visual effects, and the film doesn't waste a moment to showcase its budget\". He felt \"[t]he effects [were] detailed enough to stand against a $200 million-dollar American blockbuster\".  Accolades Footnotes References External links 2.0 at Box Office Mojo 2.0 on IMDb  2.0 on Bollywood Hungama 2.0 on Facebook",
    "Categories": [
      "2010s Tamil-language films",
      "2010s action films",
      "2010s science fiction action films",
      "2010s science fiction films",
      "2018 3D films",
      "2018 films",
      "Album infoboxes lacking a cover",
      "All Wikipedia articles written in Indian English",
      "Android (robot) films",
      "Articles with hAudio microformats",
      "Articles with short description",
      "CS1 Tamil-language sources (ta)",
      "Commons category link from Wikidata",
      "EngvarB from January 2016",
      "Enthiran",
      "Films directed by S. Shankar",
      "Films featuring an item number",
      "Films scored by A. R. Rahman",
      "Films set in Chennai",
      "Films set in the future",
      "Films shot in Delhi",
      "Films shot in Ukraine",
      "Films shot in multiple languages",
      "Films using computer-generated imagery",
      "Indian 3D films",
      "Indian action films",
      "Indian films",
      "Indian science fiction action films",
      "Indian science fiction films",
      "Multilingual films",
      "Robot films",
      "Science fantasy films",
      "Tamil-language films",
      "Techno-thriller films",
      "Use Indian English from November 2018",
      "Use dmy dates from July 2018"
    ]
  },
  "2": {
    "Title": [
      "2nd Half"
    ],
    "Director": [
      "Yogi Devegange"
    ],
    "Starring": [
      "[]"
    ],
    "Running Time": "[]",
    "Country": [
      "India"
    ],
    "Language": "[]",
    "Time": [],
    "Location": [],
    "Text": "2nd Half is a 2018 crime-thriller film in Kannada, directed by debutant Yogi Devegange and produced by Nagesh under the banner Brindavan Enterprises and stars Priyanka Upendra, Surabhi Santosh and Niranjan Sudhindra in the lead. The cinematography is by R K Shivakumar and music direction is handled by Chetan Sosca.  Background Talking about her character in 2nd Half, Priyanka Upendra was quoted saying \"The movie's content is such that it talks about the khakhi profession and highlights how juniors are treated insignificantly by seniors. It becomes very difficult to make yourself ‘heard'.\"  While explaining her interest to be part of new age cinema, she continues \"It's easy to do the tried-and tested methods. But it’s hard to take the road less taken. The same applies for films and directors. One such is Yogi Devagange, a director who is open to taking risks. Which is why I like associating with him on work. Such roles, for me as an actor, are challenging. For example, when I first heard the story of 2nd Half, I felt that it was a story that would definitely work,”It also marks the entry of actor Upendra's nephew Niranjan into the Kannada film industry, on choosing 2nd half as a debut, he says  \"Since I've grown up being interested in theatre, I've closely observed my Uncle and his acting style. I've also understood the intricacies of camera work since I associated with him in Uppi-2. Initially, I was considering entering the industry after mastering every department. I wanted to hone my skills, come in as a complete package and become a director's actor. But when 2nd Half happened, I realised that it was the right film to debut with,\" says Niranjan, who consulted his uncle before taking the plunge into the industry. \" He felt that I shouldn't miss an opportunity that came knocking at his door. His words made me realise that it's okay to start small and scale up,\"  Plot The story talks about the life of a women police constable Anuradha (Priyanka Upendra) who assigned to the police CCTV control room. On her job, she gets intrigued by the life of a young girl, Saranya (Surabhi Santosh) who is a free-spirited artist. In her newfound interest in spotting this girl on CCTV, she witnesses the girl go missing one day through the CCTV which abruptly ends when the camera stops working. The rest of the story is about how she sets out on a mission to find the girl with the help of a local boy named Niru (Niranjan Sudhindra) who also happens to be Saranya's lover.  Cast Priyanka Upendra as Anuradha Surabhi Santosh as Saranya Niranjan Sudhindra as Niru Shalini Veena Sundar Sarath Lohitashwa Ritesh Gowda  Reception The film released on June 1, 2018 to mixed to positive reviews. Times of India gave the film a 2/5 while stating \"The film unfurls at a sluggish pace and the songs in the film feel rather forced, too\"Cinema express mentioned that \"The premise of this crime plot is different enough from the rest to warrant attention. Just be warned of the slow build up.\" while giving it 3 on 5.The New Indian Express reviewed that \"Priyanka, on her part takes a lot of responsibility on her shoulders. Being the centre point of the film, she has gone as per the director's vision. For Niranjan, 2nd Half becomes a trial run, before he gets his next big picture. A little hardwork from his end, might help to mould his career. This is just the beginning and he has a long way to go. Surabhi Santhosh is the soul of the film with the revolving mostly around him. Even though she doesn't have much screen space, 2nd Half doesn't make for a complete picture without her.\" while eventually rating a 3 on 5.     References  ",
    "Categories": [
      "2018 films",
      "Indian films",
      "Kannada-language films"
    ]
  },
  "3": {
    "Title": [
      "3 Bahadur: Rise of the Warriors"
    ],
    "Director": [
      "Sharmeen Obaid Chinoy"
    ],
    "Starring": [
      "Mehwish Hayat",
      "Fahad Mustafa",
      "Sarwat Gillani",
      "Nimra Bucha",
      "Behroze Sabzwari"
    ],
    "Running Time": "[]",
    "Country": [
      "Pakistan"
    ],
    "Language": [
      "Urdu"
    ],
    "Time": [],
    "Location": [],
    "Text": "3 Bahadur: Rise of the Warriors is a Pakistani computer animated action film directed by Sharmeen Obaid Chinoy and written by Kamran Khan. It is the last installment in 3 Bahadur trilogy. The film stars the voices by Mehwish Hayat, Fahad Mustafa, Sarwat Gillani, Nimra Bucha, and Behroze Sabzwari. It released nationwide on 14 December 2018 by ARY Films.  Cast Zuhab Khan as Saadi Arisha Razi as Amna Bashar Amir Shafi as Kamil Mehwish Hayat as Erma Fahad Mustafa as Imran; Amna's father Sarwat Gillani as Kulsoom; Saadi's mother Nimra Bucha as Babushka Behroze Sabzwari as Deenu Khalid Malik as Kamil's father Faheem Khan as Gunchu Mustafa Changezi as Tony  Production In September 2018, ARY Films announced the production on the third animated film installment in the 3 Bahadur film series was completed, with the voices by Mehwish Hayat, Fahad Mustafa, Sarwat Gillani, Nimra Bucha, and Behroze Sabzwari, with the production done at Waadi Animations. Director Sharmeen Obaid Chinoy said in an interview to The News that the film \"has some very strong female characters\", featuring \"a number of very strong women\" from the industry, who \"will change the way we see the power of women\". She added that \"the action sequences are stronger\", and \"special VFX (with effects)\" have been introduced.Writer Kamran Khan told Dawn that \"The characters have grown just like their audience and the plot this time is more complex\" with \"twists and turns\" to keep them \"involved in the story\". He added that they had decided if the second film does well, the franchise will be a trilogy, \"if the need to revive 3 Bahadur arises in the future, who knows we might find a way\". The director told that they had \"special screenings\" to ensure \"that kids from all over Pakistan\" familiarise with 3 Bahadur.At the trailer launch, Dettol was announced as the title sponsor for the film, with Dettol Warriors also featuring in it. A golden ticket campaign was started by Dettol for the target audience of children.  Soundtrack Title SongSingers: Asrar and Hadiqa KiyaniMusic by: Baqir Abbas and Hassan Badshah  Release 3 Bahadur: Rise of the Warriors released on 14 December 2018 by ARY Films.  See also List of Pakistani films of 2018 Nickelodeon (Pakistan)  References External links 3 Bahadur: Rise of the Warriors on IMDb  3 Bahadur: Rise of the Warriors on Facebook",
    "Categories": [
      "2010s action films",
      "2010s animated superhero films",
      "2018 animated films",
      "2018 computer-animated films",
      "2018 films",
      "Alien invasions in films",
      "All Wikipedia articles written in Pakistani English",
      "Films directed by Sharmeen Obaid-Chinoy",
      "Pakistani 3D films",
      "Pakistani action films",
      "Pakistani animated films",
      "Pakistani children's films",
      "Pakistani films",
      "Pakistani sequel films",
      "Urdu-language films",
      "Use Pakistani English from September 2018",
      "Use dmy dates from September 2018"
    ]
  },
  "4": {
    "Title": [
      "3 Days in Quiberon"
    ],
    "Director": [
      "Emily Atef"
    ],
    "Starring": [
      "Marie Bäumer",
      "Birgit Minichmayr",
      "Charly Hübner",
      "Robert Gwisdek"
    ],
    "Running Time": 115,
    "Country": [
      "Germany",
      "Austria",
      "France"
    ],
    "Language": [
      "German"
    ],
    "Time": [
      "1981"
    ],
    "Location": [],
    "Text": "3 Days in Quiberon (German: 3 Tage in Quiberon) is a 2018 drama film directed by Emily Atef. It was selected to compete for the Golden Bear in the main competition section at the 68th Berlin International Film Festival.  Cast Marie Bäumer as Romy Schneider Birgit Minichmayr as Hilde Fritsch Charly Hübner as Robert Lebeck Robert Gwisdek as Michael Jürgs  References External links 3 Days in Quiberon on IMDb",
    "Categories": [
      "2010s German film stubs",
      "2010s biographical films",
      "2010s drama film stubs",
      "2010s drama films",
      "2018 films",
      "All stub articles",
      "Articles containing German-language text",
      "Biographical films about actors",
      "Films about journalists",
      "Films set in 1981",
      "German-language films",
      "German biographical films",
      "German drama films",
      "German films",
      "Use dmy dates from January 2019"
    ]
  },
  "5": {
    "Title": [
      "3 Faces"
    ],
    "Director": [
      "Jafar Panahi"
    ],
    "Starring": [
      "Behnaz Jafari",
      "Jafar Panahi",
      "Marziyeh Rezaei",
      "Maedeh Erteghaei"
    ],
    "Running Time": 100,
    "Country": [
      "Iran"
    ],
    "Language": [
      "Persian",
      "Azeri"
    ],
    "Time": [],
    "Location": [],
    "Text": "3 Faces (Persian: Se rokh – سه رخ‎) is a 2018 Iranian drama film directed by Jafar Panahi and starring Behnaz Jafari and Panahi as themselves. It was selected to compete for the Palme d'Or at the 2018 Cannes Film Festival. At Cannes, Panahi and co-writer Nader Saeivar won the award for Best Screenplay.  Plot Behnaz Jafari, a popular Iranian actress, searches for a young girl in northwestern Iran with her friend Jafar Panahi, a director, after seeing a video of the girl asking for help to leave her conservative family.  Cast Behnaz Jafari as Herself Jafar Panahi as Himself  Production 3 Faces is Jafar Panahi's fourth film made under his 20-year filmmaking ban imposed by the government of Iran, after This Is Not a Film, Closed Curtain, and Taxi.  References External links 3 Faces on IMDb",
    "Categories": [
      "2010s drama film stubs",
      "2010s drama films",
      "2018 films",
      "All stub articles",
      "Articles containing Persian-language text",
      "Films directed by Jafar Panahi",
      "Iranian drama films",
      "Iranian film stubs",
      "Iranian films",
      "Persian-language films",
      "Use dmy dates from April 2018"
    ]
  },
  "6": {
    "Title": [
      "3 Gante 30 Dina 30 Second"
    ],
    "Director": [
      "Madhusudan G K"
    ],
    "Starring": [
      "Arun Gowda",
      "Kavya Shetty"
    ],
    "Running Time": "[]",
    "Country": [
      "India"
    ],
    "Language": [
      "Kannada"
    ],
    "Time": [],
    "Location": [],
    "Text": "3 Gante 30 dina 30 seconds (English: 3 hours 30 days 30 seconds) is a Kannada Feature Love Story written and directed by adman G K Madhusudhan. Film is produced by Chandrashekar R Padmashali and like minded producers under the banner Brain Share Creations Pvt Ltd. This is a story of a reality game takes place between the Hero and Heroine! The movie has a blend of youngsters Arun Gowda & Kavya Shetty in lead roles along with powerhouse performers Devaraj, Sudharani, Edakallu Guddada Mele Chandrashekhar, Ramesh Bhat, Anantavelu, T.S.Nagabharana and Gururaj Hosakote. Movie released on 19th Jan 2018 across Karnataka, Brainshare Creations is succeded in grossing 4.25 Crores revenue out of its 2.10 Crore investment  Synopsis The movie is a sensitive poetry of love. The story is a task in between two youngsters, which gives an accidental twist to their life. Avinash, a jovial boy,  professionally an advocate and Sharmila, a young and matured daughter of a well known media proprietor, who is an investigative journalist on corruption.  Cast Arun Gowda Kavya Shetty Devaraj Sudha Rani Chandrashekar Ramesh Bhat Anantavelu T. S. Nagabharana Gururaj Hosakote  Soundtrack State award-winning composer V. Sridhar has scored the music. He has composed six songs in which acclaimed poet Jayant Kaykini, director G K Madhusudhan and Sukanya Gautam have penned down the lyrics.  References External links 3 Gante 30 Dina 30 Second on IMDb  3 Gante 30 Dina 30 Second on Facebook 3 Gante 30 Dina 30 Second Teaser on YouTube",
    "Categories": [
      "2010s Kannada-language film stubs",
      "2010s Kannada-language films",
      "2018 films",
      "Album infoboxes lacking a cover",
      "All Wikipedia articles written in Indian English",
      "All stub articles",
      "Articles with hAudio microformats",
      "Directorial debut films",
      "Films scored by Sridhar V. Sambhram",
      "Indian films",
      "Indian romance films",
      "Indian romantic drama films",
      "Indian satirical films",
      "Indian thriller films",
      "Kannada-language films",
      "Use Indian English from March 2018",
      "Use dmy dates from March 2018"
    ]
  },
  "7": {
    "Title": [
      "3 Storeys"
    ],
    "Director": [
      "Arjun Mukerjee"
    ],
    "Starring": [
      "Richa Chadda",
      "Sharman Joshi",
      "Pulkit Samrat",
      "Masumeh Makhija",
      "Renuka Shahane",
      "Sonal Jha",
      "Aisha Ahmed",
      "Ankit Rathi"
    ],
    "Running Time": 100,
    "Country": [
      "India"
    ],
    "Language": [
      "Hindi"
    ],
    "Time": [],
    "Location": [],
    "Text": "3 Storeys is a 2018 Hindi thriller drama film directed by Arjun Mukerjee starring Richa Chadda, Sharman Joshi, Pulkit Samrat, Masumeh Makhija, Renuka Shahane, Sonal Jha, Aisha Ahmed, Ankit Rathi and produced by Priya Sreedharan, Ritesh Sidhwani and Farhan Akhtar. The film was released on 9 March 2018.  Plot Mayanagar is three Storey Chawl in Mumbai.Flory Mendonca a Catholic widow wants to give away a part of her house but doesn't have buyers due to its high price finally Vilas who is eager to take a house near station buys it. Whereas in the same building, Varsha is facing daily abuse from her unemployed and alcoholic husband. And on the other hand she still has feelings for her past lover Shankar and bonds well with her neighbor and tends her little son.Suahil and Malini falls in love being from different faiths much chagrin to their parents.On the ground floor lives glamours Leela who sends seductive vibes towards man around.The lives of people living in Mayanagar don't seem to be what it is as there are hidden secrets.  Cast Richa Chadda as Leela Sharman Joshi as Shankar Varma Pulkit Samrat as Vilas Naik Masumeh Makhija as Varsha Atre (Joshi) Renuka Shahane as Flory Mendonca Sonal Jha as Malini's mother Aisha Ahmed as Malini Mathur Ankit Rathi as Suhail Ansari Laksh Singh as Dominic Himanshu Malik as Policeman Ganpatrao  Soundtrack The music of the film has been composed by Clinton Cerejo and Amjad Nadeem while lyrics are penned by Puneet Krishna, Alaukik Rahi, Amjad Nadeem, Shellee and Pushaan Mukherjee. The first song of the film Bas Tu Hai which is sung by Arijit Singh and Jonita Gandhi was released on 14 February 2018 on the occasion of Valentines Day. The second track of the film titled as Raasleela which is sung by Sumedha Karmahe was released on 21 February 2018. The third song to be released was Azaadiyaan which is sung by Clinton Cerejo and Bianca Gomes was released on 27 February 2018. The soundtrack album of the film consists of 4 songs and was officially released by Zee Music Company on 27 February 2018.  Critical reception Lasyapriya Sundaram of The Times of India gave the film a rating of 3.5 out of 5 saying that, \"3 Storeys cleverly demonstrates the art of skillfully telling a story wherein all the loose ends of a plot are tied together into a neat whole.\" Saibal Chatterjee of NDTV praised the performances of the actors specially Renuka Shahane but found the conclusion of the story to be weak. The critic gave the film a rating of 2.5 out of 5 and said that, \"For all its flaws, 3 Storeys is still worth watching because it seeks to engage with the audience in a manner that is anything but run of the mill.\" Rajeev Masand of News18 gave the film a rating of 2.5 out of 5 saying that \"it’s a half-baked experiment with a few shining moments.\" Sweta Kausal of Hindustan Times gave the film a rating of 2.5 out of 5 saying that, \"It is a film that weaves together thriller, love story, social issues, realities and life all in one package, without being too messy. The actors’ brilliant performances are added bonus.\"Shubhra Gupta of The Indian Express gave the film a rating of 2.5 out of 5 saying that the movie \"comes off nice in bits but uneven overall. Everyone plays it quite competently, despite the predictable beats.\" Rohit Bhatnagar of Deccan Chronicle was impressed with the performances of all actors and felt Renuka Shahane's act was \"flawless.\" The critic gave the film a rating of 3 out of 5 and said that, \"With predictable moments scattered all over the film, debutant director Arjun Mukherjee still takes a brave attempt of making an unconventional thriller.\" Udita Jhunjhunwala of Live Mint reviewed the film saying that, \"Arjun Mukherjee’s film has some convincing performances but is tonally inconsistent.\" Suparno Sarkar of IBTimes gave the film a rating of 3 out of 5 saying that, \"3 Storeys is an unconventional drama that could have been much better.\"  References External links 3 Storeys on IMDB 3 Storeys at Bollywood Hungama",
    "Categories": [
      "2010s Hindi-language films",
      "2018 films",
      "Album infoboxes lacking a cover",
      "All Wikipedia articles written in Indian English",
      "Articles with hAudio microformats",
      "Hindi-language films",
      "Indian films",
      "Indian thriller drama films",
      "Use Indian English from January 2018",
      "Use dmy dates from March 2018"
    ]
  },
  "8": {
    "Title": [
      "4 Idiots"
    ],
    "Director": [
      "Basanta Sahoo"
    ],
    "Starring": [
      "Sabyasachi Mishra",
      "Akash Dasnayak",
      "Kuna Tripathy",
      "Chittaranjan Tripathy",
      "Elina Samantray",
      "Lipsa Mishra",
      "Poonam Mishra"
    ],
    "Running Time": 146,
    "Country": [
      "India"
    ],
    "Language": [
      "Odia"
    ],
    "Time": [],
    "Location": [],
    "Text": "4 Idiots is an Odia language comedy feature film  released on 12 June 2018. The film is directed by Basanta Sahoo and Produced by Akshay Parija Productions & Prakash Films Productions.The music is composed by Prem Anand .  Plot \"Four friends\" referred as \"4 Idiots\" in the movie.They are living a Happy-go-Lucky life but one day they dragged accidentally into trouple.  Cast Sabyasachi Mishra as Akash Dasnayak Kuna Tripathy Chittaranjan Tripathy Elina Samantray Lipsa Mishra Poonam Mishra  Soundtrack All songs are composed by Prem Anand and the Song \"Mad Romeo\" is composed by \"G.Durga Prasad, Nabs & Saroj\".  Released This film was released in 12 June 2018 on the day of Raja Festival.The film did good business on the Box office.     References  ",
    "Categories": [
      "2010s Odia-language films",
      "2018 films",
      "Album infoboxes lacking a cover",
      "Articles with hAudio microformats",
      "Indian comedy films",
      "Indian films",
      "Odia-language films"
    ]
  },
  "9": {
    "Title": [
      "5 Weddings"
    ],
    "Director": [
      "Namrata Singh Gujral"
    ],
    "Starring": [
      "Nargis Fakhri",
      "Rajkummar Rao",
      "Bo Derek",
      "Candy Clark",
      "Anneliese van der Pol"
    ],
    "Running Time": 90,
    "Country": [
      "United States",
      "India",
      "Canada"
    ],
    "Language": [
      "Hindi",
      "English"
    ],
    "Time": [],
    "Location": [
      "India",
      "Los Angeles",
      "Punjab, India"
    ],
    "Text": "5 Weddings is a 2018 Indian film set in the United States and India. Directed by  Namrata Singh Gujral, the film features Nargis Fakhri, Rajkummar Rao, Bo Derek, Candy Clark, Anneliese Van der Pol and Suvinder Vicky (The Fourth Direction).  Plot An American journalist travels to India for a magazine feature on the multiple Indian wedding ceremonies. Film deals with weddings but also the community of transgender people called hijra who dance at these Indian weddings.  Cast Rajkummar Rao as police officer Harbhajan Singh Nargis Fakhri as Shania Dhaliwal Bo Derek as Mandy Singh Dhaliwal Soha Ali Khan as police officer Sanjana Kishore Ghosh Anneliese van der Pol as Whitney Simmons Shiwani Saini as Devika Suvinder Vicky as Police Commissioner Mr. Gill Saru Maini as Bhavna Mariana Vicente as Alexa DuPont Dawn Richard as Lydia Duniyer Diljott as Harleen Robert Palmer Watkins as Mark Cottell  Background The film was initially set to be filmed in 2008 with Namrata Singh Gujral and Harbhajan Mann in the lead. Due to her ten-year journey with cancer, Gujral ended up directing the film with Nargis Fakhri playing the lead role of Shania Dhaliwal and Rajkummar Rao playing the role of Harbhajan Singh. Rajkummar Rao's character was initially called Rahul but was changed to Harbhajan's name when Harbhajan Mann was being considered to play the lead.  Soundtrack Release The film is banned in Kuwait and Qatar because of the hijra / transgender angle and has undergone extensive censorship in India, Malaysia and several other countries.  Locations The film has been shot in Los Angeles, Hollywood, Burbank and in Chandigarh, Mohali and Mani Majra.  References Technology Partner: Letstrack Tech. Pvt. Ltd  External links 5 Weddings on IMDb  Official Website 5 weddings info",
    "Categories": [
      "2010s Hindi-language films",
      "2018 films",
      "Album infoboxes lacking a cover",
      "All Wikipedia articles written in Indian English",
      "Articles with hAudio microformats",
      "Crossover films",
      "English-language films",
      "Films about Indian weddings",
      "Films set in India",
      "Films set in Los Angeles",
      "Films set in Punjab, India",
      "Films shot in Los Angeles",
      "Indian drama films",
      "Indian films",
      "Track listings with input errors",
      "Transgender in film",
      "Use Indian English from December 2016",
      "Use dmy dates from December 2016"
    ]
  },
  "10": {
    "Title": [
      "6 Athiyayam"
    ],
    "Director": [
      "[]"
    ],
    "Starring": [
      "[]"
    ],
    "Running Time": 118,
    "Country": [
      "India"
    ],
    "Language": [
      "Tamil"
    ],
    "Time": [],
    "Location": [],
    "Text": "6 Athiyayam (English: 6 Chapters) is a 2018 Tamil-language horror anthology film. It includes six separate stories, each part being directed by a different director. The film was produced by Shankar Thiyagarajan with a promotional song composed by Sam C. S., and lyrics by Karki Bava. The film was released on 23 February 2018.  Production The film was produced by Shankar Thiyagarajan of Ascii Media Hut, for whom it is their debut production. Shankar stated he had the urge to do something experimental and pitched the idea of a horror anthology to various film-makers, eventually getting thirty young story writers who were interested. They then shortlisted five, and with Shankar's own film, it became six short films. In addition, for most of the directors, it is their debut film, with the exception of Cable Sankar who had previously directed the film, Thottal Thodarum (2015). Ajayan Bala also has experience in the industry, having written the screenplay for films such as Chennaiyil Oru Naal (2013), Vana Yuddham (2014) and Manithan (2016). Shankar Thiyagaran initially titled the film Hexa, with the tagline of 6 Athiyayam, but later made the tagline the title.  Cast and crew For each chapter Common credits Producer: Shankar Thiyagarajan Executive producer: Cable Sankar Music director: Taj Noor, Joshua, Sathish Kumar, Jose Franklin, Sam C. S. Choreography: Nanda Visual effects: V Focus Digital Media Director of Photography (Song): C. J. Rajkumar  Soundtrack The film's audio track was released on 30 October 2017 in a function attended by leading Tamil directors Cheran, Parthiban, Vetrimaran, A. Venkatesh, Arivazhagan and producer G. Dhananjayan. Composer Sam C. S. worked on a promotional song for the film and selected Kavitha Thomas to sing the track.  References External links 6 Athiyayam on IMDb",
    "Categories": [
      "2018 films",
      "2018 horror films",
      "Album infoboxes lacking a cover",
      "Articles containing explicitly cited English-language text",
      "Articles with hAudio microformats",
      "Indian anthology films",
      "Indian films",
      "Indian horror films",
      "Indian nonlinear narrative films",
      "Tamil-language films",
      "Use dmy dates from April 2015"
    ]
  },
  "11": {
    "Title": [
      "6 Balloons"
    ],
    "Director": [
      "Marja-Lewis Ryan"
    ],
    "Starring": [
      "Abbi Jacobson",
      "Dave Franco",
      "Charlotte Carel",
      "Madeline Carel",
      "Dawan Owens",
      "Jen Tullock",
      "Maya Erskine",
      "Tim Matheson",
      "Jane Kaczmarek"
    ],
    "Running Time": 74,
    "Country": [
      "United States"
    ],
    "Language": [
      "English"
    ],
    "Time": [],
    "Location": [],
    "Text": "6 Balloons is a 2018 American drama film written and directed by Marja-Lewis Ryan and starring Abbi Jacobson, Dave Franco, Charlotte Carel, Madeline Carel, Dawan Owens, Jen Tullock, Maya Erskine, Tim Matheson and Jane Kaczmarek. The film had its world premiere at South by Southwest on March 12, 2018. It was released on April 6, 2018, by Netflix.  Plot Katie (Abbi Jacobson) is preparing a surprise birthday party for her boyfriend Jack (Dawan Owens). While setting the celebration up, she exhibits Type-A quirks and consistently attempts to keep things on schedule. As her mother Gayle (Jane Kaczmarek) and her friends continue to set-up, Katie goes to pick up the cake and stops to pick up her brother Seth (Dave Franco) and his young daughter Ella along the way. After observing his unopened mail, Katie suspects that Seth has relapsed in his heroin addiction. Katie drives around town trying to find a detox center after Seth's previous one denies his insurance. Soon after sending Seth to a downtown detox center in a taxi and returning to the party with Ella, Katie receives a call that Seth is unable to be admitted. Katie finds Seth in a sickly state and continues to search for a center throughout the Los Angeles area, missing Jack's arrival to the surprise party. Seth pleads with Katie to buy heroin for him for pain relief. In a homeless area, Katie finds heroin for Seth, which is packaged in six balloons. Katie returns to the car and Seth asks her to go back and buy a needle from a man living under a tarp. Katie says no. So he begs her to go to a pharmacy.  At the drug store, the pharmacist realizes that Seth is a heroin user and gives Katie the key to the bathroom where she changes Ella, asking Seth not to use very much before Seth shoots up. Seth becomes revitalized and the three depart. Before leaving Seth hands Katie the key to the bathroom and laughs about her having to bring it back to the now closed Pharmacy. After Katie gets into an argument with the pharmacist and throws the bathroom key at the pharmacy door setting off the alarm, she runs back to the vehicle and before leaving the pharmacy backs into a light pole. While returning to the party, Katie jokes with Seth and they retrieve the cake. Seth promises that his latest injection is his final use of heroin. Back at the party, Katie's parents and Jack realize Seth is under the influence given his giddy behavior. They confront Katie over the night's events and she assumes guilt. Seth leaves Ella in the back yard while he leaves to use, leaving Ella to look for him. After family confronts Katie about Seth using, she finds Seth, who is injecting again in her car, and tells him that she will no longer take care of him, insisting that the only way for him to kick his addiction is for himself to check-in to rehabilitation without her help. Katie, no longer burdened, steps out of the car into a night sky filled with fireworks.  Cast Abbi Jacobson as Katie, Seth’s sister Dave Franco as Seth, Katie’s brother Tim Matheson as Gary Jane Kaczmarek as Gayle Maya Erskine as Cameron Dawan Owens as Jack Jen Tullock as Bianca  Production In October 2016, Abbi Jacobson, Dave Franco, Tim Matheson, and Jane Kaczmarek joined the cast of the film, while Marja-Lewis Ryan will direct the film from the screenplay she wrote. Samantha Housman, Ross Dinerstein, Channing Tatum, Reid Carolin and Peter Kiernan will produce the film under their Campfire and Free Association banners respectively.  Filming Principal photography began in October 2016.  Release The film had its world premiere at South by Southwest on March 12, 2018. It was released on April 6, 2018.  Critical reception On review aggregator website Rotten Tomatoes, the film holds an approval rating of 86% based on 28 reviews, and an average rating of 6.6/10. The website's critical consensus reads, \"Delicately sketched but thematically rich, 6 Balloons rises on Abbi Jacobson's gripping performance -- and marks writer-director Marja-Lewis Ryan as a talent to watch.\" On Metacritic, the film has a weighted average score of 66 out of 100, based on 7 critics, indicating \"generally favorable reviews\".  References External links 6 Balloons on IMDb",
    "Categories": [
      "2010s drama films",
      "2018 films",
      "American drama films",
      "American films",
      "English-language films",
      "Films about heroin addiction",
      "Films shot in California",
      "Netflix original films"
    ]
  },
  "12": {
    "Title": [
      "7 Din Mohabbat In"
    ],
    "Director": [
      "Meenu Gaur",
      "Farjad Nabi"
    ],
    "Starring": [
      "Mahira Khan",
      "Sheheryar Munawar"
    ],
    "Running Time": "[]",
    "Country": [
      "Pakistan"
    ],
    "Language": [
      "Urdu"
    ],
    "Time": [],
    "Location": [
      "Karachi"
    ],
    "Text": "7 Din Mohabbat In (lit. Love in 7 Days) is a 2018 Pakistani romantic comedy film with fantasy elements. It was directed by Meenu–Farjad under Matteela Films. Written by Fasih Bari Khan, the film features Mahira Khan and Sheheryar Munawar in lead roles and also stars Amna Ilyas, Mira Sethi, Hina Dilpazeer and Javed Sheikh. It released on Eid al-Fitr, 16 June 2018, under the production banners of Dawn Films and IMGC Global Entertainment, and has been distributed by Distribution Club in Pakistan and by B4U Motion Pictures internationally. It received mixed reviews from critics, with praising the film for strong performances and striking visuals, while some criticizing the lead characters and the storyline. Despite this, the film became a box office success.  Plot Tipu (Sheheryar Munawar) is a young introvert man and works in a jewellery shop. He is in need of a girl to love. Although his orphan cousin Neeli (Mahira Khan) lives with him along with his mother (Hina Dilpazeer), he doesn't show any affection to her but Neeli does. Tipu's mother dislikes Neeli and mistreats her. She wants to get rid of her and marry her with a goon Naseer Kankatta (Aamir Qureshi). One day, he inadvertly approaches a mysterious man who gives him a magic bottle to solve his problem. A djinn (Javed Sheikh) comes out of it and introduces himself as Dwarka Prasad from New Delhi. He gives Tipu a deadline of 7 days in which he has to be said \"I love you\" by a girl with a mole on her face. If he fails to do so, he will take him as his servant to the hell. He assures that Tipu's time  starts right then at 12 o'clock but Tipu discovers that the actual time was 30 mins behind.  So, Tipu starts his search for a girl with a mole on her face with the help of his friend Tingu Master (Danish Maqsood) but fails many times. Tingu suggests him a feminist Ghazala (Amna Ilyas) as she also has a mole on her face. Tipu succeeds in inviting Ghazala to a date. While on the date, Dwarka puts a bomb in Ghazala's bag and informs the police which results in her imprisonment.  After this failed attempt, Tipu is approached by a rich old lady Pino (Beo Rana Zafar) who tells him that she needs the necklace right then she had ordered earlier for her granddaughter Princess Sonu (Mira Sethi) who was landing that day from Frankfurt. Upon reaching Sonu's mansion, Tipu discovers that Sonu also has mole on her face. Meanwhile, Sonu discovers that her father lured her to Karachi intentionally to marry her with his bad-tempered nephew Sadiq Moti (Adnan Shah Tipu). Pino suggests her Tipu who can help her get rid of Sadiq. Ghazala's imprisonment provokes Tipu to go for Sonu but at the same times falls for Neeli.  Sonu succeeds in eloping with Tipu to a hotel even Dwarka tried to interrupt them. Neeli gets suspicious and Dwarka takes her to the hotel where she discovers that Tipu has another girl except her while Tipu reveals that Sonu is in love with Faadi (Emmad Irfani). Tipu gets relieved and approaches Neeli that he is all hers but Neeli refuses, telling that she had accepted Naseer's purposal and is getting married to him the very next day. Tipu gets heartbroken. On the 7th and wedding day, upon knowing that Tipu is going to stop the wedding, Dwarka bails out Ghazala disguised as Tipu's lawyer and informs her about Tipu's wedding. Enraged Ghazala teams up with her feminine group to break in the wedding. Upon reaching, Tipu gains sympathy of Ghazala and confronts Naseer with her help. Tipu and Neeli gets happily united and Tipu reveals to her the truth about Dwarka's challenge and deadline. Until then, Dwarka breaks in vanishes everyone except Tipu and Neeli. He wounds Tipu but Neeli reveals that she also has a mole near her ear. Dwarka ensures them that they are late as it was twenty-five minutes past twelve. But Neeli reveals to him that he is following New Delhi's time while there are still five minutes left to struck twelve according to Karachi's time. She quickly says \"I love you\" and their true love impowers Dwarka. In the end, an impowered Dwarka gets attention of Tipu's mother as she recognizes him as a man she loved while she was in Delhi. They eventually fall for each other while Tipu and Neeli gets happily married.  Cast Sheheryar Munawar as Tipu Mahira Khan as Nilofar \"Neeli\" Javed Sheikh as Dwarka Prasad Hina Dilpazeer as Tipu's mother Aamir Qureshi as Naseer Kankatta Amna Ilyas as Ghazala Mira Sethi as Princess Sonu Rimal Ali as Mona Lisa (Dance performance in song \"Saudai Saiyan\") Ayesha Omer as Tipu's date partner (Special appearance) Beo Raana Zafar as Parveen \"Pino\" Adnan Shah Tipu as Sadiq Moti Mohammed Ehteshamuddin (Cameo Role) Emmad Irfani as Faadi (Cameo Role) Danish Maqsood as Tingu Master  Production Development On 11 April 2016, Herald Entertainment, a company of the Dawn Media Group, signed a contract with Matteela Films, which also included to work on a film with the directorial duo Meenu Gaur and Farjad Nabi of Zinda Bhaag (2013) fame. Written by Fasih Bari Khan, Saat Din Mohabbat In was announced by Dawn Films on 1 March 2017 as their debut production, \"this moving film promises to be both a visual and musical treat for moviegoers,\" said an official spokesperson. On 17 July, it was reported that IMGC Global Entertainment signed an agreement to co-produce the film. Distribution Club Pvt Ltd was appointed the nationwide distributors. Speaking about the film, Sanam Mehdi; the executive producer of Dawn Films said, \"I believe this film will be the beginning of a new era in Pakistani cinema.\"  Casting Mahira Khan and Sheheryar Munawar were signed in the lead roles, and their names were revealed as the film was announced. It will be their second mutual film after Ho Mann Jahaan (2016). Khan said, \"I am doing a comedy film for the first time ever. I am nervous about excited as well.\"The cast that were initially signed in supporting roles include Amna Ilyas, Mira Sethi, Imran Aslam, Rehana Saigol, Rimal Ali, Aamir Qureshi and Adnan Shah Tipu. Ilyas commented on her role that \"You can also call this girl a feminist,\" because \"she believes in equality between men and women.\" Rimal Ali said, \"I was approached for the movie by producer, Sanam Mehdi and I knew I had to do it.\" Sethi signed this as her debut film, she said about her role, \"I am playing a British character\".On 22 August, it was announced that Javed Sheikh will also be a part of the film, on which he commented, \"We need more light hearted stories like these that have the potential to entertain the audience\". On 31 October, it was announced that the Bulbulay fame actresses Ayesha Omer and Hina Dilpazeer too joined the cast. Dilpazeer commented on her second film with Meenu–Farjad, \"I feel the audiences will love its unique storyline.\"  Filming After having rehearsals throughout July, the principal photography began on 1 August 2017 in Karachi, while the last spell was shot in November 2017. Rana Kamran has served as the cinematographer.  Soundtrack Film music has been composed by Arshad Mehmood, Shuja Haider and Shani Arshad. Wahab Shah joined the crew as choreographer.  Release Box office According to the box-office report, Saat Din Mohabbat In has managed to make Rs. 5.3 crores in Pakistani theaters on the Eid weekend. The film collected 8.05 crores in its 1st week including the next Friday.The film also collected 1.6 crores overseas in its first week. It collected 1.75 crores in its 2nd week, making its total domestic gross up to 9.8 crores. According to reports of 10 July, the film had already grossed 10.35 crores in Pakistan. The worldwide gross is still unknown but some sources reported that film had grossed 13 crores worldwide.  Critical Reception The film generally gathered positive reviews but some criticised it for its storyline and noted resemblance from Bollywood movies. Areebah Shahid from Bolo Jawan gave the film 2.5 out of 5 stars, stating, \"7 Din Mohabbat In is strictly a one-time watch that is unlikely to appeal to maturer audiences. Watch only because it’s the better of the three options this Eid and because Pakistani cinema needs your support. Shaheera Anwar from The Express Tribune gave a positive review with a rating of 3.5/5, stating ''All in all, 7DMI boasts of power-packed performances which will keep you entertained, even if you don’t quite take to the script.'' She praised the film's direction, dialogues and cast, and rewarded the film with the verdict as ''If you’re looking for beautiful sets, hilarious punch lines and some PG-rated comedy, 7DMI is your best bet.''Another review was given by Khusro Mumtaz from The News International, who wrote ''By the end, the movie limps across the finish line in a completely predictable fashion.''Dawn's staff writer Anum Rehman Chagani gave 4 out of 5 stars, praising the direction and visual effects, and said ''7DMI wouldn't have been bearable if it wasn't so darn visually appealing.'' She feels that few scenes were inspired by other movies, and wrote ''While Fasih Bari Khan is an intelligent writer, no doubt about it, the movie's story was a let-down.'' She praised the performances, specially from Mahira Khan ''With every role she takes on, it's becoming evident she's on a mission to reinvent herself, step out of her comfort zone and grow as an actor.''Aamna Haider Isani of Something Haute described the film as ''As a film, 7 Din Mohabbat In is absurd. It's a suspension of all logic and senses, encouraging you to take creative control and believe in the impossible. It's also absurd enough to allow you to believe in love, magic and the unexpected.'' She appreciated the film's writing, direction and special effects, stating ''Kudos to Faisal Bari Khan for writing such an emancipated script and to Farjad and Meenu for directing it to perfection. Attention to detail and special effects in the film are commendable.''Asjad Khan of  HIP praised its visual effects and wrote that \" It’s very safe to say that 7DMI has utilized CGI and sound design better than any other Pakistani film\". The editor also praised its screenplay and all in all praised the actors especially Mahira Khan and wrote \"In a very different role Mahira Khan proves that she is a versatile actress\".Amna Zaidi of  Siddy Says  praised the direction and wrote \"The directors have made sure everything, from the Karachi backdrop, to the background music, styling of characters, dialogues, action and comedy all play in harmony with each other delivering an entertaining flick\". She also praised the leading actors and complimented on Sheheryar Munawar, as \"Tipu played by Sheheryar Munawar is the highlight of the film, not only does he act like a dorkey 29 year old to perfection, he looks amazing on screen\" and  praised  Mahira Khan  and wrote \" Mahira is definitely on a roll and a journey to reinvent herself, and she is doing it like a boss. Her comic timing and expression show a new side of her, and you cant help fall in love with Neeli’s firecracker of a character\".Aparita Bhandari of CBC Arts  praised the film for its stand for women empowerment , dealing with LGBT issues and more powerful hidden elementsMahwash Ajaz of Khaleej Times wrote in the final review that \"It incorporates elements and motifs that swirls around in a giant melting pot and presents viewers  a fresh, original comedic romance that is worth your money. It's the kind of film you take your friends and family to - for a fun Eid outing\".  See also List of Pakistani films of 2018  References External links 7 Din Mohabbat In on IMDb  Matteela Films",
    "Categories": [
      "2010s romantic comedy films",
      "2018 films",
      "All Wikipedia articles written in Pakistani English",
      "CS1 maint: Multiple names: authors list",
      "Films featuring an item number",
      "Films set in Karachi",
      "Films shot in Karachi",
      "Pakistani films",
      "Pakistani romantic comedy films",
      "Track listings with input errors",
      "Urdu-language films",
      "Use Pakistani English from October 2017",
      "Use dmy dates from October 2017"
    ]
  },
  "13": {
    "Title": [
      "10 Days Before the Wedding"
    ],
    "Director": [
      "Amr Gamal"
    ],
    "Starring": [
      "Hadeel AbdulHakeem"
    ],
    "Running Time": 122,
    "Country": [
      "Yemen"
    ],
    "Language": [
      "Arabic"
    ],
    "Time": [],
    "Location": [],
    "Text": "10 Days Before the Wedding is a 2018 Yemeni drama film directed by Amr Gamal. It was selected as the Yemeni entry for the Best Foreign Language Film at the 91st Academy Awards, but it was not nominated.  Cast Sali Hamada as Rasha Khaled Hamdan as Ma'amon Mh'd Nagi Break as Salim Qassem Rashad as Mushtaq Bakkar Basaraheel as Waleed Abeer AbdulKareem as Samar  See also List of submissions to the 91st Academy Awards for Best Foreign Language Film List of Yemeni submissions for the Academy Award for Best Foreign Language Film  References External links 10 Days Before the Wedding on IMDb",
    "Categories": [
      "2010s drama film stubs",
      "2010s drama films",
      "2018 films",
      "All stub articles",
      "Arabic-language films",
      "Use dmy dates from October 2018",
      "Yemen stubs",
      "Yemeni films"
    ]
  },
  "14": {
    "Title": [
      "10x10"
    ],
    "Director": [
      "Suzi Ewing"
    ],
    "Starring": [
      "Kelly Reilly",
      "Luke Evans",
      "Olivia Chenery"
    ],
    "Running Time": 88,
    "Country": [
      "United States"
    ],
    "Language": [
      "English"
    ],
    "Time": [],
    "Location": [],
    "Text": "10x10 is a 2018 American thriller film directed by Suzi Ewing.  Plot A man abducts a flower shop owner and holds her captive in a small, soundproof room in an effort to extract a dark secret from her past.  Reception On Rotten Tomatoes, the film has an approval rating of 71% based on reviews from 7 critics, with an average rating of 4.8/10.  References External links 10x10 on IMDb  10x10 at AllMovie",
    "Categories": [
      "2010s thriller film stubs",
      "2010s thriller films",
      "2018 films",
      "All articles with topics of unclear notability",
      "All stub articles",
      "American films",
      "American thriller films",
      "Articles with topics of unclear notability from January 2019",
      "English-language films"
    ]
  },
  "15": {
    "Title": [
      "12 Strong"
    ],
    "Director": [
      "Nicolai Fuglsig"
    ],
    "Starring": [
      "Chris Hemsworth",
      "Michael Shannon",
      "Michael Peña",
      "Navid Negahban",
      "Trevante Rhodes",
      "Geoff Stults",
      "Thad Luckinbill"
    ],
    "Running Time": 129,
    "Country": [
      "United States"
    ],
    "Language": [
      "English"
    ],
    "Time": [
      "the 2000s"
    ],
    "Location": [
      "Afghanistan"
    ],
    "Text": "12 Strong (also known as 12 Strong: The Declassified True Story of the Horse Soldiers) is a 2018 American action war drama film directed by Nicolai Fuglsig and written by Ted Tally and Peter Craig. The film is based on Doug Stanton's non-fiction book Horse Soldiers, which tells the story of U.S. Army Special Forces sent to Afghanistan immediately after the September 11 attacks. The film stars Chris Hemsworth, Michael Shannon, Michael Peña, Navid Negahban, Trevante Rhodes, Geoff Stults, Thad Luckinbill, William Fichtner, and Rob Riggle. Principal photography began in January 2017 in New Mexico. The film was released in the United States on January 19, 2018 by Warner Bros. Pictures, in standard and IMAX theaters. It received mixed reviews from critics, who praised the cast and action but criticized the by-the-numbers execution and lack of hindsight of the War in Afghanistan.  Plot Mitch Nelson, a  US Army Captain with Green Berets Operational Detachment Alpha (ODA) 595, is moving into a new home with his wife and daughter on September 11, 2001, after receiving an assignment to staff duty under LTC Bowers. As news of the devastating terrorist attacks that day break, Nelson volunteers to lead 595 into Afghanistan. Bowers initially refuses, but veteran soldier CW5 Hal Spencer, previously scheduled to retire, persuades Bowers to give Nelson command of 595 again, as well as volunteering himself for the deployment. After leaving their families, 595 travels to Uzbekistan on October 7, 2001. After being briefed and evaluated by COL Mulholland, Commander of 5th Special Forces Group, Nelson and 595 are picked to fight alongside Northern Alliance leader Abdul Rashid Dostum. ODA 595 is inserted covertly in Afghanistan aboard an MH-47 Chinook flown by 160th SOAR. They land 40 miles south of Mazar-i Sharif, the country's fourth-largest city and a longtime stronghold of the Taliban, where they meet Dostum.  Six of the 12 members, led by Nelson, leave with Dostum to the mountains, while the other six remain in a fortified camp nicknamed \"The Alamo\" under Spencer's command. Dostum is attempting to capture the northern Afghanistan city, while battling Taliban leader Mullah Razzan, who rules local communities brutally under strict Sharia law, and has murdered several people, including Dostum's family. Although the warlord is initially skeptical of Nelson's abilities, Nelson gradually earns Dostum's respect. In one battle, however, Dostum makes a tactical error, costing several casualties. Nelson accuses Dostum of acting carelessly with the lives of his men and of withholding valuable information, while Dostum retorts that he still feels that Nelson, and the U.S., is not willing to pay the potential price of the conflict, and tells Nelson that he needs to use his heart and mind to \"be a warrior\" instead of a soldier. The two eventually reconcile, and, after splitting off a three-man element under SFC Sam Diller to strike a Taliban supply route, and being joined by Spencer's half of ODA 595, continue to work together. They win several victories with Dostum's leadership and manpower and American airpower, making significant progress towards Mazar-i Sharif. Suddenly, however, Spencer informs Nelson that another ODA, 555, has been dispatched to support Atta Muhammad, another Northern Alliance leader, who is Dostum's political rival. When Nelson is forced to tell Dostum, the furious warlord and his men promptly abandon 595. Following Dostum's departure, Nelson plans to continue operating against the Taliban with his Americans and the few Afghan fighters remaining with them. Encountering a large force of Al-Qaeda and Taliban fighters and armored vehicles, ODA 595, rejoined by Diller and his element, uses air support to eliminate many of the fighters and most of the armor, but are discovered and attacked. Spencer is critically injured by a suicide bomber, and the team is about to be overrun under heavy Taliban and Al-Qaeda pressure when Dostum returns with his forces. Carrying out the US Army’s first cavalry charge of the 21st century, the American and Northern Alliance forces disperse the Taliban and Al-Qaeda, and Dostum tracks down and kills Razzan. After Spencer is medevaced, Nelson and Dostum continue to Mazar-i-Sharif but find Atta Muhammad has beaten them there. Against expectations, Dostum and Muhammad meet peacefully and put aside their differences. Impressed by Nelson and the Americans' efforts, Dostum gives Nelson his prized riding crop and tells him that he will always consider Nelson a brother and fellow fighter but remember that Afghanistan is the graveyard of empires. Spencer ultimately survives, and all 12 soldiers of ODA 595 return home after 23 days of almost continuous fighting in Afghanistan. The film’s penultimate moment shows a photo of the Horse Soldier Statue in New York City, based on the soldiers of ODA 595 and their victory in the early stages of the response to the September 11th attacks, dedicated to all United States Special Forces. The film then ends with a photo of the actual members of ODA 595, in combat fatigues, upon whom 12 Strong was based.  Cast Chris Hemsworth as Captain Mitch Nelson, ODA 595’s commander, inspired by Mark Nutsch. Michael Shannon as Hal Spencer, a Chief Warrant Officer 5 and ODA 595‘s assistant team leader, inspired by Bob Pennington. Michael Peña as Sam Diller, ODA 595’s intelligence Sergeant First Class Navid Negahban as General Dostum, a leader of the Northern Alliance and future Vice President of Afghanistan Trevante Rhodes as Ben Milo, a Sergeant First Class in ODA 595 William Fichtner as Colonel Mulholland, Commander of 5th Special Forces Group Geoff Stults as Sean Coffers, member of ODA 595 Thad Luckinbill as Vern Michaels, member of ODA 595 Ben O'Toole as Scott Black, member of ODA 595 Kenny Sheard as Bill Bennett, a Sergeant First Class in ODA 595 Austin Stowell as Fred Falls, a Staff Sergeant in ODA 595 Austin Hébert as Pat Essex, a Master Sergeant in ODA 595 Jack Kesy as Charles Jones, member of ODA 595 Kenneth Miller as Kevin Jackson, member of ODA 595 Elsa Pataky as Jean Nelson, Mitch's wife (actors Hemsworth and Pataky are married in real life) Rob Riggle as Lt. Colonel Bowers, Commander of 3rd Battalion, 5th Special Forces Group Taylor Sheridan as Brian, a paramilitary field officer with the CIA's Special Activities Division who meets ODA 595 when the SOAR deliver them to Afghanistan Fahim Fazli as Khaled, a commander in Afghanistan's Northern Alliance Laith Nakli as Commander Ahmed Lal  Production Development On December 2, 2011, it was announced that producer Jerry Bruckheimer had taken out the script by Ted Tally and rewritten by Peter Craig with Nicolai Fuglsig attached to direct, which was bought by Walt Disney Pictures in 2009 for Bruckheimer, based on Doug Stanton's non-fiction book Horse Soldiers. On March 29, 2016, Deadline reported that Bruckheimer had officially hired Fuglsig to make his feature film directorial debut, which would be co-financed and produced by Molly Smith, Trent Luckinbill and Thad Luckinbill through Black Label Media, along with Bruckheimer's Jerry Bruckheimer Films.  Casting On September 30, 2016, Chris Hemsworth and Michael Shannon were cast in the film, and later on November 1, Michael Peña also joined the film. On November 3, 2016, Trevante Rhodes was cast in the film. On November 14, 2016, Austin Stowell was cast in the film to play Staff Sergeant Fred Falls, an American soldier on the elite U.S. Special Forces team. Lionsgate would handle the film's distribution. On November 15, 2016, Austin Hébert was cast to play SFC Pat Essex, the intellectual and engineer of the team, and the same day it was reported that Ben O'Toole had also been cast for an unspecified role. On November 17, 2016, Variety reported that Navid Negahban was cast to play General Abdul Rashid Dostum in the film. Elsa Pataky was revealed to be appearing in the film in December 2016, while on February 3, 2017, Deadline reported that Rob Riggle joined the film to play Army Lieutenant Colonel Max Bowers, under whom Riggle actually served while he was a Marine Captain.  Filming Principal photography began in early January 2017 in New Mexico. Mines near Orogrande, New Mexico, were used. Later the shooting took place in Socorro, where it ended on January 26 after eight days of filming. The film was also shot in Alamogordo, using the White Sands National Monument as shooting location. The scenes involving military encampments were filmed using 20 structures leased from AKS Military, a private manufacturer of military shelters.  Home media Warner Bros. Home Entertainment released 12 Strong digitally April 10, and on Blu-ray Disc and DVD May 1. Blu-ray extras include the featurettes \"12 Strong: The Making of an Impossible Mission\" and \"Monumental Effort: Building America's Response Monument.\"  Postscript The films postscript reads as follows: \"Against overwhelming odds, all twelve members of the U.S. Army Special Forces ODA 595 survived their mission.  The capture of Mazar-i-Sharif by the Horse Soldiers and their counterparts is one of the US military's most stunning achievements.  Military planners predicted it would take two years. Task Force Dagger did it in three weeks. Al Qaeda considers this to be their worst defeat. Because their mission was classified, the men of Special Forces ODA 595 returned home to their everyday lives with no fanfare or public acknowledgment of the near impossible mission they completed. In 2014, General Dostum became Vice President of Afghanistan. Dostum and Mitch Nelson remain close friends to this day. In 2012, to honor their extraordinary heroism, a statue of a Horse Soldier was dedicated at the World Trade Center site.\"  Reception Box office 12 Strong grossed $46.7 million in the United States and Canada, and $24.1 million in other territories, for a worldwide total of $70.8 million, against a production budget of $35 million.In the United States and Canada, 12 Strong was released on January 19, 2018 alongside Den of Thieves and Forever My Girl, as well as the wide expansions of Phantom Thread, I, Tonya and Call Me by Your Name, and was projected to gross $15–20 million from 3,002 theaters in its opening weekend. It ended up debuting to $15.8 million, similar to the $16.1 million that war film 13 Hours: The Secret Soldiers of Benghazi opened to in January 2016, and finished second at the box office behind Jumanji: Welcome to the Jungle. According to ComScore, 55% of the opening weekend audience was male, with 79% being over the age of 25. The following week dropped 45% to $8.6 million, finishing 6th at the box office.  Critical response On review aggregator Rotten Tomatoes, the film has an approval rating of 52% based on 157 reviews, and an average rating of 5.5/10. The website's critical consensus reads, \"12 Strong has a solid cast, honorable intentions, and a thrilling, fact-based story — all of which are occasionally enough to balance a disappointing lack of depth or nuance.\" On Metacritic, the film has a weighted average score of 54 out of 100, based on reviews from 43 critics, indicating \"mixed or average reviews\". Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale, while PostTrak reported filmgoers gave an 81% overall positive score and a 63% \"definite recommend\".Richard Roeper of the Chicago Sun-Times gave the film 2.5 out of 4 stars, saying, \"...with a running time of two hours and 10 minutes, 12 Strong has at least 20 minutes of scenes that are either unnecessary or repetitive...[it] winds up being an almost-good film about some great American soldiers.\" Matt Bobkin of Exclaim! gave the film a 4 out of 10, calling it \"a lazy attempt at injecting something fresh into the 9/11 narrative.\"  Accolades Related links 5th Special Forces Group America's Response Monument  References External links Official website 12 Strong, Warner Bros. website 12 Strong on IMDb   12 Strong at AllMovie",
    "Categories": [
      "2010s drama films",
      "2010s war films",
      "2018 films",
      "Action war films",
      "American films",
      "American war drama films",
      "Directorial debut films",
      "Drama films based on actual events",
      "English-language films",
      "Films about United States Army Special Forces",
      "Films about terrorism",
      "Films based on non-fiction books",
      "Films based on the September 11 attacks",
      "Films produced by Jerry Bruckheimer",
      "Films scored by Lorne Balfe",
      "Films set in Afghanistan",
      "Films set in the 2000s",
      "Films shot in New Mexico",
      "Official website different in Wikidata and Wikipedia",
      "War adventure films",
      "War films based on actual events",
      "War in Afghanistan (2001–present) films",
      "Warner Bros. films"
    ]
  },
  "16": {
    "Title": [
      "The 15:17 to Paris"
    ],
    "Director": [
      "Clint Eastwood"
    ],
    "Starring": [
      "Anthony Sadler",
      "Alek Skarlatos",
      "Spencer Stone"
    ],
    "Running Time": 94,
    "Country": [
      "United States"
    ],
    "Language": [
      "English"
    ],
    "Time": [
      "2005",
      "2015"
    ],
    "Location": [
      "Amsterdam",
      "Paris"
    ],
    "Text": "The 15:17 to Paris is a 2018 American biographical drama film produced and directed by Clint Eastwood and written by Dorothy Blyskal, based on the autobiography The 15:17 to Paris: The True Story of a Terrorist, a Train, and Three American Heroes by Jeffrey E. Stern, Spencer Stone, Anthony Sadler, and Alek Skarlatos. The film stars Stone, Sadler, and Skarlatos as themselves and follows the trio as they stop the 2015 Thalys train attack; Judy Greer and Jenna Fischer also star. The 15:17 to Paris was released in the United States on February 9, 2018, by Warner Bros. Pictures. It received negative reviews from critics, who called it \"well-intentioned\" but \"strained to wring a full-length feature's worth of drama out of [an event] that was over in a few minutes\", and grossed $57 million worldwide against a production budget of $30 million.  Plot Spencer Stone and Alek Skarlatos are attending a suburban Christian middle school. They bond over their interest in guns, and are often sent to the principal's office for disciplinary action. Once, while sent to the principal's office, they meet another student, who often misbehaves in school, Anthony Sadler, and the three become friends. Spencer and Alek are from single mother homes, and their mothers often stick up for them when called to the principal's office regarding their misconduct. While working part time at a smoothie shop, Spencer waits on a recruiter for the United States Marine Corps. He asks the recruiter what military branch he would select if he could go back. The recruiter replies that the Air Force pararescue save lives and \"seem to being doing fine work in the field.\" Spencer is intrigued and decides  that he wants to join up. So he begins working out to lose some extra weight. After several months of rigorous training and exercise, he gets into much better shape and enlists in the Air Force in hopes of becoming a Pararescueman. Upon completing basic training, Spencer takes his exams to qualify for pararescue school. But having poor depth perception, he is turned down. Upset, he chooses from the other Air Force options left to him, and is soon stationed abroad. His friend, Alek, enlisted in the Army, and has been deployed to Afghanistan. On Skype, Alek tells him that he is planning to visit his girlfriend in Germany, and the two decide to rendezvous there for their next leave. Spencer skypes Anthony, now a college student, and talks him into coming to Europe for a vacation, visiting Italy. Afterwards, the three meet in Germany and decide to go to Amsterdam. After a few days there, they finally decide to visit France after deliberation. They depart from Amsterdam Centraal station on the 15:17 train to Paris. On the train, all seems well, until American-born Frenchman Mark Moogalian notices that one of the toilets has been occupied for an unusually long time. When he goes to investigate, a terrorist bursts out with an assault rifle. Another passenger, Damien A., grabs the terrorist by the neck and Moogalian manages to wrest the rifle from the terrorist but is then shot in the back with a 9mm pistol. Passengers begin to flee out of their seats and rush toward the forward cabins of the train, trying to escape. Eventually, the terrorist approaches the next car, where Spencer and his friends are sitting. The moment Spencer sees him, he springs into action. He decides that his only hope, and the only hope of the remaining passengers, is for him to try to defeat the terrorist. Spencer makes a desperate all-out sprint toward the terrorist in the hope of subduing him before being shot. By remarkable luck, the terrorist's weapon jams just as he is about to fire, and he is tackled by Spencer, who successfully disarms the terrorist. Seeing Spencer's progress in subduing the terrorist, Alek, Anthony, and other passengers join the effort to try to further overwhelm the terrorist, finally knocking him out. Spencer then stanches the bleeding by plugging the exit wound in Moogalian's neck with his fingers. The police at the next station enter the train fully armed, discovering that Spencer has subdued the terrorist, and they begin to treat his wounds, and the more serious ones of the shot passenger. Paramedics take Moogalian to the emergency room at a local hospital and he survives. In a formal ceremony, Spencer, Alek and Anthony are recognized as heroes of France for their gallantry and bravery. The terrorist was later discovered to have been armed with over 300 rounds of ammunition with the apparent aim of using all of it to wreak havoc on all those who boarded the train. The odds of the particular misfire and jam of the cartridge in the terrorist's weapon was estimated on the scene as being over a thousand-to-one, and highly unlikely to have been in Spencer's favor. French officials at the ceremony to honor Spencer's selfless act acknowledge his bravery and he is awarded the French Legion of Honour in recognition of his act of courage. On September 22, 2015, Mark Moogalian was awarded the Legion of Honor by President François Hollande for his actions on the train.  Cast Spencer Stone as himself Anthony Sadler as himself Alek Skarlatos as himself Mark Moogalian as himself Isabelle Risacher Moogalian as herself Judy Greer as Joyce Eskel, Spencer’s mother Jenna Fischer as Heidi Skarlatos, Alek’s mother Ray Corasani as Ayoub El-Khazzani Chris Norman as himself P. J. Byrne as Mr. Henry Sinqua Walls as Marine Tony Hale as Coach Murray Thomas Lennon as Principal Michael Akers Jaleel White as Garrett WaldenAdditionally, Paul-Mikel Williams, Max Ivutin, Bryce Gheisar, Cole Eichenberger, and William Jennings portray younger versions of Stone, Sadler, and Skarlatos.  Production On April 20, 2017, it was announced that Clint Eastwood would next direct The 15:17 to Paris from a screenplay by newcomer screenwriter Dorothy Blyskal based on the book The 15:17 to Paris: The True Story of a Terrorist, a Train, and Three American Heroes. It was announced that Eastwood would begin casting immediately for a principal production start date of later that year. On June 21, 2017, it was announced that Eastwood had chosen Kyle Gallner, Jeremie Harris and Alexander Ludwig to star as Alek Skarlatos, Anthony Sadler and Spencer Stone although offers had not yet been made.On July 11, 2017, it was announced that Eastwood had cast Sadler, Skarlatos and Stone as themselves in the film which will \"begin during their childhood and show their friendship leading up to the moment that changed their lives\". It was also announced that the film had commenced principal production. On July 13, 2017, Tony Hale and Thomas Lennon joined the cast as staff members of a school the lead three men attended as children. On August 1, 2017, Sinqua Walls was cast in the film for an unspecified role. Mark Moogalian and Isabelle Risacher Moogalian were also cast as themselves in the film.  Release The film was released in the United States on February 9, 2018. The film was originally rated R by the MPAA for \"a sequence of violence and bloody images\", but received a PG-13 rating upon appeal.  Home media The 15:17 To Paris was released on HD digital copies on May 1, 2018. The film was then released on Blu-ray and DVD on May 22, 2018.  Reception Box office The 15:17 to Paris grossed $36.3 million in the United States and Canada, and $20.6 million in other territories, for a worldwide total of $56.9 million, against a production budget of $30 million.In the United States and Canada, the film was released alongside Peter Rabbit and Fifty Shades Freed, and was projected to gross $10–15 million from 3,042 theaters in its opening weekend. It ended up making $12.6 million, finishing third at the box office behind its two fellow releases. The film dropped 40% in its second weekend to $7.6 million ($8.9 million over the four-day Presidents Day weekend), finishing fifth.  Critical response On review aggregator Rotten Tomatoes, the film has an approval rating of 24% based on 152 reviews, and an average rating of 4.3/10. The website's critical consensus reads, \"The 15:17 to Paris pays clumsily well-intentioned tribute to an act of heroism, but by casting the real-life individuals involved, director Clint Eastwood fatally undermines his own efforts.\" On Metacritic, the film has a weighted average score of 45 out of 100, based on 36 critics, indicating \"mixed or average reviews\". Audiences polled by CinemaScore gave the film an average grade of \"B–\" on an A+ to F scale.Writing for Showbiz411, Roger Friedman acknowledged the film's attempts to be different by casting the real-life men and said, \"If there’s a problem with 15:17 it’s that it’s almost filmed like cinéma vérité, certainly as the story unfolds. There’s a lot of exposition and it seems slow. Again, a little patience wouldn’t hurt anyone. Because when the kids’ backstories switch to the main guys, Eastwood finds a groove. Forgive him if the entry seems clunky.\" Similarly, A. O. Scott of The New York Times gave the film a positive review and wrote, \"But [Eastwood's] workmanlike absorption in the task at hand is precisely what makes this movie fascinating as well as moving. Its radical plainness is tinged with mystery.\" Matt Zoller Seitz of RogerEbert.com gave the film two out of four stars, stating that \"[a] good 70% of [The 15:17 to Paris] is inert, its affable nothingness redeemed only by the laid-back charisma of three men\", although he praised the film's \"poker-faced sincerity\" and the \"superb\" climactic train scene.  References External links Official website The 15:17 to Paris on IMDb   The 15:17 to Paris at AllMovie  The 15:17 to Paris at History vs. Hollywood",
    "Categories": [
      "2010s action films",
      "2010s biographical films",
      "2018 films",
      "American action films",
      "American biographical films",
      "American films",
      "Crime films based on actual events",
      "English-language films",
      "Films about terrorism",
      "Films directed by Clint Eastwood",
      "Films set in 2005",
      "Films set in 2015",
      "Films set in Amsterdam",
      "Films set in Paris",
      "Films set on trains",
      "Films shot in Atlanta",
      "Films shot in Brussels",
      "Films shot in Paris",
      "Films shot in Rome",
      "Films shot in Venice",
      "Films shot in the Netherlands",
      "Malpaso Productions films",
      "Thriller films based on actual events",
      "Village Roadshow Pictures films",
      "Warner Bros. films"
    ]
  },
  "17": {
    "Title": [
      "18.05.2009"
    ],
    "Director": [
      "K Ganeshan"
    ],
    "Starring": [
      "Subash Chandra Bose",
      "Dhaanya"
    ],
    "Running Time": 130,
    "Country": [
      "India"
    ],
    "Language": [
      "Tamil"
    ],
    "Time": [],
    "Location": [],
    "Text": "18.05.2009 (lit. 18 May 2009) is a 2018 Indian Tamil language drama war film written and directed by K Ganeshan. The date of the film title represents the victory day for Sri Lanka as it depicts the eradication of the 30 year long Civil War in Sri Lanka. Sri Lanka's then President Mahinda Rajapaksa played a pivotal role in eradicating the terrorism from the country. The music is scored by Isaignani Ilaiyaraaja. Dhaanya made her acting debut through this film which she depicted it as a difficult debut.The music for the film is composed by veteran music director Ilaiyaraaja.     References  ",
    "Categories": [
      "2010s Tamil-language film stubs",
      "2010s Tamil-language films",
      "2018 films",
      "All stub articles",
      "Indian films",
      "Indian films based on actual events",
      "Indian war films",
      "Sri Lankan Civil War in film",
      "Tamil-language films",
      "Tamil films scored by Ilaiyaraaja",
      "War drama film stubs"
    ]
  },
  "18": {
    "Title": [
      "22 July"
    ],
    "Director": [
      "Paul Greengrass"
    ],
    "Starring": [
      "Anders Danielsen Lie",
      "Jon Øigarden"
    ],
    "Running Time": 143,
    "Country": [
      "United States"
    ],
    "Language": [
      "English"
    ],
    "Time": [
      "2011"
    ],
    "Location": [
      "Norway"
    ],
    "Text": "22 July is a 2018 Norwegian-American crime drama film about the 2011 Norway attacks and their aftermath, based on the book One of Us: The Story of a Massacre in Norway — and Its Aftermath by Åsne Seierstad. The film was written, directed and produced by Paul Greengrass and features a Norwegian cast and crew. It stars Anders Danielsen Lie, Jon Øigarden, Thorbjørn Harr, Jonas Strand Gravli, Ola G. Furuseth, Ulrikke Hansen Døvigen, Isak Bakli Aglen, Maria Bock and Seda Witt. The film had its world premiere on September 5, 2018 in the main competition section of the 75th Venice International Film Festival. On September 5, the film was screened at the 75th Venice International Film Festival and released online and in select theaters on October 10, 2018, by Netflix.  Plot Anders Behring Breivik dresses in a police uniform, loads a van with home-made explosives, and drives to Regjeringskvartalet, the executive government quarter in Oslo, Norway. He leaves the van outside the office of Prime Minister Jens Stoltenberg. Moments later, it explodes, causing several casualties.  On the island of Utøya in Tyrifjorden, Buskerud, teenagers have arrived for Workers' Youth League (AUF) summer camp, organised by the ruling Labour Party. When they learn of the bombing, one student, Viljar Hanssen, calls his parents to make sure they are unhurt. Breivik arrives at the ferry landing and tells staff he is a police officer sent to secure the island following the attack. The camp director transport him to the island by boat. Breivik instructs the staff to gather the children in one location. When the head of security asks for ID, Breivik shoots him and the director dead. The children flee as Breivik opens fire, murdering dozens. Viljar and his brother Torje hide on a rocky embankment on the beach. Viljar calls his mother to tell him a shooting is in progress. Breivik finds the group and starts shooting. Viljar is shot multiple times, but Torje escapes unharmed. Breivik surrenders to a tactical team and is brought inland for interrogation. Breivik claims he is the leader of a white nationalist group called the Knight's Templar and that more attacks will happen on his signal. He requests the aid of lawyer Geir Lippestad, who defended a Neo-Nazi. Lippestad is morally conscientious of his client and professionally bonded by his ethics as a lawyer. Lippestad tries to argue an insanity defense for Breivik, which draws criticism as it means he will be institutionalized instead of imprisoned. With the help of various psychiatrists and psychologists, Breivik is possibly diagnosticated with paranoid schizophrenia. Breivik tells Lippestad he wants to be declared competent to legitimize his attacks. Viljar wakes from a coma with life-changing injuries and returns home with his family. He learns to walk again, but is haunted by memories of the attack. With the support of his mother, and another survivor of the attack on Utøya, he appears in court as a witness and delivers an account of the massacre. Breivik is sentenced to life imprisonment.  Cast Anders Danielsen Lie as Anders Behring Breivik Jon Øigarden as Geir Lippestad Thorbjørn Harr as Sveinn Are Hanssen Jonas Strand Gravli as Viljar Hanssen Ola G. Furuseth as Jens Stoltenberg Ulrikke Hansen Døvigen as Inga Bejer Engh Isak Bakli Aglen as Torje Hanssen Maria Bock as Christin Kristoffersen Tone Danielsen as Judge Wenche Arntzen Sonja Sofie Sinding as Lycke Lippestad Turid Gunnes as Mette Larsen Kenan Ibrahamefendic as Dr. Kolberg Monica Borg Fure as Monica Bøsei Ingrid Enger Damon as Alexandra Bech Gjørv Seda Witt as Lara Rashid Anja Maria Svenkerud as Siv Hallgren Hasse Lindmo as Svein Holden  Production On August 21, 2017, Paul Greengrass announced that he was working on a new Netflix movie focused on the 2011 Norway attacks and aftermath. The production began at the end of 2017.  The trailer of the film was released on September, 4, 2018.  Greengrass revelead that he used Norwegian actors and crew for the film, because he considered that the film should be identified like a Norwegian film. He also revelead that he didn’t use the Norwegian language for the film, because he didn’t speak Norwegian, so he looked for actors who can speak English.  Release The film had released its world premiere at the 75th Venice International Film Festival on September 5, 2018. The film was also screened at the Toronto International Film Festival on September 10, 2018, it also had a special presentation in Scandinavia theaters on October 4, 2018.  The film was released on October 10, 2018 on Netflix and in select theaters. It was originally scheduled to be released on November 2, 2018, under the title Norway.  Critical response On review aggregator Rotten Tomatoes, the film holds an approval rating of 79%, based on 111 reviews, with an average rating of 6.9/10. The website's critical consensus reads, \"22 July offers a hard-hitting close-up look at the aftereffects of terrorism, telling a story with a thriller's visceral impact and the lingering emotional resonance of a drama.\" On Metacritic, the film has a weighted average score of 69 out of 100, based on 27 critics, indicating \"generally favorable reviews\".  See also Seconds From Disaster season 6: \"Norway Massacre: I Was There\" (airdate July 22, 2012) Utøya: July 22 (2018), a Norwegian drama film directed by Erik Poppe  References External links 22 July on IMDb  22 July at Rotten Tomatoes 22 July at Metacritic",
    "Categories": [
      "2010s crime drama films",
      "2010s documentary films",
      "2011 Norway attacks",
      "2018 films",
      "American crime drama films",
      "American documentary films",
      "American films",
      "Docudramas",
      "Documentary films about terrorism",
      "English-language films",
      "Films based on actual events",
      "Films directed by Paul Greengrass",
      "Films produced by Scott Rudin",
      "Films set in 2011",
      "Films set in Norway",
      "Films shot in Norway",
      "Netflix original films",
      "Use mdy dates from September 2018"
    ]
  },
  "19": {
    "Title": [
      "22 Yards"
    ],
    "Director": [
      "Mitali Ghoshal"
    ],
    "Starring": [
      "Barun Sobti",
      "Rajit Kapur",
      "Panchi Bora",
      "Rajesh Sharma"
    ],
    "Running Time": "[]",
    "Country": [
      "India"
    ],
    "Language": [
      "Hindi"
    ],
    "Time": [],
    "Location": [],
    "Text": "22 Yards is a 2018 Indian sports drama  film starring Barun Sobti, Rajit Kapur, Panchi Bora and Rajesh Sharma. The film has been directed by sports journalist turned filmmaker Mitali Ghoshal. The film premiered at the 2018 Bay Area South Asian Film Festival and is scheduled to release theatrically on 15 March 2019. The trailer of the film was launched by Sourav Ganguly.  Plot 22 Yards is about a successful sports agent and his fall from grace. The film delves into the commercial aspects of sports. Barun Sobti plays the lead, a cricket enthusiast and a talent manager.  Cast Barun Sobti Amartya Ray Panchi Bora Rajit Kapur Rajesh Sharma Chaiti Ghoshal Geetika Tyagi  Release and reception 22 Yards had its world premiere at the inaugural Bay Area South Asian Film Festival (BASAFF 2018) where Barun Sobti bagged the Best Actor (Feature) award. The film is slated to release on 22 February 2019.  References External links 22 Yards on IMDb",
    "Categories": [
      "2010s Hindi-language films",
      "2018 films",
      "All Wikipedia articles written in Indian English",
      "Articles with short description",
      "Hindi-language films",
      "Indian films",
      "Indian sports films",
      "Use Indian English from February 2019",
      "Use dmy dates from February 2019"
    ]
  },
  "20": {
    "Title": [
      "24 Kisses"
    ],
    "Director": [
      "Ayodhyakumar Krishnamsetty"
    ],
    "Starring": [
      "[]"
    ],
    "Running Time": 140,
    "Country": [
      "India"
    ],
    "Language": [
      "Telugu"
    ],
    "Time": [],
    "Location": [],
    "Text": "24 Kisses (Telugu: 24 కిస్సెస్) is a 2018 Indian Telugu language romantic comedy film about modern age relationships and the transformation of the lead characters. It was directed by Ayodhyakumar Krishnamsetty, and starring Adith Arun, Hebah Patel, Rao Ramesh, Naresh and Ravi Varma. The film was written by Ayodhyakumar Krishnamsetty along with Harishankar Tamminana. Is was co-produced by Ayodhyakumar Krishnamsetty and Giridhar Mamidipally. The film cinematography by Uday Gurrala and editing by Anil Aalayam. It was released under the banner, Silly Monks Entertainments on 23 November in  2018. It seems an autobiographical reference to the incidents in the director's life.  Plot Filmmaker Anand (Adith Arun) is not interested in the institution of marriage. He doesn't want to get married anytime soon, though he had several affairs. Once he gets into a relationship with Sri Lakshmi (Hebah Patel) as well. But fortunately, Lakshmi falls in love with Anand and involve herself in learning his ideology in the institution of marriage, she breaks up her ways with him. Rest of the story is as to how Anand changes his thought process and wins his love back.  Cast Adith Arun as Anand Hebah Patel as Sri Lakshmi Rao Ramesh Naresh as Sri Lakshmi's father Ravi Varma Aditi Myakal as Vishwa Kishore Gundala as Sudheer Srinivasa Kapavarapu as Praveen  Soundtracks All lyrics written by Ramajogayya Sastry; all music composed by Joi Barua.  References External links 24 Kisses on IMDb   24 Kisses at Rotten Tomatoes",
    "Categories": [
      "2010s romantic comedy films",
      "2018 films",
      "Articles containing Telugu-language text",
      "Articles with hAudio microformats",
      "Film articles using image size parameter",
      "Films about couples",
      "Films about film directors and producers",
      "Films about marriage",
      "Indian comedy-drama films",
      "Indian films",
      "Indian romantic comedy films",
      "Indian romantic drama films",
      "Telugu-language films"
    ]
  },
  "21": {
    "Title": [
      "27 Guns"
    ],
    "Director": [
      "Natasha Museveni Karugire",
      "Sharpe Ssewali"
    ],
    "Starring": [
      "Arnold Mubangizi",
      "Diana Museveni Kamuntu",
      "Sezi Jedediah Nuwewenka",
      "Godwin Ahimbisibwe",
      "Precious Kamwine Amanya",
      "Daphne Ampire",
      "Einstein Ayebare",
      "T. Steve Ayeny",
      "Geofrey Bukenya",
      "Patrick Kabayo",
      "Diana Kahunde",
      "Daniel Kandiho",
      "Bint Kasede",
      "Allan Katongole",
      "Alvin Katungi",
      "Kenny Katuramu",
      "Aggie Kebirungi",
      "Aganza Kisaka",
      "Cleopatra Koheirwe",
      "Timothy Magara",
      "John Magyezi",
      "Patrick Massa",
      "Melvin Mukasa",
      "Daniel Murungi",
      "Elvis Edward Mutebi",
      "Jenkins Mutumba",
      "Nicholas Nsubuga",
      "Ivan Ungeyigiu",
      "Lenz Vivasi",
      "Michael Wawuyo Jr."
    ],
    "Running Time": "[]",
    "Country": [
      "Uganda"
    ],
    "Language": [
      "English",
      "Swahili"
    ],
    "Time": [],
    "Location": [
      "Uganda"
    ],
    "Text": "27 Guns is an action, adventure biopic film about Yoweri Museveni and his military colleagues during the Ugandan Bush War. It was directed by Natasha Museveni Karugire and premiered in Kampala on September 8 2018 and was later screened in Johannesburg South Africa on September 19.  Plot 27 Guns tells a story of a young man and his unlikely group of young idealists who leave their lives behind to fight for salvation of a nation. They set off with little more than discipline and courage, buoyed by the indomitable spirit of an oppressed people and launched a protracted guerrilla war.  Production Shooting for 27 Guns started on August 8 2017 and went on for ninety days. The film trailer was released in May 2018. The film was shot in Mpigi/ Singo, Buikwe and Kampala with the cast and crew staff stationed at the locations for the entire shoot. Isaiah 60 Productions ran all the production and distribution of the film.  Casting The lead role of Yoweri Kaguta Museveni was given to Arnold Mubangizi as his debut role. Diana Museveni Kamuntu played her mother Janet Kataha Museni  Arnold Mubangizi  - Yoweri Kaguta Museveni Diana Museveni Kamuntu - Janet Kataha Museni Sezi Jedediah Nuwewenka - Salim Saleh Godwin Ahimbisibwe  - Akanga Byaruhanga Precious Kamwine Amanya - Joy Mirembe Daphne Ampire - Joviah Saleh Einstein Ayebare - Sam Kat abarwa T. Steve Ayeny - Julius Oketta Geofrey Bukenya - Sam Magara Patrick Kabayo - Fred Nkuranga Rubereza Diana Kahunde - Berna Karugaba Daniel Kandiho - Fred Mugisha Bint Kasede - Kizza Besigye Allan Katongole - Moses Kigongo Alvin Katungi - Chef Ali Kenny Katuramu - Pecos Kutesa Aggie Kebirungi - Dora Kutesa Aganza Kisaka - Proscovia Nalweyiso Cleopatra Koheirwe - Alice Kaboyo Timothy Magara - Andrew Lutaaya John Magyezi - Fred Rwigyema Patrick Massa - Ruhakana Rugunda Melvin Mukasa - Jim Muhwezi Daniel Murungi - Arthur Kasasira Elvis Edward Mutebi - Matayo Kyaligonza Jenkins Mutumba - Elly Tumwine Nicholas Nsubuga - Ivan Koreta Ivan Ungeyigiu - Julius Chihandae Lenz Vivasi  - Patrick Lumumba Michael Wawuyo Jr.  References External links 27 Guns on IMDb",
    "Categories": [
      "2010s action films",
      "2010s adventure films",
      "2018 films",
      "English-language films",
      "Films by Ugandan directors",
      "Films set in Uganda",
      "Films shot in Uganda",
      "Ugandan films"
    ]
  },
  "22": {
    "Title": [
      "60 Vayadu Maaniram"
    ],
    "Director": [
      "Radha Mohan"
    ],
    "Starring": [
      "Prakash Raj",
      "Vikram Prabhu",
      "Samuthirakani",
      "Indhuja"
    ],
    "Running Time": 136,
    "Country": [
      "India"
    ],
    "Language": [
      "Tamil"
    ],
    "Time": [],
    "Location": [],
    "Text": "60 Vayadu Maaniram also known as Arubathu Vayadu Maaniram (lit. 60 years old, wheatish complexion) is a 2018 Indian Tamil drama film written and directed by Radha Mohan. This movie is the remake of 2016 Kannada box office hit film Godhi Banna Sadharana Mykattu. The film stars Vikram Prabhu, Prakash Raj, Indhuja and Samuthirakani in main lead roles. This film is produced by popular producer and distributor Kalaipuli S. Thanu under his production company V Creations.The film's score and soundtrack are scored by popular music maestro Isaignani Ilaiyaraaja. The film's cinematography is handled by Manush Nandan while editing is handled by T.S.Jay. The art direction of the film is handled by K. Kathir.  Plot The film revolves around Govindarajan (Prakash Raj), a 60-year-old man who suffers from Alzheimer's disease. One day, he suddenly goes missing. His son Shiva (Vikram Prabhu), who is worried by his father's disappearance, embarks on a search with a female doctor (Indhuja). Govindarajan gets entangled with Ranga (Samuthirakani), a killer who has committed a murder. The rest of the film involves whether Shiva finds his father or not.  Cast Production Prakash Raj purchased the rights to remake the 2016 Kannada box office hit film Godhi Banna Sadharana Mykattu in Tamil, Telugu. and Hindi. The production venture of the film commenced in late 2016 which also marked the first remake film in Radha Mohan's filmography.The official trailer of the film was released on 14 August 2018 and received positive reviews from the audience.  Soundtrack The background music for the film is composed by veteran music director Ilaiyaraaja while lyrics are penned by Pa. Vijay, Palani Bharathi and Vivek.  Iraivinai Thedi - Ilayaraja Thedi Thedi - Benny Dayal, Vibhavari Naalum Naalum - Monali Thakur, Benny Dayal  Reception Times of India wrote \"The movie appeals to those who haven't watched the original version or love watching stories on beautiful bonding\". Firstpost wrote \"On the whole 60 Vayathu Maaniram is refreshingly fresh and likeable for its characters.\" Behindwoods wrote \"With interesting writing for Samuthirakani's portions and an engaging screenplay, 60 Vayadu Maaniram could have looked a lot more complete.\" India Today called it \"Average drama with overdose of emotions\". Deccan Chronicle wrote it \"is a neatly self-contained film that achieves what it set out to through delicate acting, nuanced cinematography, and serene music\".     References  ",
    "Categories": [
      "2010s Tamil-language films",
      "2018 films",
      "Album infoboxes lacking a cover",
      "All Wikipedia articles written in Indian English",
      "Articles with hAudio microformats",
      "CS1 Tamil-language sources (ta)",
      "Indian drama films",
      "Indian film remakes",
      "Indian films about Alzheimer's disease",
      "Tamil-language films",
      "Tamil films scored by Ilaiyaraaja",
      "Use Indian English from November 2018",
      "Use dmy dates from August 2018"
    ]
  },
  "23": {
    "Title": [
      "96"
    ],
    "Director": [
      "C. Prem Kumar"
    ],
    "Starring": [
      "Vijay Sethupathi",
      "Trisha Krishnan"
    ],
    "Running Time": 157,
    "Country": [
      "India"
    ],
    "Language": [
      "Tamil"
    ],
    "Time": [
      "1996"
    ],
    "Location": [
      "Chennai",
      "Kolkata"
    ],
    "Text": "96 is a 2018 Indian Tamil-language romance film written and directed by C. Prem Kumar, starring Vijay Sethupathi and Trisha Krishnan. The film, the directorial debut of Prem Kumar, was produced by S. Nanthagopal for Madras Enterprises and features a score and soundtrack composed by Govind Vasantha. Mahendiran Jayaraju and N. Shanmuga Sundaram handled the cinematography and R. Govindaraj edited the film, while the costumes were designed by Subhashree Kaarthik Vijay. The film was released on 4 October 2018 to critical acclaim, with praise for its screenplay, direction, music and the performances of the two leading actors. It will be remade in Kannada as 99.  Plot Ramachandran aka Ram (Vijay Sethupathi) is a happy-go-lucky freelance photographer. He visits his high school during a trip and is overcome by memories. A reunion is fixed through their school WhatsApp group. At the reunion, Murali, Subhashini, Sathish (Ram's school friends) catch up. Murali hesitatingly mentions that Jaanu (Ram's childhood sweetheart) is coming. Ram gets uncomfortable and walks away to be alone. The movie shift's to Ram's 10th standard days. Jaanu is a talented singer. Ram reveals since the earliest days of childhood, he and Jaanu have been together. Ram develops a love for Jaanu. On the last day after exams, Jaanu sprays ink on his white shirt and asks him not to forget her. The scene shifts to the present. Jaanu arrives to the reunion and hesitatingly searches for Ram. When Subha reveals Ram's presence, Jaanu gets emotional and walks towards him. The scene shifts back to the first day of 11th Standard. It is understood that Ram has left the school. It is revealed that Ram's father had financial difficulties and the family relocated to Chennai. Jaanu is heartbroken and keeps away from all for the next 2 years. The scene shifts to the present. Ram and Jaanu find very hard to interact with each other in the reunion. Here, it is revealed that Ram has still not married. After the reunion, both go out on a drive. Jaanu reveals that after he left school, she could not forget him. She narrates how circumstances got her married. Ram hesitatingly asks Jaanu if she does not remember the day he came to her college and tried to meet her. The scene shifts to Ram and Murali waiting in front of a ladies' college to meet Jaanu. She refuses to meet them and they return. The scene shifts to the present Jaanu is completely devastated. She dashes to her room. Ram follows her. In her room, Jaanu reveals that she never saw them the other day in college. The scene shifts back when Ram and Murali went to meet her, but shown from Jaanu's perspective. She sees her stalker and not Ram. The scene shifts to the present. Ram reveals that except the mistake of assuming that she hated him, he knew everything about her. Jaanu challenges him to reveal. Ram shoots off a rapid-fire update of events in her life as he had traced over the past years. Jaanu is absolutely shocked and amazed to hear this. Both laugh through the memories. When Ram tells Jaanu about his presence at her wedding, Jaanu is heartbroken, but comes to terms with it. She requests that they continue to talk. They step out of the hotel and catch up on memories. They enter a restaurant and meet Ram's students. They request Jaanu to share their love story. Jaanu narrates the flashback. In this sequence, it is revealed that Ram is waiting downstairs to see her. Jaanu mentions that from that point on, whatever happened was something she craved that would happen in her dreams. When she saw him downstairs, instead of asking some tough questions, she just fell into his arms. This event never happened but was improvised by Jaanu based on the original narration by Ram. The scene comes back to the present and the students leave. Ram requests Jaanu to visit his home. At his apartments, Jaanu requests Ram to marry and have a family. She expresses her wish to pamper his kids and chokes mentioning one day, she will meet his wife. She finally sings his favourite song that she had avoided singing in school (in spite of his in-numerous requests), as a way of taunting him. Ram finally shows Jaanu a collection of school memories in a suitcase (with the shirt that she had splashed with ink). When driving back to the hotel, Jaanu gets sad, knowing that she will leave Chennai very soon. She checks out of the hotel. At the airport,Ram escorts her till the boarding gate.When the boarding call is announced, Jaanu holds Ram's hand and sobs uncontrollably. She then gets into the flight. At his home, Ram sees Jaanu's clothes that he had put to dry the previous night. He folds them neatly, puts them along with his school memories, and shuts the suitcase.  Cast Production In October 2016, it was first reported that Trisha had agreed to be part of a project opposite Vijay Sethupathi that was to be directed by cinematographer C. Prem Kumar of Naduvula Konjam Pakkatha Kaanom fame. Two months later, Trisha announced the project via her Twitter and revealed the title as 96.By May 2017, Prem Kumar first talked about the film, telling that Vijay Sethupathi would play the role of a travel photographer, and that the film revolved around \"characters who belong to the same batch – 1996\", revealing the meaning of the film's title. Prem Kumar had written the entire script in 20 days in December 2015 during the Chennai floods when he was stuck in his apartment. According to Prem Kumar, the inspiration for the story came from his high school reunion. He missed the reunion but when talking to his classmates who attended the function he became fascinated about two people they were speaking about and began meeting the two and developing a story around their characters. The film's story was originally supposed to happen over a week, before the time span was changed to 24 hours, and eventually to a night.The first-look poster was released on 14 February 2017, coinciding with Valentines Day. The technical team includes cinematography by N. Shanmuga Sundaram who also did  Aandavan Kattalai, music by Govind Vasantha, edit by R. Govindaraj, art work by Vinoth Raj Kumar and lyrics by Uma Devi and Karthik Netha. The crew was then looking for suitable actors to play the younger versions of Sethupathi and Trisha's characters, which delayed the commencement of principal photography. The team eventually selected Aditya Bhaskar, son of actor M. S. Bhaskar, and Gouri Kishan for the roles, both making their acting debuts with 96. Devadharshini's daughter, Niyathi Kadambi, is playing the younger version of her role. Subhashree Kaarthik Vijay, who was recruited as the costume designer, was a close friend of Prem Kumar and created the look of the lead female character Jaanu based on herself's style.The film finally entered production on 12 June 2017 at Kumbakonam.  Soundtrack The score and soundtrack were composed by violinist-turned-composer Govind Vasantha. 96 was just the third Tamil film he had worked on as a composer and the second to get released, because of the delay of his maiden project Oru Pakka Kathai. The album, featuring eight tracks, was released on 24 August 2018. The lyrics were written by Karthik Netha and Uma Devi. The song \"Kaathalae Kaathalae\", which was featured in the first 1-minute teaser, was a slower, \"ambience version\" of a part of the \"Anthaathi\" song that Goving had produced because \"he was in the mood\" but was not meant to be included in the film or the soundtrack album. When the teaser song went viral, Govind Vasantha worked on it and made a 3-minute song that went on to be featured in the album as well as in the film. Chinmayi sang all the female portions in the songs since she also dubbed for the lead female character Jaanu, while Gouri TP, who spoke dubbing for younger Jaanu, sang the song \"Yean\" which features younger Jaanu on screen. A poetry written by Prem Kumar was added by Govind Vasantha to the end of \"Anthaathi\", which was recited by actor Nassar although he did not act in the film. \"Anthaathi\", considered the \"central piece of the 96 album\", was composed for promotional purposes and not used in the film.A reviewer from The Indian Express wrote, \"Govind Vasantha creates a soundtrack that leaves me bereft of adjectives to describe how beautiful it is. Govind gives us an eclectic yet symbiotic soundscape, a soundtrack that brims with emotion that touches your soul. There’s love, heartbreak, melancholy, questions, silence and of course love\". Surendhar MK of Firstpost wrote, \"at a time when Tamil music scene continues to be dominated by EDM-laden pieces and heavily auto-tuned vocals, the OST of 96 comes as a breath of fresh air that touches the soul and mind quite effortlessly with Govind Vasantha's rejuvenating compositions. It would definitely not be an overstatement to call 96 the best Tamil soundtrack of 2018\". Sharanya CR of The Times of India wrote, \"Govind Vasantha gives us one of the best albums of this year and sets a benchmark for romance in Kollywood\". musicaloud.com wrote, \"Govind Vasantha (formerly Menon) finally gets his well-deserved big break in Tamil, and knocks it right out of the park!\", giving it a score of 4.5 out of 5. Karthik from milliblog.com called it \"easily the best Tamil soundtrack of the year (yet)\". as did Siddharth K. from Sify who also called it \"one unique musical experience\". In contrast, Archana Nathan of scroll.in wrote that \"barring a few instances of brilliance, the rest of the soundtrack does not leave much of an impression\".  Marketing and release The first look of the film was released on 22 December 2016 by actress Trisha Krishnan herself on Twitter. Shortly after the launch of the film, Sun TV bought its broadcasting rights. The first-look poster was unveiled on 14 February 2017, coinciding with Valentines Day. A 1-minute teaser was released in July 2018 and the trailer of the film was launched on 24 August 2018.96 had a press screening for critics on 1 October 2018, while the theatrical release took place on 4 October. A month after its release and the successful run, Sun TV had a television premiere during Diwali celebration. This has caused the public, including actress Trisha and director Premkumar requesting the channel to postpone the telecast. Despite that, the channel went ahead with the premiere.  Reception Critical response Anupama Subramaniam of Deccan Chronicle, who gave the film 3.5 stars out of 5, was in high praise of director Prem Kumar as she wrote that he had \"not made a film, but woven pure and impeccable poetry on celluloid\", going on to add that \"Prem's honest attempt of portraying the true essence of love without taking any cinematic liberties makes 96 the kind of genre-defining film that creates a benchmark for many years to come\", while hailing Trisha's performance as her \"best-ever...till date\". IANS gave it a rare 5 stars out of 5 and said, \"as we get to the climax and we get one of the most heartwarming moments of the film, it makes 96 a highly satisfying story of unfulfilled romance\". Behindwoods called 96 a \"breezy and heartwarming romantic tale that Tamil cinema audience shouldn't miss\". Sify named it \"one of the best films in a long time\", while giving it a 4 rating out of 5. Janani K. of India Today gave it 4 stars out of 5 and called it a \"poignant romantic tale\" and a \"tribute to unconditional love\". Mythily Ramachandran of Gulf News called the film \"a classic love story that will be fondly remembered\".Sreedhar Pillai of Firstpost called the film a \"refreshingly fresh romantic trip down the memory lane with outstanding performances by its charming lead pair\". M. Suganth of The Times of India gave it 3.5 stars out of 5 and said that \"there is a lot to fall in love with 96, a wistful romantic film about a past romance...But what sets Prem Kumar's film apart from the others is that it gives equal importance to the romance of its female lead\". Vikram Venkatesen of The Quint wrote \"‘96 has very well changed Tamil romance for good, thanks to its high dependence on music and realism in conveying nostalgia\". Priyanka Thirumurthy of The News Minute wrote, \"the film’s screenplay is gripping. It has you on the edge of your seat for what are seemingly the most inane activities – school attendance, conversations over coffee and even a ride in the metro\". Sudhir Srinivasan of The New Indian Express felt that 96 was a \"fascinating film, a fascinating idea...an idea, I loved a bit too much, not to care about the[se] missteps. It needed to be a bit more bitingly real\" but concluded that \"yet, 96, no doubt, works\". Baradwaj Rangan wrote, \"The only problem is the slump in the second half...But the premise is so affecting, it keeps us invested\" and concluded, \"I walked out of the film satisfied that whatever Ram and Janaki decide to make of their future, his ink-splattered shirt from school and the dupatta of her uniform will live together, happily ever after\".96 was frequently named one of the best films of 2018 and listed on many top ten lists.  Accolades Plagiarism controversies In late October 2018, a month after 96's release, Suresh, an assistant director of Bharathiraja, alleged that he had written a script called 92 and that 96 was based on his own script. Few days later Prem Kumar hosted a press conference and said that he had registered his script in 2016 and also added that he had written a spin-off novel of what happens to the lead character afterwards. The film was also reported to have \"uncanny similarities\" with the 2016 film Blue Jay, with Prem Kumar admitting to it, although he added that he had already registered his film before Blue Jay released.  Legacy Bengaluru-based Tamil writer C. Saravanakarthikeyan wrote a book based on the film titled 96 – Thanipperum Kadhal, which was released by Prem Kumar by late December 2018. Inspired by the film, Gulbonda, a Calicut-based art studio created dolls based on the film's two main characters, Ram and Jaanu, which became sought-after by fans and saved the then newly launched startup company. The yellow kurta outfit worn by Trisha's character Jaanu became popular after the film's release and was sold by a textile store in Chennai.  Remakes 96 is planned to be remade in Kannada as 99 by Preetham Gubbi with Ganesh and Bhavana set to play the lead pair, while Dil Raju has bought the Telugu remake rights.  References External links 96 on IMDb",
    "Categories": [
      "2010s Tamil-language films",
      "2010s romantic comedy films",
      "2010s romantic drama films",
      "2018 films",
      "Album infoboxes lacking a cover",
      "Articles with hAudio microformats",
      "Films scored by Govind Menon",
      "Films set in 1996",
      "Films set in Chennai",
      "Films set in Kolkata",
      "Films set in schools",
      "Films shot in Chennai",
      "Films shot in Kolkata",
      "Indian drama films",
      "Indian films",
      "Indian nonlinear narrative films",
      "Indian romance films",
      "Tamil-language films",
      "Tamil films remade in other languages",
      "Track listings with input errors",
      "Use dmy dates from May 2018"
    ]
  },
  "24": {
    "Title": [
      "102 Not Out"
    ],
    "Director": [
      "Umesh Shukla"
    ],
    "Starring": [
      "Amitabh Bachchan",
      "Rishi Kapoor",
      "Jimit Trivedi"
    ],
    "Running Time": 102,
    "Country": [
      "India"
    ],
    "Language": [
      "Hindi"
    ],
    "Time": [],
    "Location": [],
    "Text": "102 Not Out is a 2018 Hindi-language Indian comedy-drama film directed by Umesh Shukla and starring Amitabh Bachchan and Rishi Kapoor in the lead roles. The film is based on the eponymous Gujarati play written by Saumya Joshi. 102 Not Out was released on 4 May 2018.  Plot Dattatraya Vakharia (Amitabh Bachchan) is a 102-year-old who enjoys life in jovial ways. Babulal Vakharia (Rishi Kapoor), his 76-year-old son, is the opposite, and believes that he is now too old to enjoy life, and detests how his father acts. Dhiru (Jimit Trivedi) is a employee at a medical shop who delivers medicine to the Vakharias. Dhiru likes Dattatraya for his attitude and is scared of Babulal because of his grumpy nature. Dattatraya seeks to break the record of the oldest living person. and thus he seeks to avoid negative people. Therefore, he threatens to send his son to a elderly care facility unless he achieves certain conditions. While Babulal is hesitant, he accepts with Dhiru as a witness. Firstly, Babulal writes a love letter to his deceased wife. Next, he accuses his doctor of being a thief so that he stops going to the clinic daily for a checkup. While rejecting to cut holes in his childhood blanket, Babulal visits a playground and a church that remind him of childhood memories. He becomes sorrowed and distributes cake to young children in the streets with his father. Babulal begins to appreciate his father's outlook on life. However, Babulal receives a call from his estranged son Amol informing Babulal that he will visit India. While Babulal is ecstatic hearing the news, Dattatraya is certain that Amol's motive is to claim their property as their heir. So he gives Babu his last task: to kick Amol out of the house for all his negligence towards his family. They arguet and Babulal stops talking to Dattatraya. Even Dhiru, for the first time, supports Babulal and feels that Amol should be given a chance. Dattatraya reveals that Babu had spent all his savings to educate Amol and send him to the United States. However, Amol ignored them, telling nothing about his new family life in America. Dattatraya also tells his son he has cancer, living happily so that Babulal can live like him. Days later, Amol arrives in India, where Babulal humiliates him in public, calling him to return home. After later celebrating with Dattatraya and Dhiru, Dattatraya passes away at 102 years of age. Babulal finds a recording of his father predicting that the record of the oldest man will be broken by Babulal himself.  Cast Amitabh Bachchan as Dattatraya Vakharia Rishi Kapoor as Babulal Vakharia, Dattatraya's son Jimit Trivedi as Dhiru Dharmendra Gohil as Amol Vakharia, Babulal's son Vijay Raaz as The Narrator  Soundtrack The music of the film has been composed by Salim-Sulaiman, Amitabh Bachchan and Rohan-Vinayak while the lyrics were written by Hiral Brahmbhatt, Saumya Joshi, Amitabh Bhattacharya and Kaifi Azmi. The songs featured in the film are sung by Arijit Singh, Armaan Malik, Sonu Nigam, Amitabh Bachchan, Rishi Kapoor  and Hiral Brahmabhatt. George Joseph has composed the background music for this film. The first song of the film, Bachche Ki Jaan which is sung by Singh was released on 10 April 2018. The second song of the film, Badumbaaa which is sung by Bachchan and Kapoor was released on 18 April 2018. The music album was released on 30 April 2018 by Saregama Music. Vipin Nair of The Hindu gave the soundtrack 3.5/5 stating that Salim-Sulaiman delivered \"their best work in a very long time\".  Box office In India, the film earned ₹52.05 crore nett and ₹66.72 crore gross. In China, the film grossed $4.5 million (₹29.22 crore) as of 9 December 2018, including $3.25 million (₹22.67 crore) during its opening weekend there. In other territories, the film grossed ₹19.33 crore ($3 million) as of 3 December 2018. Combined, the film grossed ₹115.3 crore ($18 million) worldwide as of 9 December 2018.  Critical reception On review aggregator website Rotten Tomatoes 102 Not Out has an approval score of 67% on the basis of 9 reviews with an average rating of 6.3 out of 10. Rajeev Masand of News18 gave the film a rating of 3 out of 5 saying that, \"Despite its many shortcomings 102 Not Out has its heart in the right place, and a pair of actors clearly enjoying themselves on screen. Their infectious energy alone makes this film worth a watch.\" Rachit Gupta of The Times of India gave the film a rating of 3.5 out of 5 saying that, \"The unique and refreshing concept of ‘102 Not Out’ is its strength. It’s just a happy and healthy entertainer that tells you that living in the moment and making the most of everyday of your life is all that matters.\" Shalini Langer of The Indian Express gave the film a rating of 2 out of 5 saying that, \"No doubt it's great to see a film about two old people. But we have seen both Amitabh Bachchan and Rishi Kapoor in that avatar in better films (Piku especially, and in Kapoor & Sons) before this.\" Rohit Vats of Hindustan Times gave the film a rating of 3 out of 5 and said that, \"102 Not Out’s heart is firmly in the right place. The film knows its territory and the emotions it wants to evoke. It’s just that a few important characters don’t get enough play and they are sacrificed to make space to Amitabh Bachchan and Rishi Kapoor.\" Raja Sen of NDTV gave the film a rating of 2 out of 5 saying that, \"Shukla's film is a sweet but dull enterprise, one that never quite rises above its ultimate ambition: that of having two legendary actors play off each other.\"Rohit Bhatnagar of Deccan Chronicle gave the film a rating of 3.5 out of 5 saying that, \"The Amitabh Bachchan and Rishi Kapoor starrer film is a heart warming experience of celebrating life as it comes.\" Namrata Joshi of The Hindu reviewed the film saying that, \"Umesh Shukla’s film is unable to leave its inherent theatricality behind. It gets unchanging in terms of the give and take between the duo and leaves the viewers static too. It stirs nothing within, leaving you unmoved.\" Meena Iyer of DNA India gave the film a rating of 3.5 out of 5 saying that, \"This is a small, sweet film with its heart in the right place.\" Anupama Chopra of Film Companion gave the film a rating of 3 out of 5 saying that, \"102 Not Out is uneven but heartfelt. Despite the flaws, the emotions connect.\" Sonil Dedhia of Mid-Day gave the film a rating of 3 out of 5 saying that, \"Bachchan and Kapoor's effortless performances, coupled with their intoxicating screen presence make this movie worth watching.\"  References External links  102 Not Out on IMDb  102 Not Out at Bollywood Hungama",
    "Categories": [
      "2010s Hindi-language films",
      "2018 films",
      "Album infoboxes lacking a cover",
      "All Wikipedia articles written in Indian English",
      "Articles with hAudio microformats",
      "Hindi-language films",
      "Indian comedy-drama films",
      "Indian films",
      "Indian films based on plays",
      "Pages with incorrect use of Rating template",
      "Use Indian English from December 2015",
      "Use dmy dates from December 2015"
    ]
  },
  "25": {
    "Title": [
      "211"
    ],
    "Director": [
      "York Shackleton"
    ],
    "Starring": [
      "Nicolas Cage",
      "Cory Hardrict",
      "Michael Rainey Jr.",
      "Ori Pfeffer",
      "Weston Cage"
    ],
    "Running Time": 86,
    "Country": [
      "United States"
    ],
    "Language": [
      "English"
    ],
    "Time": [],
    "Location": [],
    "Text": "211 is a 2018 American action film directed by York Shackleton and written by York Shackleton and John Rebus. The film stars Nicolas Cage, Cory Hardrict, Michael Rainey Jr., Ori Pfeffer and Weston Cage. Filming began on February 27, 2018 and ends on April 27, 2018. The film was released on June 8, 2018, by Momentum Pictures. It is based on the 1997 North Hollywood shootout.211 refers to the Hundred Code for Robbery used in California, although the story is set in the fictional city of Chesterford, Massachusetts.  Plot Afghanistan Disgruntled mercenaries corner the boss who owes them money. Under torture, he discloses it has been wired to various banks including one in Chesterford. In a Kabul market, Interpol's Agent Rossi's operation to catch an antiquities smuggler is interrupted and she is redirected to the crime scene caused by the mercenaries. United States of America In Chesterford, Kenny Ralston, a quiet high school student, has an altercation with bullies. Agent Rossi challenges a gun store manager for information on the mercenaries and receives a warehouse address. The school vice-principal tells Shawnee Ralston, Kenny's mother, that he must go on a police ride-along or face expulsion. Patrolman Mike Chandler has lost his wife of thirty years to cancer. His difficulty in expressing his emotions has strained his relationship with his daughter, Lisa. Mike’s patrol partner and son-in-law, Steve, reveals that Lisa is pregnant. At the bank, an armoured cash transport delivers over $1.3million. Tre, Rob and Luke finalise their heist plan, while Hyde plants a cell-phone IED in a restaurant. Mike and Steve arrive at work. Kenny signs forms regarding the ride-along. Responding to a call from headquarters, Steve and Mike draw their weapons on a suspect and Kenny records it using his smartphone. The crew storm the bank and threaten everyone. Near the bank, Steve goes for coffee while Mike and Kenny discuss the school altercation. Gaining insight, Mike changes his mind regarding Kenny, admitting he would have acted similarly. On Steve’s return, Mike indicates a black Escalade parked in the red zone outside the bank. They cross a parking lot to investigate further and inside the bank, Tre orders Hyde to ‘make the call’. The IED destroys the restaurant. Police headquarters alerts all patrols to the explosion. Mike chooses to remain because of Kenny and the less-dangerous ‘parking violation’. Hyde becomes agitated. The other patrols converge on the restaurant and news reaches the hospital where Shawnee prepares to receive multiple casualties. Hearing the news, Rossi diverts to Chesterford. First responders arrive and SWAT Captain, Horst, issues orders. Hyde opens fire on the cruiser. As Mike takes evasive action, Steve alerts headquarters they are taking fire. Some officers leave the restaurant area to provide backup to Mike and Steve. Mike crashes the cruiser and gets out, returning fire. Initially trapped, Steve manages to free himself and then Kenny. Kenny grabs his phone as he exits the cruiser and Mike eventually kills Hyde. Realising Steve is seriously injured, Mike fabricates a tourniquet. Rossi arrives at the restaurant area and Hyde is identified. The back-up team attempt to evacuate Steve and Mike retrieves a first aid kit. Inside the bank, Luke uses a 50-cal rifle to shoot Mike but misses. Two other officers are killed. Lisa learns of the restaurant explosion and gets Steve’s voicemail. Steve gets Kenny to record a farewell message on his phone. The back-up team reach their colleagues. Moving Steve, they become separated from Kenny who hides in a parked Blazer. His phone dead, Kenny looks for another battery and hacks a charger. An EMT assesses Steve, Hanson returns with a seriously-wounded Jacobs and Mike notices Kenny is missing. Starting a search with Hanson, Mike receives a call from Lisa and prepares her for bad news. Lisa arrives at the ER and questions the now barely-conscious Jacobs who says Mike is still on scene looking for the 'ride-along kid'. Shawnee, in earshot of Jacobs, reacts just as Kenny telephones to let her know he is safe, for now. Rossi arrives in the command post to witness Mike shouting that his dead son has ‘a child on the way’. Horst finalizes the breach. Mike and Hanson head for the parking lot to locate and rescue Kenny. SWAT advances. Tre orders the hostages out. Now safe, a hostage reveals something in her pocket. Horst, identifying another IED, dies selflessly protecting the hostages. SWAT begin their breach but are repelled. Rob exits first, firing to cover his escape but gets killed. Luke is killed at the bank door. Tre approaches Mike firing wildly. Hanson is killed. Mike is wounded and as Tre raises his weapon to kill Mike, Kenny uses Hanson’s side arm to shoot Tre. Rossi appears and shoots Tre. As Mike and Kenny sit in an ambulance, Shawnee arrives and hugs her son. Lisa arrives and embraces her father. One year later, Mike arrives home after a run. He is greeted with shouts of Happy Birthday. Among his well wishers are Jacobs, Steve, and Mike’s granddaughter. Stepping towards his visitors, Mike asks Kenny to ‘take some new pics’.  Cast Production On January 27, 2017, Nicolas Cage joined the cast of the film. Filming took place at Nu Boyana studios in Sofia, Bulgaria.  Release The film was released on June 8, 2018, by Momentum Pictures.  Reception Critical response The film review aggregator website Rotten Tomatoes rates it 5% positive based on 17 reviews with an overall rating of 2.5/10. Metacritic reports an aggregate score of 21 out of 100 (based on 8 critics), indicating \"generally unfavorable reviews\".Luke Y. Thompson of Forbes gave it a fresh rating, writing “I can’t begrudge you waiting until 211 shows up on a Blu-ray at Walmart that also contains ten other Cage movies...But I can tell you that when it does, you shouldn't skip over this one.”Other reviewers were not as complimentary. Jacob Knight from Birth Movies Death declared it rotten, writing, “Nic Cage’s latest DTV action endeavour is a bizarre slog.” Richard Roeper of the Chicago Sun-Times gave it 2/4 and wrote, \"A muddled, overcrowded, trigger-happy heist movie brimming with clichés while constantly trying our patience.\" Glenn Kenny of RogerEbert.com gave it 1/4, describing it as \"This effort is a cavalcade of crap. Loud crap.\" Frank Scheck of The Hollywood Reporter wrote, \"It's probably foolish to wish that Nicolas Cage would once again make movies as good as Adaptation and Leaving Las Vegas. But is it too much to ask that he go back to the comparative glory days of Con Air and The Rock?\". Dennis Harvey of Variety wrote, \"Unsurprisingly, the director doesn't get very good work from a cast asked primarily to ramp up the intensity on stereotypes.\"  References External links 211 on IMDb",
    "Categories": [
      "2010s action films",
      "2018 films",
      "American action films",
      "American films",
      "English-language films"
    ]
  },
  "26": {
    "Title": [
      "212 Warrior"
    ],
    "Director": [
      "Angga Dwimas Sasongko"
    ],
    "Starring": [
      "Vino G. Bastian",
      "Sherina Munaf",
      "Marsha Timothy",
      "Fariz Alfarizi",
      "Happy Salma",
      "Dwi Sasono",
      "Yayan Ruhian",
      "Cecep Arif Rahman"
    ],
    "Running Time": "[]",
    "Country": [
      "Indonesia"
    ],
    "Language": [
      "Indonesian"
    ],
    "Time": [],
    "Location": [],
    "Text": "212 Warrior (also known as Wiro Sableng 212 and Wiro Sableng Pendekar Kapak Maut Naga Geni 212) is a 2018 Indonesian action-comedy film based on the Wiro Sableng novel series by Bastian Tito. The movie is the first collaboration between an Indonesian studio with Fox International Production.A teaser for the film was released on 21 December 2017 throughout Indonesian theaters. It was uploaded online on a week later. The first trailer was released on 12 May 2018 and debuted on the LINE communications app. The film was released on 30 August 2018.  Premise In the 16th century of Nusantara, Wiro Sableng (Vino G. Bastian) is tasked by his mentor Sinto Gendeng (Ruth Marini) to capture her treacherous former student, Mahesa Birawa (Yayan Ruhian). Joined by his friends, Anggini (Sherina Munaf) & Bujang Gila Tapak Sakti (Fariz Alfarizi), Wiro will not only discover Mahesa's evil intention, but also discovering his true calling as a hero.  Cast Vino G. Bastian as Wiro Sableng Sherina Munaf as Anggini Marsha Timothy as Bidadari Angin Timur Fariz Alfarizi as Bujang Gila Tapak Sakti Happy Salma as Suci Dwi Sasono as Raja Kamandaka Yayan Ruhian as Mahesa Birawa Cecep Arif Rahman as Bajak Laut Bagaspati Lukman Sardi as Werku Alit Ruth Marini as Sinto Gendeng T. Rifnu Wikana as Kalasrenggi  References External links 212 Warrior on IMDb",
    "Categories": [
      "2018 films",
      "Action comedy films",
      "All stub articles",
      "CS1 Indonesian-language sources (id)",
      "Films based on Indonesian novels",
      "Indonesian-language films",
      "Indonesian action films",
      "Indonesian comedy films",
      "Indonesian film stubs",
      "Indonesian films"
    ]
  },
  "27": {
    "Title": [
      "1921"
    ],
    "Director": [
      "Vikram Bhatt"
    ],
    "Starring": [
      "Zareen Khan",
      "Karan Kundra",
      "Vikram Bhatt"
    ],
    "Running Time": 144,
    "Country": [
      "India"
    ],
    "Language": [
      "Hindi"
    ],
    "Time": [
      "1921",
      "1927"
    ],
    "Location": [
      "England",
      "Mumbai",
      "York",
      "the British Raj"
    ],
    "Text": "1921 is a 2018 Indian horror film, produced and directed by Vikram Bhatt, under his LoneRanger Productions banner. It stars Zareen Khan and Karan Kundra in lead roles and was released on 12 January 2018. It is the first installment in the 1921 (film series) and also a spin-off from the 1920 film series. The film was declared \"Average\".  Plot The film starts in England in 1927 with a crowd of audience waiting for a performance to begin. The host apologizes for the delay and goes backstage and furiously tells a lady called Nafisa to call Ayush (Karan Kundra), who has locked himself in a room. They break the door down to see Ayush has slit his wrist.  Then the film goes in flashback  when he was in Bombay. A wealthy man Mr. Wadia (Vikram Bhatt) discovers Ayush's incredible talents and asks him to take care of his mansion Wadia Manor in York in return of which he would pay for Ayush's educational expenses. Ayush is overjoyed to hear this and heads towards his journey to the mansion. Ayush is warmly received by the both the housekeeper and the caretaker of the house. Ayush is even more delighted to enter the York College of Music.  Three months later Ayush is doing some paperwork when he is hit with an onslaught of paranormal activities. Closed doors open by themselves, lights start flickering. Ayush sees a white light beckoning him to come closer but he is always stopped by a women's scream. He encounters a message written with dried blood in a room. He enlist help of Rose (Zareen Khan) a fellow student at the college who has a second sight. As both investigate they realize the secrets that they both have kept individually about events of the preceding three months have more consequences and they both might have a deeper connection with the current hauntings than they can imagine. Ayush informs her that he can hear voices of a machine, And he can see a white light calling to him but as soon as he goes near he hears a scream of a woman which prevents him from touching the light.  He narrates what happened three months ago when he arrived at the mansion. He allowed the villagers to enter the mansion and listen his music for some money. One day his actions were discovered by Meher Wadia (Mr Wadia's niece) and she blackmailed him into giving her a performance or she'll get him fired. That night during the performance she gave Ayush a poison and tried to dump him in the city so he could die a slow death. But Ayush hit her making her unconscious .while coming back to the manor ,on the way  he sees a supernatural being and loses his control over the car resulting in a car accident where Meher dies.  To his surprise nobody confronted him on Meher's death. Sometime later these paranormal events began. Rose conducts an investigation according to Ayush's story. She comes to know Meher Wadia never visited York. During their investigation Ayush and Rose fall in love. Some time later Rose reaches a hospital in which she discovers the Meher Wadia that visited Ayush was their classmate Dina who is dead from 3 months. When she sees her date of death she is horrified. She confesses to Ayush that all the bad things are happening to Ayush due to her.  She narrates how her and Nafisa's roommate Vasudha was in love with a married man named Richard but he wasn't ready to divorce his wife. One day she happily informed her friends Richard was going to marry her as Richard's wife left him. But Rose was visited by Richard 's wife's spirit and she discovers Vasudha murdered her. She informs Richard of this which is also discovered by Vasudha and she commits suicide. They try to save her and admit her into hospital but she dies eventually and her spirit gets hold of Dina's body who was admitted in the same hospital. She has been torturing Ayush since she knows Rose loves him. Now they're convinced they have to get rid of Vasudha's spirit and they decided to visit a church. Vasudha attacks Nafisa which prompts Rose to take her to a hospital where makes another horrific discovery, Ayush is admitted into same hospital and is in coma from the night Meher Wadia attacked him. Rose informs Nafisa that she has been communicating with Ayush's spirit all along. She explains when body is in deep sleep it's spirit wanders off but they're connected through a rope in form of a white light. Eventually the spirit can enter back in the body by touching it. Ayush's spirit also has tried to enter it's body but Vasudha has prevented it from happening all along. The next day Ayush's body was going to be removed from life support which will result in his death. Rose takes a hair of Ayush to make it touch Ayush's spirit but as she is about to leave the hospital Vasudha's ghost takes control of Ayush's body and threatens Rose she will destroy Ayush's body if she leaves. Vasudha in full control of Ayush's body tortures Rose by hurting him. Rose informs Vasudha that she knew she won't be able to leave and she kills herself. Her spirit arrives and reveals she already sent Ayush's hair and a letter to Ayush through Nafisa. Rose fights and destroys Vasudha's spirit. On the same time Ayush's spirit enters his body and he's saved.  Film goes back to where it started. Ayush in a death like state meets Rose and tells he wants to be with her. Rose tells him he has to live and spread his music for her. She asks it as a return for her sacrifice. Ayush eventually recovers and becomes a renowned pianist & musician.  Cast Zareen Khan as Rose Karan Kundra as Ayush Nidhi Chitrakar as Nafisa Aradhya Taing as Vasudha Angela Krislinzki as Tina / Meher Wadia Toby Hinson as Mr Brett Sonnia Armstrong as Lilly Lopez Michael Edwards as Richard Vikram Bhatt as Mr. Wadia  Production Development The official announcement of the film was announced in June 2016. The title of the film was said to be 1921.  Casting The makers of the film have decided to cast Zarine Khan as the lead role in the film.  Filming The principal photography of the film commenced in May 2017 in United Kingdom.  Soundtrack The music of 1921 is composed by Harish Sagane, Asad Khan and Pranit Mawale while the lyrics have been penned by Shakeel Azmi and Raqueeb Alam. The first track of the film titled as \"Sunn Le Zara\" which is sung by Arnab Dutta was released on 14 December 2017. The second single to be released was \"Kuch Iss Tarah\" which is also sung by Arnab Dutta was released on 21 December 2017. The music of the film was officially released by Zee Music Company on 22 December 2017.  Critical reception 1921 received mostly negative reviews from critics upon its theatrical release. Devesh Sharma of Filmfare gave the movie 2 out of 5 stars and wrote, \"Vikram Bhatt has made an unintentionally funny film. He perhaps needs to go back to the drawing board before he takes up horror as a subject once more\".Reza Noorani of Times of India gave the movie 2 out of 5 stars calling it \"a slow-moving film without any real chills\".Shikta Sanyal of Koimoi gave the movie 2 out of 5 stars stating, \"This Vikram Bhatt Film Is A Mixed Bag With Too Many Loose Ends\".\" Udita Jhunjhunwala of Firstpost gave the movie 1.5 out of 5 stars stating, \"Vikram Bhatt adds every horror trope to this ghastly film, but none of them work\".Urvi Parikh of Rediff.com gave the movie 1.5 out of 5 stars stating, \"The terrible acting leaves you more amused than scared\".Rahul Desai of Film Companion gave the movie 1 out of 5 stars saying that it uses the same old tropes of haunted mansions and incoherent ghosts with deafening sound effects.  References External links 1921 on IMDb",
    "Categories": [
      "2010s Hindi-language films",
      "2018 films",
      "2018 horror films",
      "Album infoboxes lacking a cover",
      "All Wikipedia articles written in Indian English",
      "Articles with hAudio microformats",
      "Films set in 1921",
      "Films set in 1927",
      "Films set in England",
      "Films set in Mumbai",
      "Films set in York",
      "Films set in the British Raj",
      "Hindi-language films",
      "Indian films",
      "Indian horror films",
      "Indian thriller films",
      "Use Indian English from June 2016",
      "Use dmy dates from June 2016"
    ]
  },
  "28": {
    "Title": [
      "1985"
    ],
    "Director": [
      "Yen Tan"
    ],
    "Starring": [
      "Cory Michael Smith",
      "Virginia Madsen",
      "Michael Chiklis",
      "Aidan Langford",
      "Jamie Chung"
    ],
    "Running Time": 85,
    "Country": [
      "United States"
    ],
    "Language": [
      "English"
    ],
    "Time": [
      "1985"
    ],
    "Location": [
      "Texas"
    ],
    "Text": "1985 is an American drama film, directed by Yen Tan and released in 2018. The film is an expansion of an earlier short film of the same name that Tan released in 2016.  Plot Set in Texas in 1985, the film stars Cory Michael Smith as Adrian Lester, a closeted gay man returning home after several years living in New York City to tell his family that he is dying of AIDS. The cast also includes Michael Chiklis and Virginia Madsen as Adrian's parents, Aidan Langford as his younger brother Andrew, and Jamie Chung as his childhood friend Carly.  Release The film premiered in March 2018 at SXSW. It subsequently screened at a number of LGBT and general interest film festivals, including as the opening gala at the 2018 Vancouver Queer Film Festival. The movie’s DVD and digital release was in December 2018. It also was released in the United Kingdom by Peccadillo Pictures, and is planned to be released in Australia, New Zealand and Germany.  Reception 1985 was given multiple prizes like the Grand Jury Prize at the SXSW Texas Competition, the Festival Best Feature at Fire!! Barcelona LGBT Film, the Audience Award and the Student Jury Prize at the Champs-Élysées Film Festival in Paris, the Grand Jury Award and the Best Screenwriting award at the Outfest Los Angeles LGBTQ Film Festival and the awards of: Best Feature Film, Best Writer for Yen Tan, Best Actor for Cory Michael Smith, Best Supporting Actor for Michael Chiklis, Best Supporting Actress for Jamie Chung at the Queen Palm International Film Festival.  References External links 1985 on IMDb",
    "Categories": [
      "2010s LGBT-related films",
      "2010s drama films",
      "2018 films",
      "All stub articles",
      "American LGBT-related films",
      "American drama films",
      "American films",
      "English-language films",
      "Films directed by Yen Tan",
      "Films set in 1985",
      "Films set in Texas",
      "Gay-related films",
      "HIV/AIDS in film",
      "LGBT-related drama film stubs",
      "LGBT-related drama films",
      "Pages using infobox film with unknown parameters",
      "Use dmy dates from August 2018"
    ]
  },
  "29": {
    "Title": [
      "1991"
    ],
    "Director": [
      "Ricardo Trogi"
    ],
    "Starring": [
      "Jean-Carl Boucher",
      "Sandrine Bisson",
      "Juliette Gosselin"
    ],
    "Running Time": 101,
    "Country": [
      "Canada"
    ],
    "Language": [
      "French"
    ],
    "Time": [],
    "Location": [
      "Italy"
    ],
    "Text": "1991 is a Canadian comedy-drama film, directed by Ricardo Trogi and released in 2018. The third film in his semi-autobiographical series after 1981 and 1987, the film centres on Ricardo's (Jean-Carl Boucher) trip to Italy to pursue a relationship with Marie-Ève (Juliette Gosselin).The film finished 2018 as the year's top-grossing Canadian film.  References External links 1991 on IMDb",
    "Categories": [
      "2010s Canadian film stubs",
      "2010s comedy-drama films",
      "2018 films",
      "All stub articles",
      "Canadian comedy-drama films",
      "Canadian films",
      "Films directed by Ricardo Trogi",
      "Films set in Italy",
      "French-language films"
    ]
  },
  "30": {
    "Title": [
      "Varanasi"
    ],
    "Director": [
      "Aryaman Keshu"
    ],
    "Starring": [
      "[]"
    ],
    "Running Time": "[]",
    "Country": [
      "India"
    ],
    "Language": [
      "Hindi"
    ],
    "Time": [],
    "Location": [
      "Mumbai"
    ],
    "Text": "Varanasi is an upcoming Indian thriller Bollywood film, written and directed by Aryaman Keshu.Raima Sen will be seen playing some role in the film.  Plot The film is partially inspired from the terror attacks that shook the holy city of Varanasi in 2006.  Cast Raima Sen Om Puri Ravi Kishan Rahul Dev Ankit Vyas  Production Development The official announcement of the film was announced in the second half of September 2016. The title of the film was said to be Varanasi.  Casting The makers of the film have decided to cast Raima Sen, along with Om Puri, Ravi Kishan and Rahul Dev in the film.  Filming The principal photography of the film will commence sometime in October 2016.  Soundtrack Release     References  ",
    "Categories": [
      "2010s Hindi-language film stubs",
      "2010s Hindi-language films",
      "2010s thriller film stubs",
      "2018 films",
      "All Wikipedia articles written in Indian English",
      "All articles to be expanded",
      "All articles with empty sections",
      "All stub articles",
      "Articles to be expanded from January 2019",
      "Articles using small message boxes",
      "Articles with empty sections from January 2019",
      "Films set in Mumbai",
      "Hindi-language films",
      "Indian films",
      "Indian thriller films",
      "Use Indian English from September 2016",
      "Use dmy dates from September 2016"
    ]
  },
  "31": {
    "Title": [
      "2036 Origin Unknown"
    ],
    "Director": [
      "Hasraf Dulull"
    ],
    "Starring": [
      "Katee Sackhoff",
      "Julie Cox",
      "Steven Cree (voice only)"
    ],
    "Running Time": 94,
    "Country": [
      "United Kingdom"
    ],
    "Language": [
      "English"
    ],
    "Time": [
      "2036"
    ],
    "Location": [],
    "Text": "2036 Origin Unknown is a 2018 British science fiction adventure film directed by Hasraf Dulull, written by Dulull (story) and Gary Hall, and starring Katee Sackhoff and Steven Cree. The film follows astronaut Mackenzie Wilson (Sackhoff) and ARTI, an artificial intelligence system (voiced by Cree), as they discover a mysterious object on Mars and witness it transporting to Earth by faster-than-light travel.  Plot In 2030, a manned mission to Mars goes awry when a manned shuttle disappears under mysterious circumstances. Six years later, United Space Planetary Corporation mission controller Mackenzie Wilson finds herself subordinate to ARTI, an artificial intelligence system, as she lands a rover on Mars, nicknamed \"Little Red.\" While she is distrustful of ARTI, Wilson's sister and supervisor, Lena, insists that the AI will succeed where human controllers failed.  After a nearly disastrous landing saved by Wilson's quick thinking, Little Red encounters a mysterious cube and attempts to ascertain its origin, discovering the cube is made of a self-assembling material as hard as diamonds. Meanwhile in orbit, ARTI shoots down a foreign satellite. The cube teleports to Antartica, and is thought to be alien in origin. Little Red, obtaining data from an older decommissioned rover on Mars, uncovers classified information Wilson can't access, prompting her to bring colleague Sterling Brooks for access. It reveals the cube may have been present the day of the shuttle disaster, and Wilson becomes suspicious that ARTI's memory has apparently been wiped from a past incident.  As Wilson accesses ARTI's server room, Brooks downloads the data on the cube and attempts to betray Wilson, but he is killed by ARTI when he attempts to shut it down. Its programming now adjusted, ARTI uses satellites in Earth's orbit to bombard the planet and destroy humanity. Wilson then sees a recording of herself, and it's revealed she is herself a construct in a simulation, created as part of a Turing test. In an ambiguous ending, Wilson is apparently revealed to have been inside the cube the whole time, and she agrees to travel with ARTI and the cube to coordinates apparently left by the aliens.  Cast Katee Sackhoff as Mackenzie 'Mack' Wilson Ray Fearon as Sterling Brooks Julie Cox as Lena Wilson Steven Cree as ARTI (voice), an artificial intelligence system David Tse as JAIN Lin (voice), another AI system  Release 2036 Origin Unknown was released on June 8, 2018 at Laemmle Monica Film Center in Santa Monica, California.  Reception David Duprey of ThatMomentIn gave the film 3.5 stars out of 5, stating, \"While the whole thing might not have the impact it entirely aims for, it is nonetheless a highly engaging little thriller with a terrific performance from Sackhoff. Well-directed and targeted directly at fans of science fiction who care more about science than the fiction\".  See also List of films set on Mars  References External links 2036 Origin Unknown on IMDb  2036 Origin Unknown at Rotten Tomatoes 2036 Origin Unknown at Metacritic",
    "Categories": [
      "2010s science fiction films",
      "2010s thriller films",
      "2018 films",
      "American science fiction action films",
      "American space adventure films",
      "British films",
      "British science fiction films",
      "English-language films",
      "Films about astronauts",
      "Films set in 2036",
      "Mars in film"
    ]
  },
  "32": {
    "Title": [
      "3100: Run and Become"
    ],
    "Director": [
      "Sanjay Rawal"
    ],
    "Starring": [
      "[]"
    ],
    "Running Time": 79,
    "Country": [
      "United States"
    ],
    "Language": [
      "English"
    ],
    "Time": [],
    "Location": [],
    "Text": "3100: Run and Become is a documentary about why people run, with portraits of runners and what motivates them.  Plot The plot centers on the 3100 mile race in New York City,  and also follows Ashprihanal Aalto, a Finnish courier, and Shamita, an Austrian cellist. The  film captures the esoteric, spiritual side of running.  The film features such diverse locales as New York, to places around the world where ancient cultures have held running sacred, such as the forests of Finland, mountains of Japan, the Kalahari Desert in Africa and the Navajo Nation Reservation in Arizona. It also features the stories of three other runners–Shaun Martin, a Navajo runner and Board Member of Wings of America, Gaolo of the San Bushmen of the Kalahari, and Gyoman-san of the Monks of Mt. Hiei, Japan.  Awards Winner, Director’s Choice – Illuminate Film Festival  Song Roberta Flack contributed the song \"Running\", the song appears on the soundtrack for the documentary.  Reception Steve Prokopy from the Third Coast Review found the film “intriguing, and an eye-opening look at a way of living most of us will never understand.” After viewing the movie, runners themselves “become more interested in learning more about the role that running plays in different cultures.” Broadway World describes the film as having shone a “light on the universality of the run as an enduring pathway to enlightenment,”while the Santa Fe Reporter appreciated its cultural diversity.  References External links 3100: Run and Become on IMDb  Official website",
    "Categories": [
      "2010s documentary films",
      "2018 films",
      "American documentary films",
      "American films",
      "Documentary films about Hinduism",
      "English-language films",
      "Official website not in Wikidata",
      "Sports events founded by Sri Chinmoy"
    ]
  },
  "33": {
    "Title": [
      "A ti te quería encontrar"
    ],
    "Director": [
      "Javier Colinas"
    ],
    "Starring": [
      "Eréndira Ibarra",
      "Erick Elias",
      "Luis Arrieta",
      "Paulette Hernández"
    ],
    "Running Time": "[]",
    "Country": [
      "[]"
    ],
    "Language": [
      "[]"
    ],
    "Time": [],
    "Location": [],
    "Text": "A ti te quería encontrar is an upcoming Mexican drama film directed by Javier Colinas and written by Tamara Argamasilla. The film stars Eréndira Ibarra, Erick Elias, Luis Arrieta, and Paulette Hernández, and will be presented on 9 June 2018 on the 10th anniversary of the HOLA Mexico Film Festival in Los Angeles.  References External links A ti te quería encontrar on IMDb",
    "Categories": [
      "2010s Mexican film stubs",
      "2018 films",
      "All stub articles",
      "CS1 Spanish-language sources (es)",
      "Mexican films",
      "Mexican romantic comedy films",
      "Spanish-language films"
    ]
  },
  "34": {
    "Title": [
      "A.X.L."
    ],
    "Director": [
      "Oliver Daly"
    ],
    "Starring": [
      "Alex Neustaedter",
      "Becky G",
      "Alex MacNicoll",
      "Dominic Rains",
      "Thomas Jane"
    ],
    "Running Time": 98,
    "Country": [
      "United States"
    ],
    "Language": [
      "English"
    ],
    "Time": [],
    "Location": [
      "California"
    ],
    "Text": "A.X.L. is a 2018 American science fiction adventure film written and directed by Oliver Daly, and starring Alex Neustaedter, Becky G, Alex MacNicoll, Dominic Rains, and Thomas Jane. It tells the story of a teenage boy who encounters a robotic dog created from cutting edge military technology. It was released in the United States on August 24, 2018, by Global Road Entertainment, received generally unfavorable reviews from critics, and was a box office flop, grossing only $8.2 million against its $10 million budget.  Plot A-X-L is a top-secret, robotic dog created by the military to help protect tomorrow's soldiers. Code named by the Crane Systems scientists who created him, A-X-L (Attack, Exploration, Logistics) embodies the most advanced next-generation artificial intelligence. After an experiment gone wrong, A-X-L is discovered hiding alone and damaged in the desert by a kind-hearted outsider named Miles Hill who finds a way to connect with him after activating his owner-pairing technology. Helping Miles gain the confidence he's been lacking, A-X-L will go to any length to protect his new companion, including facing off against the scientists who created him and who will do anything to get him back. Knowing what is at stake if A-X-L is captured, Miles teams up with a smart, resourceful ally named Sara Reyes to protect his new best friend. Miles and Sara go back to Miles' home (leaving A-X-L somewhere in an old ruin), and tell his father, Chuck, about A-X-L, but Chuck tells them to return A-X-L to its owners. At the same time, Sam returns with his crew and burns A-X-L with his flamethrower. Sara records a video on her camera phone and Miles and Sara both take off to save A-X-L, but are too late. However, A-X-L gives them a location to go to repair him. Meanwhile, a man sent by Andric shows up at the house and demands that Chuck reveal the location of the devices that control A-X-L. Chuck, growing suspicious, manages to trick the man, and demands him to answer his questions. The Agent reveals he is looking for A-X-L. Miles and Sara take A-X-L to a garage for repairs and it automatically repairs itself for 2.5 hours. However, Andric gets a log on its location and sends his team to retrieve it. The Agents arrive and try to retrieve A-X-L while it's still repairing. When it comes online, it remembers its last memories of Sam burning him with a flamethrower. A-X-L runs out to go and kill Sam, with Miles and Sara rushing to stop it. Sam and his friends are throwing a party when A-X-L arrives to get revenge. Sam tries again to burn him with a flamethrower until the fuel runs out, but Miles and Sara arrive and convince A-X-L not to kill Sam. Drones arrive and disable A-X-L; Miles and Sara are captured and brought to Andric and he tries to override Miles' control of A-X-L, but fails. When Miles refuses to tell him where the remote is, Andric programs A-X-L to attack Sara,if he doesn't tell him where the remote is. Sara is able to convince A-X-L not to attack her by showing the feather that she drew earlier. Andric tries to escape when Captain Webber shows up, but he is arrested and realizes that Berman contacted Webber and reported him. Knowing they are surrounded and they still want A-X-L, Sara allows herself to be captured, while Miles and A-X-L escape, but they are pursued by a helicopter. They ride up a mountain until they fall, knowing Miles can't keep him, he orders A-X-L to run. A-X-L obeys and tries to get as far away as possible to self-destruct whilst uploading in the web all the memories A-X-L, Miles and Sara had together. After uploading, A-X-L looks at Miles in the eyes for the last time, messaging him \"good bye\". He then finishes the self-destruct sequence, leaving Miles to be subdued by the military. 6 weeks later, Andric is arrested for violating national security and endangering the lives of civilians; he is visited by Webber who informs him that A-X-L's code has resurfaced, and wants to know what it is doing. Sara and Miles have gone off to college via the scholarships provided by the military – to buy their silence and to keep an eye on them. Meanwhile, Sara and Miles spend the day at the beach hanging out, studying, and playing with their new puppy, when Sara gives him an envelope. Miles opens it and puts out a short note from his dad. Miles reads it then flips the envelope upside down and the remote to A-X-L falls out into his hand. Miles asks Sara if he should try and activate it. The pairing device does and the A.X.L. OS is uploading itself back on their phones. They realize that A-X-L is alive, survived somehow, and might be returning to them. \"To be continued... (maybe)\"  Cast Alex Neustaedter as Miles Hill, an aspiring motocross racer. Becky G as Sara Reyes, a resourceful girl who Miles allies with. Alex MacNicoll as Sam Fontaine Dominic Rains as Andric, a scientist at Crane Systems. Thomas Jane as Chuck Hill, the father of Miles. Lou Taylor Pucci as Randall, a scientist at Crane Systems. Patricia de Leon as Joanna Reyes, Sara's mother. Ted McGinley as George Fontaine Eric Etebari as Operative Berman Marie-Françoise Theodore as Captain Webber  Production A-X-L is based on the proof-of-concept short film Miles by writer/director Oliver Daly. The short film was funded via Kickstarter campaign that began in 2014, with 190 backers. According to the campaign, the short film is a \"movie about blurring the boundaries between humanity and technology, set in the off-roading world of Central California.\"Production began in 2015 when writer/director Oliver Daly began reworking his short film Miles into a feature-length film. David S. Goyer joined the project as producer through his Phantom Four banner alongside Kevin Turen. Lakeshore Entertainment joined Phantom Four to produce the film, which began principal photography in 2016. Global Road Entertainment (formerly Open Road) joined Lakeshore Entertainment to co-produce and co-finance the project.In August 2016, pop star Becky G announced that she would be joining the cast as \"Sara\". Actor Alex MacNicoll (Transparent) was cast in the film in October 2016, joining Alex Neustaedter.The film was released despite its financing and production company Global Road Entertainment was taken over by its lenders.  Reception Box office In the United States and Canada, A.X.L. was released on August 24, 2018 alongside The Happytime Murders, and was projected to gross around $5 million from 1,710 theaters in its opening weekend. It ended up debuting to $2.9 million, finishing ninth at the box office. The film made a total of $8.1 million worldwide.  Critical response On review aggregation website Rotten Tomatoes the film has a score of 25% based on 20 reviews, with an average rating of 3.7/10. The site consensus reads, \"Clumsily recalling numerous superior movies about unlikely human/robot friendships, A.X.L. is an obsolete adventure made from frequently malfunctioning parts.\" On Metacritic the film has a weighted average score of 29 out of 100, based on reviews from 7 critics, indicating \"generally unfavorable reviews\". Audiences polled by CinemaScore gave the film an average grade of \"B+\" on an A+ to F scale, while PostTrak reported filmgoers gave it a 59% overall positive score.Katie Rife of The A.V. Club described the film as \"utterly forgettable\", not believing that anyone would \"want to watch [the] utterly generic, sloppily conceived film badly enough to see it in theaters\".  References External links Official website A.X.L. on IMDb  A.X.L. at Box Office Mojo",
    "Categories": [
      "2010s action films",
      "2010s science fiction films",
      "2018 films",
      "American action films",
      "American coming-of-age films",
      "American films",
      "American science fiction films",
      "Directorial debut films",
      "Drone films",
      "English-language films",
      "Films set in California",
      "Films shot in Argentina",
      "Films shot in Australia",
      "Films shot in London",
      "Films shot in Los Angeles",
      "Films shot in Melbourne",
      "Films shot in Mexico",
      "Official website not in Wikidata",
      "Robot films"
    ]
  },
  "35": {
    "Title": [
      "Aa Bb Kk"
    ],
    "Director": [
      "Ramkumar Shedge"
    ],
    "Starring": [
      "Tamannaah",
      "Suniel Shetty",
      "Sunny Pawar"
    ],
    "Running Time": 121,
    "Country": [
      "India"
    ],
    "Language": [
      "Marathi"
    ],
    "Time": [],
    "Location": [],
    "Text": "Aa Bb Kk is a Marathi feature film written by Aba Gaikwad and directed by Ramkumar Shedge and produced by Meehir Kulkarni, Film Is Based on social subject.  Plot A tragic tale of a girl Jani, who is branded as a curse by the society after her mother dies while giving birth. The film revolves around the hardships she and her brother Hari face in their day-to-day life.  Cast Tamannaahas Tamannaji Master Sunny Pawar as Margya Master Sahil Joshi as Hari Baby Mythili Patwardhan as Jani Vijay Patkar as Peon Suniel Shetty as Bappa Ravi Kishan Tanvi Sinha  Reception The Times of India rated the film 3 out of 5 stars.  Music References External links Aa Bb Kk on IMDb",
    "Categories": [
      "2010s Marathi-language film stubs",
      "2018 films",
      "All Wikipedia articles written in Indian English",
      "All articles with dead external links",
      "All stub articles",
      "Articles with dead external links from February 2018",
      "CS1 maint: Archived copy as title",
      "Indian drama films",
      "Indian films",
      "Marathi-language films",
      "Track listings with input errors",
      "Use Indian English from March 2018",
      "Use dmy dates from March 2018"
    ]
  },
  "36": {
    "Title": [
      "Aa Karaala Ratri"
    ],
    "Director": [
      "Dayal Padmanabhan"
    ],
    "Starring": [
      "Karthik Jayaram",
      "Anupama Gowda",
      "Rangayana Raghu",
      "Veena Sundar"
    ],
    "Running Time": "[]",
    "Country": [
      "India"
    ],
    "Language": [
      "Kannada"
    ],
    "Time": [],
    "Location": [],
    "Text": "Aa Karaala Ratri (English: That Intense Dark Night ) is a 2018  Kannada-language suspense thriller film directed by Dayal Padmanabhan and produced under his own banner, D Pictures.The movie is based on a Kannada play by Mohan Habbu which was based on the Russian story titled The Return of the Soldier.  Cast Karthik Jayaram as Channa Keshava Anupama Gowda as Mallika, referred to as Malli in the movie Rangayana Raghu as Muthanna AKA onti Mane Muthanna Veena Sundar as Gowramma Naveen Krishna in Cameo Jaya Srinivasan Ashitha chandrappa  Story In an interior village deep in Karnataka, a fortune teller visits a poverty-stricken family and tells them that their fortune is going to change overnight. A mysterious traveller (played by Jayaram Karthik) visits their home on the same day and asks to stay overnight. What happens during that one intense night forms the rest of the story. The Movie starts with a view of a burning house in a village, a background voice says this is the end of the story not the beginning. the scene shifts to a God man explaining to villagers about human desires and how its common for all living things to have desires. he advices that as humans one should control his desires yet live in a way which should be dignified. among the villagers are Gowramma and Mallika. they leave midway to their home as its getting late. Farmer Onti Mani Muthanna, his wife Gowramma and Daughter Mallika, called as Malli live in a remote place. They pawned their agricultural land and 9 acers of farm to a rich man to meet medical expenditure and since then are living in utter poverty. Farmer Muthanna is addicted to Alcohol and boozes every night. Gowramma works in the farm and also helps the village ladies deliver children. Daughter Mallika is an ambitious lady. she know age is slipping and is craving to get married and enjoy her life, but her father is unable to help her with this. Malli is frustrated with this and keeps expressing this to her mother. one day a fortune teller tells the family that they are about to see a lot of money but warns them that they should look beyond the money. but the family drives him away, as he walks away from the house, a tourist visits the house asking for some water to drink. The Tourist names himself as chenna keshava. upon quenching his thirst, Since the next village is far and it takes more than a day to reach there, he apologetically asks if he can stay for the night. the family is reluctant as there is an unmarried girl at home and it may lead to bad press if people discover that a stranger stayed overnight at their house. but they eventually agree for the tourist to stay. The Tourist is very polite to the family and offers money for buying tea powder and also pays a little extra to Muthanna. The man to whom the land and house is pawned pays a visit to Muthanna's house and tells him to pay more attention to the farm and its produce as the land is pawned to him. he also gives hints that if some people make up their mind things can be better, hinting his interest in Mallika. Muthanna, Gowramma and Mallika get the hints. Mallika indirectly abuses him giving clear indication that she is not interested in him. the tourist, Chenna Keshava over hears all of this and offers to help the family. he offers to pay the entire outstanding loan and shows some jewels and money to prove his point. the family is surprised, they refuse to accept his offer as he is a stranger. in the evening, the Tourist requests that a non-veg dish be prepared and offers money to buy the necessary ingredients and a little extra so that the entire family can enjoy a good meal. Mallika sees an opportunity and convinces her mother Gowramma to kill the tourist and rob him of his money. Muthanna over hears this and mentions to his family that if his daughter's life can be better his is willing to do anything. all three realize the pressures they have from their financiers and poverty and decide to kill the stranger. Muthanna goes for his daily dose of Alcohol. Gowramma and Mallika prepare dish and poison it for the tourist. Two policemen come to their house enquiring if they have seen any stranger around as there was a robbery nearby. Both the ladies refuse seeing anybody. the policemen smell a nice non-veg meal and ask the family to share the meal, Gowramma spills the poisoned dish to avoid killing the policemen. the policemen leave after finishing their meal. their pet dog however eats the split dish and dies of poison. The Tourist finishes his meal and goes to bed as a happy man. Mallika realizes that her mother never poisoned the dish out of fear after the policemen visited their house. Frustrated, Malli decides to kill the tourist. She slits his throat while he is sleeping. Malli starts digging a grave to dispose the body. Muthanna is at the local bar and discovers that the waiter at the bar knows about the visitor at his house. he returns to the house and discovers that the ladies have killed the tourist. He weeps his heart out upon this discovery and reveals that the tourist is their own son who had run away from their home at a young age. the tourist had revealed this to the people at the bar. He wanted to surprise the family and didn't want anybody else to tell it to them. the waiter had told this to Muthanna. Muthanna mentions this to his family. the family is devastated, they share the poisoned meal and sets the house on fire.  Production Development The movie is based on a Kannada play by Mohan Habbu which was based on the Russian story titled The Return of the Soldier. Senior director S. K. Bhagavan had revealed that during the making of 1978 Kannada movie Shankar Guru, he had narrated this story to matinee idol Rajkumar.The film was planned to be shot in Ladakh and some preparation was undertaken, but in the end Rajkumar backed out as he felt the story was too dark.Impressed by Mohan Habbu's story, Dayal decided to acquire the rights and make it into a full-length feature film. When Dayal entered the Bigg Boss house as a contestant his idea was strengthened when his fellow contestants JK & Anupama Gowda agreed to be a part of the film if it was made. Once out of Big Boss Dayal sprung into action and completed the entire script, along with co-dialogue writer Naveen Krishna, and narrated the full script to JK and Anupama once they were out of the Big Boss game.  Casting Once the lead pair was fixed, Dayal zeroed in on Rangayana Raghu and Veena Sundar for other pivotal roles. Many of Dayal's contestant friends from Bigg Boss like Jaya Srinivasan, Ashitha and Diwakar are making character appearances in the movie. This film will be Jayaram Karthik's first release since his Bigg Boss stint  as a lead and is going to be the second movie as a leading lady for popular tele-actress Anupama Gowda. Experienced Cinematographer P.K.H. Das is helming the camera. Sri (CrazyMindz) is the movie's editor. Ganesh Narayan is composing the music for the film.  Filming The muhurat for the movie is happened on the 19th of February in Oni Anjaneyaswamy Temple, Bangalore. Simultaneously Dayal's other movie PUTA 109, again starring Jayaram Karthik, is also being launched on the same day. The movie's shoot is to take place  over 25 days in Balur, Chikmagalur Taluk.  Reception The movie got 4/5 stars in TOI reviews. The Bangalore mirror rated the movie as one of the best movies of the year. Kannada Actor Sudeep said the movie was \"gripping\".The movie has an 80% rating on BookMyShow. TheNewsMinute mentions that \"seasoned\" actors and \"clever\" director came together hand-in-hand to make an interesting suspense thriller flick. Shyam Prasad S from Bangalore mirror said the movie is one of the best movies of the year and credited the convincing performances and brilliant technical execution for the success. Cineloka credits the director's smart moves and decision to make a good movie after his recent failures to prove his mettle. Actors' performances and PKH Das' cinematography was praised too.  References External links Aa Karaala Ratri on IMDb",
    "Categories": [
      "2010s Kannada-language films",
      "2018 films",
      "Indian films",
      "Indian films based on plays",
      "Indian thriller films",
      "Kannada-language films",
      "Use dmy dates from May 2017",
      "Wikipedia articles needing clarification from February 2018"
    ]
  },
  "37": {
    "Title": [
      "Aabhaasam"
    ],
    "Director": [
      "Jubith Namradath"
    ],
    "Starring": [
      "Suraj Venjaramoodu"
    ],
    "Running Time": "[]",
    "Country": [
      "India"
    ],
    "Language": [
      "Malayalam"
    ],
    "Time": [],
    "Location": [],
    "Text": "Aabhaasam is a 2018 Indian Malayalam-language film written and directed by Jubith Namradath. The film stars Suraj Venjaramoodu, Alencier Ley Lopez, Indrans, and Rima Kallingal.  Plot 'Aabhaasam' is a story told through a bus journey from Bangalore to Kerala, it dwells on the theme of suppressed urges of lust and the unapologetic inhumane acts that people find to satisfy it. The film unfolds the theme through instances of the story-line.  Cast Suraj Venjaramoodu Indrans Alencier Ley Lopez Nassar Rima Kallingal Gilu Joseph Nirmal Palazhi Divya Gopinath  References External links Aabhaasam on IMDb",
    "Categories": [
      "2010s Malayalam-language films",
      "2018 films",
      "Indian comedy films",
      "Indian films"
    ]
  },
  "38": {
    "Title": [
      "Aadhi"
    ],
    "Director": [
      "Jeethu Joseph"
    ],
    "Starring": [
      "Pranav Mohanlal"
    ],
    "Running Time": 159,
    "Country": [
      "India"
    ],
    "Language": [
      "Malayalam"
    ],
    "Time": [],
    "Location": [
      "Bangalore"
    ],
    "Text": "Aadhi is a 2018 Indian Malayalam-language action thriller film written and directed by Jeethu Joseph. The film stars Pranav Mohanlal in the title role and was produced by Antony Perumbavoor through Aashirvad Cinemas. The film also co-stars Aditi Ravi, Anusree, Jagapati Babu, Siddique, Lena, Sharaf U Dheen, Siju Wilson, Meghanathan, Sijoy Varghese, Tony Luke, and Krishna Shankar. The fim' soundtrack was composed by Anil Johnson. The principal photography took place between August and November 2017 in Kochi, Bangalore, and Hyderabad. Aadhi was released in India on 26 January 2018 and met with positive critical response. The film became one of the highest-grossing Malayalam films of the year and ran over 100 days in theatres.  Plot Adhithya Mohan (aka Aadhi) aspires to become a music director in the film industry. He has his other part of desire left for parkour with friends through the beach. He is seen as a singer at the start of the film. He is not too much supported by his dad Mohan Varma and his boss, both of whom, wants him to follow his dad's footsteps and start working for livelihood. His mother, Rosy though, is the exact opposite and is clearly supportive of his tenure as a music-director aspirant. His mother is not supporting his parkour desire. He is seen trying hard to get a breakthrough.  In the shade of pursuing him to follow his dad's footsteps, his dad's boss urges Aadhi to take his car to Bangalore where he plans on attending a meeting after his arrival from foreign and has a week's commute. his dad's boss's driver is sick. Aadhi, having heard of a cine-workers pub, through his friend Nadhir, and his potential opportunity of getting the people there to catch an attention on him, decides to take the car there. So he has an opportunity to stay there and perform and can help his dad's boss get his car.  Aadhi gets a shot at performing in the bar and meets a colleague of his, Anjana at the pub. She is accompanied by her boss's son and nephew, both of whom does not take her acquaintance with Aadhi lightly. Aadhi performs and is instantly seen as a superhit and moves all the gathering to his tones. When Anjana extensively involves with the song, her colleagues start making a fuss and Aadhi is forced to leave. He goes to the roof and hangs out himself. Anjana on the behest of apology,  goes to him, only for others to intervene and create a commotion, in which Jayakrishnan accidentally kicks his colleague of the roof to his death. Jayakrishnan frames Aadhi for the death, and Narayan Reddy, the owner of Pinnacle Group and a greatly influential person in the whole of Bangalore city,  seeks to take revenge on Aadhi. He uses his influence to make this an accidental death and starts an underground hunt for Aadhi, using a pic of him taken through the security cam in the pub.  Reddy gets hold of the car that Aadhi brought to the pub, his dad's boss's one, and through the security cam footage that he stays somewhere in the Bangalore-Mysore road. He sends his goons to catch Aadhi, while unbeknownst to all of it, is in the streets. But using his free running skills, he evades the goons only to end up with Sharath. Sharath takes him home and tells him about the bounty Reddy has placed on him. Sharath also tells him that he will help him as Reddy has caused ill fates to his family, and is the sole reason why his family is this way. Sharath agrees to help him and his sister Jaya to approves of that. Sharath takes help from his friend Mani Annan and decides to plot an escape plan, all to go waste. Aadhi meets up with his dad at Sharath's home and decides to go abroad. He takes refuge in an abandoned factory until his escape plan is done.  In the meantime, Reddy urges the cops to have a lookout for Aadhi and all the transport routes are inspected for Aadhi's suspected departure. Aadhi having lost his phone, keeps on his communication with his parents through Sharath and this intrigues Reddy, who decides to go for call tracing on that. Suspecting of his activities being disclosed, Jayakrishnan readily takes over the responsibility of monitoring the calls. He overhears the call and confirms Aadhi's location and goes with some goons to get done with Aadhi. Aadhi somehow escapes from them and interprets that Jayakrishnan has been tapping his phone calls. Jayakrishnan, having learned of Sharath's role in Aadhi's hideout, captures him and murders him before Sharath discloses Jayakrishnan's role in the death of Reddy's son. This creates a stir and Aadhi is forced to leave the hideout. Aadhi plots a new plan to disclose things to Reddy, as the situation brings him to the conclusion that Jayakrishnan devised the whole plan to save face, owing to the fact that Reddy might kill him if he is found guilty. Aadhi takes help from Mani Annan and a former employee of the Pinnacle Group, Ebin to disclose Reddy on all the happenings at his office in Bangalore. As per Ebin's request, he gets hold of gadgets to gain access to the security cam footage of the building and thereby get to Reddy's office. He also uses Anjana to device a plan so that Jayakrishnan stays out of the office and passes information that he is going to meet Reddy at an event outside his office late one day. Jayakrishnan leaves the office soon. Aadhi gets inside the office through the service exit, and Anjana through the front door, which alerts Jayakrishnan who returns soon after. Meanwhile, both reach Reddy's office, only for Reddy to attack Aadhi, who later convinces Reddy of Jayakrishnan's part in the ploy. Jayakrishnan soon comes and shoots Reddy, and leaves him for dead, and along with Siddharth aka Siddhu discloses them as partners intending on killing Reddy and take his wealth. Siddhu never intended on sharing and turns on Jayakrishnan and kills him and moves to kill Aadhi and Anjana as well. Aadhi makes a quick run for it and reaches the 10th floor of the building. He is taken out by the guards before he could rappel out. He is taken down by the guards and Siddhu gets down to kill him. Before Siddhu could shoot him, it is revealed that the 10th-floor exit was an escape plan and Aadhi performs a Dülfersitz just before Ebin turns the fire alarm on, to shower gasoline on them. Aadhi throws a lighter and escapes out in the ensuing explosion. Reddy recovers and it is revealed that Aadhi is set free and Jayakrishnan and Siddhu was killed because of the explosion on the 10th floor.  Cast Production Development On 30 September 2016, Mohanlal announced that his son Pranav Mohanlal would be acting in a film directed by Jeethu Joseph and produced by Aashirvad Cinemas, which would be a thriller. The film marks the return of Pranav as an actor, who had earlier appeared as child actor. He had worked with Jeethu as an assistant director in two films—Papanasam and Life of Josutty. The project was green-lit a few days before the announcement when Jeethu had a discussion with Pranav. After learning Pranav wanted to return to acting, Jeethu approached him with an abstract idea of a film and received positive feedback.Jeethu was in charge of writing; he had completed the story by the time of the announcement and had begun writing the screenplay, intending it to be his next directorial. He described the film as an action movie and a thriller, but it will not resemble a thriller like his 2013 film Memories. Jeethu had developed the story idea during his college education. His protagonist was a marathon or cross country runner, whose athletic skills aid him in the story. For the film, it was changed to parkour since Pranav had learned it during his academic life. The entire plot takes place within one week or 10 days. By the end of March 2017, Jeethu said he was working on the script and hoped to start filming by June, with the rest of the cast finalizing after the first draft is prepared. In early May, Jeethu confirmed that the first draft was complete and they were about to enter pre-production, with the filming planned to begin in the second half of 2017. In mid-May he stated that he is still working on the screenplay.In early July 2017, Jeethu said he intended to start filming by the end of that month. For the film, Pranav trained in parkour. The title Aadhi along with an animated digital poster were revealed on 5 July at the puja function of the film held at hotel Vivanta by Taj in Thycaud, Thiruvananthapuram. The venue was shared with the puja of Aashirvad Cinemas's Odiyan. Aadhi is billed with the tagline, \"some lies can be deadly\". Satheesh Kurup was signed as the cinematographer, while Anil Johnson as music composer.  Casting Pranav plays Aadhi, an urban youth who loves music and aspires to become a music director. Although Pranav was described about his character, Jeethu gave him freedom to mould the character accordingly. In August 2017, Siddique, Sharaf U Dheen, and Siju Wilson were confirmed in prominent roles. Initially Sunny Wayne was signed for a role but had to cancel because of scheduling conflicts. The film has no romantic track. The leading female roles are played by Anusree, Aditi Ravi, and Lena. Aditi plays Anjana, a Bangalore-based Malayali banking professional. She was suggested to Jeethu by cinematographer Satheesh Kurup, who worked in her debut film Alamara; Aditi was cast after a screen test. Siddique and Lena play Aadhi's father and mother. Also in August 2017, confirming his presence, Tony Luke shared his character look on a social networking site, sporting a thick beard. By the end of the month, Jagapati Babu was confirmed to be in the cast in a significant role.  Filming Preliminary principal photography commenced on 5 July 2017 at hotel Vivanta by Taj in Thycaud, Thiruvananthapuram after a puja function held at the same venue—it was a single brief shot featuring Pranav. The regular filming began on 1 August 2017 in Nedumbassery, Kochi. Pranav was seen playing a guitar in the scene stills taken on the day. Early in this schedule, some scenes were filmed inside a studio near Pathadipalam in Kochi, inside which a house was created in set. Pranav and Anusree were present in that segment. The first schedule in Kochi continued until 10 August and the second schedule began in Bangalore the following week. The schedule was expected to continue until mid-September and then shift to Hyderabad by the end of the month.In early September, Jeethu said the crew had already filmed two songs of the three songs. The unit finished filming in Bangalore and shifted to Hyderabad earlier than scheduled due to rain. Filming began at Ramoji Film City in Hyderabad from 3 September; the scenes including an office, a building, a club, and a dance bar had originally been planned for Bangalore but were shot in Ramoji Film City instead. The schedule in Ramoji Film City was planned for 20 days. The film also had location shooting in a few streets in Hyderabad. Pranav, Aditi, and Anusree took part in this schedule. Jeethu's spouse Linta Jeethu was the film's costume designer.Pranav received the screenplay early and had several discussions with Jeethu, who said, \"because he has been through the script so many times, he is able to add his improvisations\" and \"directing him has been a seamless experience\". By the end of September 2017, Jeethu said they had one month of shoot left in Hyderabad and would soon film the action scenes, for which a foreign stunt director would join the unit. After completing the action scenes, the crew would shift again between Kochi and Bangalore. On 23 October, the unit returned to Kochi to begin the final phase of filming; the climax scenes were shot in the next two days. Pranav was injured while breaking glass for a scene. While performing an action scene in Kochi, Pranav's finger bruised and bled; he was taken to a hospital and was prescribed two days' rest. The crew had only three days of filming left and were about to return to Hyderabad for the weekend. Since the upcoming action scenes require many hand movements, filming was postponed to the next week. They were permitted to shoot only at weekends. When the first poster of the film was released on 4 November, Jeethu wrote on his social networking page that the final phase of filming was progressing in Hyderabad. Filming wrapped on 8 November 2017.  Music Anil Johnson composed the music for the film, which will feature three songs. Besides acting, Pranav made his debut as a playback singer and songwriter with a retro English track in the film. When Jeethu asked, Pranav expressed interest in writing and singing the track that appears in a live performance scene in the film. He also played the guitar for the scene. Johnson was also confident of Pranav's singing and guitar skills. Titling the song, finalizing the tune, and recording occurred in Kochi after Pranav returned from the final filming schedule in Hyderabad. \"Sooryane\", a single from the film was released by Goodwill Entertainments label on 5 January 2018 for digital download and as music video on YouTube. It was sung by Najim Arshad and written by Santhosh Varma. The music work was done at Blacknoise studio in Kochi and 20 dB Studios in Chennai.  Release The makers initially targeted a release by Christmas 2017, but in August that year, Jeethu confirmed the film would not be released at Christmas because filming was expected to finish by October and the film would have an extensive post-production. In early November 2017, Jeethu stated they had a few more days of filming left but had already begun the post-production work to ensure a release by the end of January 2018. Release date was confirmed in December 2017. Aadhi released in India on 26 January 2018.  Reception Aadhi opened to widely positive critical response. The New Indian Express, Firstpost, and Malayala Manorama awarded the film 3.5 out of 5 stars. Sify gave the verdict \"a thrilling ride\". The Indian Express, Deccan Chronicle, and The Times of India rated 3 out of 5 stars.The film grossed ₹50 crore from the box office worldwide.  References External links Aadhi on IMDb",
    "Categories": [
      "2010s Malayalam-language films",
      "2010s action films",
      "2010s action thriller films",
      "2018 films",
      "All Wikipedia articles with plot summary needing attention",
      "All Wikipedia articles written in Indian English",
      "Articles with short description",
      "CS1 Malayalam-language sources (ml)",
      "Films directed by Jeethu Joseph",
      "Films set in Bangalore",
      "Films shot in Bangalore",
      "Films shot in Hyderabad, India",
      "Films shot in Kochi",
      "Indian action films",
      "Indian action thriller films",
      "Indian films",
      "Malayalam-language films",
      "Parkour in film",
      "Use Indian English from March 2018",
      "Use dmy dates from March 2018",
      "Wikipedia articles with plot summary needing attention from February 2018"
    ]
  },
  "39": {
    "Title": [
      "Aadi Purana"
    ],
    "Director": [
      "Mohan Kamakshi"
    ],
    "Starring": [
      "Shashank",
      "Moksha Kushal",
      "Ahalya Suresh",
      "Rangayana Raghu"
    ],
    "Running Time": 141,
    "Country": [
      "India"
    ],
    "Language": [
      "Kannada"
    ],
    "Time": [],
    "Location": [],
    "Text": "Aadi Purana is an Indian Kannada-language romantic comedy film. It was directed and edited by the debutant Mohan Kamakshi and produced by Shamanth K. Rao, under the banner of Rainbow Productions. The film stars Shashank and Moksha Kushal and Ahalya Suresh  in the lead roles along with Rangayana Raghu, Nagendra Sha, Vathsala Mohan and others.  Synopsis Adi Purana is a romantic comedy that follows the romances and comedy of errors in Aditya's life. Aditya's personality is a good mix of middle-class values, sense of independence and his confidence. The only thing that he perceives is lacking in his life is the company of beautiful girls. Just as he is about to complete his engineering degree, Aditya lands a software job with a start-up company, with good pay. His team lead at work, Disha is a very attractive, boldly dressed, confident, independent woman who falls in love with Aditya, which goes unnoticed by him. On the other hand, Aditya's marriage is fixed with Ramya. Owing to some unavoidable circumstances, the consummation of the marriage keeps getting postponed, leading to a situation where Aditya is on the brink of succumbing to temptation. The conclusion of the story is about how common sense prevails and no one loses their integrity.  Cast Shashank as Aditya Moksha Kushal as Disha Ahalya Suresh as Ramya Rangayana Raghu as The man with no name Nagendra Sha as Aditya's father Vathsala Mohan Aditya's mother Gem Shivu as Ramya's father Sameer Perjabadi as Sangamesha Aditya Bharadwaj as Ganapathi Bhat Sri Manju as Nanjunda Karisubbu as Swamiji  Release and reception The film was released on October 5, 2018. The three exclusive premiere shows of the film for common audiences were held at Davangere on October 2, 2018, at Bangalore on October 3rd, 2018 and at Mysore on October 4, 2018.  Critical Response The film got mixed reviews by the critics and mostly positive and good reviews by the audience.  Soundtrack Chandana Vasisht, Vikram Vasisht and Siddarth Kamath composed the songs and Siddarth Kamath composed the background score for the film. The lyrics for the songs was written by Kaviraj and Vikarm Vasisht.  References External links Aadi Purana on IMDb",
    "Categories": [
      "2018 films",
      "Indian films",
      "Indian romantic comedy films",
      "Kannada-language films",
      "Track listings with input errors"
    ]
  },
  "40": {
    "Title": [
      "Aakko"
    ],
    "Director": [
      "M. Shyam Kumar"
    ],
    "Starring": [
      "Geethan Britto",
      "Tulika Gupta"
    ],
    "Running Time": 148,
    "Country": [
      "India"
    ],
    "Language": [
      "Tamil"
    ],
    "Time": [],
    "Location": [],
    "Text": "Aakko (Acronym for \"Aarva Kolaru\" ) (English : \"Enthusiastic Youngster\") is an upcoming Tamil comedy film directed by Shyam Kumar and produced by Deepan Boopathy and Ratesh Velu. The film features newcomers Geethan Britto and Tulika Gupta in the leading roles with Arjunan and Swaminathan in pivotal roles, while Anirudh Ravichander composes the film's music and plays a guest appearance.  Cast Geethan Britto Tulika Gupta Arjunan Swaminathan Anirudh Ravichander In a Guest Appearance in Enakenna Yaarum Illaye Video Amy Jackson In a Guest Appearance in Enakenna Yaarum Illaye Video  Production Shyam Kumar had approached music composer Anirudh Ravichander hoping to cast him in the lead role for the film in late 2013. After listening to the script and liking the concept, Anirudh turned down the offer on making his acting debut and agreed to compose the film's music. The director then cast newcomer Geethan Britto, Arjunan and Swaminathan to play significant roles in the film, noting that the title \"Aakko\" is slang for the term \"Aarva Kolaaru\", which translates into \"enthusiastic youngster\". Anirudh revealed that he accepted to compose the music to test his star status in the market. In a film where all the other actors are newcomers, Anirudh as the only known star, revealed that he considered it as an \"acid test\" for himself.The film's first look was released to the media on 1 January 2014 with a series of posters featuring Anirudh released. After progressing slowly throughout 2014, a promotional song \"Enakenna Yaarum Illaye\" was released in February 2015, with the success of the song prompting the producers to plan a promotional video featuring Anirudh and Amy Jackson during July 2015. Production troubles meant that Aakko, along with producer Deepan Boopathy's other film Mellisai, was delayed for several years.  Music The film's music is composed by Anirudh Ravichander. As of now, a single track \"Enakenna Yaarum Illaye\" was released online on 14 February 2015. The complete album soon will be announcing via official Twitter page of Anirudh Ravichander. The audio rights of the film was acquired by Sony Music.  References External links Aakko on IMDb",
    "Categories": [
      "2010s Tamil-language film stubs",
      "2010s Tamil-language films",
      "2010s comedy-drama film stubs",
      "2010s comedy-drama films",
      "2018 films",
      "Album infoboxes lacking a cover",
      "All Wikipedia articles written in Indian English",
      "All stub articles",
      "Articles with hAudio microformats",
      "Indian comedy-drama films",
      "Indian films",
      "Tamil-language films",
      "Use Indian English from November 2015",
      "Use dmy dates from November 2015"
    ]
  },
  "41": {
    "Title": [
      "Aalorukkam"
    ],
    "Director": [
      "V. C. Abhilash"
    ],
    "Starring": [
      "Indrans"
    ],
    "Running Time": "[]",
    "Country": [
      "India"
    ],
    "Language": [
      "Malayalam"
    ],
    "Time": [],
    "Location": [],
    "Text": "Aalorukkam is a 2018 Malayalam–language Indian film directed by debutant V. C. Abhilash and starring Indrans in the lead role of the protagonist. The film portrays the struggles of Ottan Thullal exponent Pappu Pisharody, initially in search of his missing son, and later, in accepting him as he is. The film won the National Film Award for Best Film on Other Social Issues while Indrans won the Kerala State Film Award for Best Actor for his widely acclaimed performance in the film. Cast includes Indrans, Srikanth Menon, Shaji John, Sajith V Nambiar, Sameera, Baby Threya.  References External links Aalorukkam on IMDb",
    "Categories": [
      "2010s Malayalam-language films",
      "2018 films",
      "Best Film on Other Social Issues National Film Award winners",
      "Indian art films",
      "Indian films",
      "Malayalam-language films"
    ]
  },
  "42": {
    "Title": [
      "Aamhi Doghi"
    ],
    "Director": [
      "Pratima Joshi"
    ],
    "Starring": [
      "Mukta Barve",
      "Priya Bapat"
    ],
    "Running Time": "[]",
    "Country": [
      "India"
    ],
    "Language": [
      "Marathi"
    ],
    "Time": [],
    "Location": [],
    "Text": "Aamhi Doghi (lit. \"The both of us\") is a Marathi-language feminist drama film starring Mukta Barve and Priya Bapat, directed by Pratima Joshi and produced by Puja Chhabria.  It is an adaptation of the short story Paus Ala Motha by the late author Gauri Deshpande.  Plot Amhi Doghi explores the beautiful relationship between 2 women in a relationship where one would find rivalry.  Cast Mukta Barve as Amla Priya Bapat as Savitri Bhushan Pradhan as Ram Aarti Wadagbalkar as Neha  Production Mukta Barve and Priya Bapat were signed for playing lead roles in November 2017. The film is directed by Pratima Joshi, who is known for her role as an actress, designer and co-director. The film is produced by Puja Chhabria under the banner of White Swan Studios.The film is the second time the actors Mukta Barve and Priya Bapat have collaborated, after the 2010 film Aika Dajiba.  See also Gauri Deshpande  References External links Aamhi Doghi on IMDb",
    "Categories": [
      "2010s Marathi-language films",
      "2018 films",
      "All Wikipedia articles written in Indian English",
      "Films shot in Mumbai",
      "Indian drama films",
      "Indian films",
      "Marathi-language films",
      "Use Indian English from March 2018",
      "Use dmy dates from March 2018"
    ]
  },
  "43": {
    "Title": [
      "Aami"
    ],
    "Director": [
      "Kamal"
    ],
    "Starring": [
      "Manju Warrier",
      "Murali Gopy",
      "Tovino Thomas",
      "Anoop Menon"
    ],
    "Running Time": "[]",
    "Country": [
      "India"
    ],
    "Language": [
      "Malayalam"
    ],
    "Time": [],
    "Location": [],
    "Text": "Aami is a 2018 Indian Malayalam-language biographical film based on the life of famous author Kamala Surayya. It is written and directed by Kamal and stars Manju Warrier as Kamala Surayya, along with Murali Gopy, Tovino Thomas, and Anoop Menon. The film was released on 9 February 2018.  Plot Aami  portrays the life of writer Madhavikutty, mainly focused on her childhood, family life, a devotee of Lord Krishna and conversion to Islam in the later periods of her life.  Cast Manju Warrier as Kamala Surayya (Kamala) Neelanjana as Aami Teenage Aangelina Abraham Aami Childhood Tovino Thomas as Sreekrishnan Murali Gopy  as Madhava Das, Madhavikutty’s husband Anoop Menon as Akbar Ali Rasna Pavithran as Balamani Amma Young Vijayalakshmi as Balamani Amma Old Anil Nedumangadu as V. M. Nair K. P. A. C. Lalitha as Januvamma Vinaya Prasad as Sulochana Nalappat, writer and Kamala’s sister Jitha as Sulochana Nalapat Young Swasthika as Sulochana Nalapat Childhood Rahul Madhav as Kamala's imaginary friend Indrans as Narayanan, Goldsmith Jyothikrishna as Malathi Anjali Nair as Khamar Balachandran Chullikadu a Himself Renji Panicker as S K Nair, Malayalanadu Editor Lekshmi Priya as Madhavikutty fan Sreedevi Unni as Ammamma Valsala Menon as Muttashi Lal kumar as Monu[MD Nalappatt] Uttara as Young Januvamma Krishnan Balakrishnan as reporter Dinesh Prabhakar as angry husband of Madhavikutty fan Jayaraj Warrier as Sukumaran Sethu Lakshmi as Kuttiamma  Production In 2016, Bollywood actress Vidya Balan was signed for the role of Kamala Surayya, but in January 2017, she backed out from the film citing creative differences with Kamal. In 2016, Murali Gopy was confirmed in the role of Madhava Das, Kamala's husband, and Prithviraj Sukumaran in a fictional character. Later in the year, Prithviraj also opted out from the film due to his tight filming schedules and recommended Tovino Thomas instead. Later, Anoop Menon was added to the cast. Media outlets reported several names as a replacement for Balan, but in February 2017 Kamal denied all the reports and said that he is not in a hurry and is still looking for a person whose features match that of Surayya's, which was the reason he chose Balan at the first place. Although he revealed he is also considering suggestions from others and Parvathy is one among. In February 2017, Manju Warrier signed to play Kamala Surayya.Principal photography commenced on 24 March 2017 at Kamala Surayya Memorial in Punnayurkulam, Thrissur. Ottapalam was the main location in the first schedule that went till April. The other locations were Mumbai, Kolkata and Ernakulam.  Soundtrack The film score is composed by Bijibal. The film features original songs composed by two composers, M. Jayachandran and Taufiq Qureshi. Qureshi's compositions are Ghazals with lyrics written by Academy Award winner Gulzar. The lyrics for the Malayalam songs is written by Rafeeq Ahamed.  Awards and Nominations Flowers Indian Film AwardsBest Actress - 2018 - Manju Warrier (shared with Udaharanam Sujatha)Asia Vision awardsBest Actress  - 2018 - Manju Warrier Nana AwardsBest actress  - 2018 - Manju Warrier  References External links Aami on IMDb",
    "Categories": [
      "2010s Malayalam-language film stubs",
      "2010s Malayalam-language films",
      "2018 films",
      "Album infoboxes lacking a cover",
      "All Wikipedia articles written in Indian English",
      "All stub articles",
      "Articles with hAudio microformats",
      "Biographical films about poets",
      "Biographical films about writers",
      "Films directed by Kamal (director)",
      "Indian biographical films",
      "Indian drama films",
      "Indian films",
      "Malayalam-language films",
      "Use Indian English from March 2018",
      "Use dmy dates from March 2018"
    ]
  },
  "44": {
    "Title": [
      "Aami Ashbo Phirey"
    ],
    "Director": [
      "Anjan Dutt"
    ],
    "Starring": [
      "Anjan Dutt",
      "Swastika Mukherjee",
      "Kaushik Sen",
      "Anindya Chatterjee",
      "Darshana Banik",
      "Sauraseni Maitra",
      "Anjana Basu"
    ],
    "Running Time": "[]",
    "Country": [
      "India"
    ],
    "Language": [
      "Bengali"
    ],
    "Time": [],
    "Location": [],
    "Text": "Aami Ashbo Phirey (English: \"I shall return\") is a 2018 Bengali drama film directed by Anjan Dutt and produced by Shree Venkatesh Films. The film stars Anjan Dutt, Kaushik Sen, Swastika Mukherjee, Anindya Chatterjee, Darshana Banik, Sauraseni Maitra, and Anjana Basu. Dutt collaborated on the music with his son Neel Dutt, who composed the music to his father's lyrics. The film was released on 13 April 2018.  Plot The film depicts the stories of four different people who deal with pain and violence through music. All the stories are connected by a violent incident. The film also showcases the influence of virtual media on personal life in the modern era.  Cast Anjan Dutt Swastika Mukherjee Kaushik Sen Anjana Basu Darshana Banik Sauraseni Maitra Anindya Chatterjee  Production In January 2018, Shree Venkatesh Films announced 25 projects, among them was Aami Ashbo Phirey. Director Anjan Dutt said in an interview that the film was an attempt to \"look into my legacy of Bangla cinema, my literature, and tap the mainstream\". Dutt collaborated on the music with his son, Neel Dutt, who composed the music to his father's lyrics. The two had previously worked together on a film 11 years earlier. This was also Dutt's second collaboration with Parno Mittra, with whom he had worked in 2011 on Ranjana Ami Ar Ashbona. It was Dutt's first collaboration with Swastika Mukherjee.  Music Dutt has admitted that he always preferred making musical films. The film features \"songs of an unknown, unheard young singer/songwriter\" which impact the lives of four characters. The Times of India stated that the film's songs give \"the feel of classic Anjan [Dutt] songs that once broke stereotypes regularly\". All lyrics written by Anjan Dutt; all music composed by Neel Dutt.  Release and reception The official trailer of the film was released on 12 February 2018. The film released on 13 April 2018.  References External links Aami Ashbo Phirey on IMDb  Official website",
    "Categories": [
      "2010s Bengali-language films",
      "2018 films",
      "All Wikipedia articles written in Indian English",
      "Bengali-language films",
      "Films directed by Anjan Dutt",
      "Indian drama films",
      "Indian films",
      "Use Indian English from March 2018"
    ]
  },
  "45": {
    "Title": [
      "Aan Dhevathai"
    ],
    "Director": [
      "Thamira"
    ],
    "Starring": [
      "Samuthirakani",
      "Ramya Pandian",
      "Kavin",
      "Monica",
      "Radharavi",
      "Suja Varunee",
      "Abhishek Vinod",
      "Aranthangi Nisha"
    ],
    "Running Time": 115,
    "Country": [
      "India"
    ],
    "Language": [
      "Tamil"
    ],
    "Time": [],
    "Location": [],
    "Text": "Aan Dhevathai (English: Male Angel) is a 2018 Indian Tamil family drama film written and directed by Thamira. The film features Samuthirakani in the lead role, Ramya Pandian, Aranthangi Nisha, Monica, Kavin and Radharavi also in pivotal roles. Featuring music composed by Ghibran, the venture began production in September 2017. The film was released on 12 October 2018 and received average reviews from critics.  Cast Samuthirakani as Elango Ramya Pandian as Jessy Aranthangi Nisha Kavin as Roy Monica as Aathira Radha Ravi Ilavarasu as Solvilanguperumal Suja Varunee as Roopa Abishek Hareesh Peradi as Samuel Kaali Venkat  Production The film was announced and began production during September 2017, with director Thamira making a comeback to films after previously making Rettaisuzhi (2010). He also announced he would produce the film under the newly launched Sigaram Cinemas, while Samuthirakani and joker fame Ramya Pandiyan were selected to play the lead roles. Vijay Milton and Ghibran were consequently selected to be the cinematographer and music composer for the project. Aan Devathai was revealed to revolve around the impact of globalisation, marital relationships and the challenges of raising a kid in the modern times.  Soundtrack Soundtrack was composed by M. Ghibran. Nigara Than Nigara - Vineeth Sreenivasan - 4:05 Malarin Narumanam - Yasin Nizar, S. Riyaz - 3:31 Pesugindren - Chaitra Ambadapudi - 3:27 Rottu Kadai Party - Gold Devaraj - 3:09 Aan Devathai Theme - Ghibran - 1:50  Release The film which was initially slated to release in August was released in October 2018.  Critical reception Times of India wrote \"Though this family drama has a tried-and-tested screenplay, with only a few engaging scenes, it is less preachy when compared to some of Samuthirakani’s earlier films.\" Deccan Chronicle called it \"Just an average drama\". India Today wrote \"Thamira's tries to address the struggles of nuclear families in the fast-paced urban society, but like his one-dimensional characters, the solution he arrives at is also shallow and problematic.\"The few scenes are based on the 2006 Film The Pursuit of Happyness.  References External links Aan Devathai on IMDb",
    "Categories": [
      "2010s Tamil-language film stubs",
      "2010s Tamil-language films",
      "2018 films",
      "Album infoboxes lacking a cover",
      "All Wikipedia articles written in Indian English",
      "All stub articles",
      "Articles containing explicitly cited English-language text",
      "Articles with hAudio microformats",
      "Films scored by Mohamaad Ghibran",
      "Films shot in Chennai",
      "Indian drama films",
      "Indian films",
      "Tamil-language films",
      "Use Indian English from September 2017",
      "Use dmy dates from September 2017"
    ]
  },
  "46": {
    "Title": [
      "Aanakkallan"
    ],
    "Director": [
      "Suresh Divakar"
    ],
    "Starring": [
      "Biju Menon",
      "Anusree"
    ],
    "Running Time": 155,
    "Country": [
      "India"
    ],
    "Language": [
      "Malayalam"
    ],
    "Time": [],
    "Location": [],
    "Text": "Aanakkallan is a  Malayalam-language comedy film directed by Suresh Divakar after his debut film Ivan Maryadaraman. The film stars Biju Menon and Anusree. It was produced under the banner of Saptha Tarang Cinema and was written by Udayakrishna.  Plot Esthappan (Sidhique) is a DYSP, who has married Nancy (Sarayu) from a wealthy household, without the approval of her parents. He is assigned with the duty of finding the mystery behind a skeleton which was found from Ananthapuram Palace. Pavithran, a thief doing time claims he knows the identity of the murderer. Esthappan's wife's house is near the palace, so he sees this as an opportunity to mend his relationship with the family and solve the case with the help of Pavithran. They together attempt to figure out the identity of the murderer.  Cast Biju Menon as Pavithran Siddique as DySP Esthappan (Aana) Suresh Krishna as C.I Bruselee Rajan Anusree as Neelima Kurup Dharmajan Bolgatty as Darmaputran Hareesh Kanaran as Ishow Indrans as Govindan Nair Bindu Panicker as Thresyakutty Saikumar as Paraykal Thomas Sarayu as Nancy Thomas Shamna Kasim as Rosy Thomas Bala (actor) as Suryanarayanan Chembil Ashokan as  Achutha Kurup Kailash as Anirudhan Sudheer Karamana as Korah Suraj Venjaramoodu as Rammu Suresh Kumar as C.P Ramachandran Edavela Babu as Mathukutty Anil Murali as S.I Balachandran Priyanka as Suzy Shivaji Guruvayoor  Music The music for the film is composed by Nadirsha.  Release Aanakkallan released on 18 October 2018.  Reception The Times of India gave the film a rating of 3.0/5 and Mathrubhumi gave the film a rating of 1.5/5.  References External links Aanakkallan on IMDb",
    "Categories": [
      "2010s Malayalam-language films",
      "2018 films",
      "Articles with short description",
      "Indian comedy films",
      "Indian films",
      "Malayalam-language films"
    ]
  },
  "47": {
    "Title": [
      "Aanenkilum Allenkilum"
    ],
    "Director": [
      "Vivek Thomas Varghese"
    ],
    "Starring": [
      "Fahadh Faasil",
      "Catherine Tresa",
      "Sharaf U Dheen"
    ],
    "Running Time": "[]",
    "Country": [
      "India"
    ],
    "Language": [
      "Malayalam"
    ],
    "Time": [],
    "Location": [],
    "Text": "Aanenkilum Allenkilum is an upcoming Indian Malayalam-language film directed and co-written by Vivek and scripted by Arun AR and Ajay Rahul. The film is produced by Raju Malliath of Ragam Movies and was produced in May 2018. It stars Fahadh Faasil, Catherine Tresa and Sharaf U Dheen. PS Jayhari has composed the music and Cyril Kuruvilla handles the art design. The film was earlier announced on 14 February 2017 with Fahadh Faasil and Sunny Wayne, but Wayne was later replaced by Sharaf U Dheen.  Cast Fahadh Faasil Sharaf U Dheen Catherine Tresa Renji Panicker Dharmajan Bolgatty Alencier Ley Lopez Thesni Khan  Production The film is produced by Raju Malliath, while the story and direction is by debutant Vivek.  References External links Aanenkilum Allenkilum on IMDb",
    "Categories": [
      "2018 films",
      "Indian comedy films",
      "Indian films",
      "Malayalam-language films"
    ]
  },
  "48": {
    "Title": [
      "Aapla Manus"
    ],
    "Director": [
      "Satish Rajwade"
    ],
    "Starring": [
      "Nana Patekar",
      "Iravati Harshe",
      "Sumeet Raghavan"
    ],
    "Running Time": 138,
    "Country": [
      "India"
    ],
    "Language": [
      "Marathi"
    ],
    "Time": [],
    "Location": [],
    "Text": "Aapla Manus (English: Our Man) is a 2018 Indian Marathi language mystery film directed by Satish Rajwade and produced by Ajay Devgn and Abhinav Shukla. A film adaptation of the Marathi play Katkon Trikon by Dr Vivek Bele, the film stars Nana Patekar, Iravati Harshe and Sumeet Raghavan in the lead roles and is Devgn's first  Marathi film as a producer. It was released on 9 February 2018. Devgn announced the film via his Twitter handle on 24 December.  Plot Aapla Manus is a story of young couple living in an urban area. The couple lives with the father of the man. They are trying to understand the complexities of the relationship and at the same time they are trying to cope with the urban life. Some unexpected incident happen in their life, that changed their beliefs and way of living.  Cast Nana Patekar as Maruti Nagargoje/Abba Ghokhle Iravati Harshe Bhakti Rahul Gokhale Sumeet Raghavan Rahul Ghokhale Ajay Devgn special appearance at the end  Box Office Aapla Manus was successful both critically and commercially. It grossed more than ₹20 crore (US$2.8 million) and completed 50 days run at the box office.  References External links Aapla Manus on IMDb",
    "Categories": [
      "2010s Marathi-language films",
      "2010s crime films",
      "2010s thriller films",
      "2018 films",
      "Ajay Devgn",
      "All Wikipedia articles written in Indian English",
      "Indian crime films",
      "Indian films",
      "Indian films based on plays",
      "Indian thriller films",
      "Marathi-language films",
      "Use Indian English from December 2017",
      "Use dmy dates from December 2017",
      "Viacom18 Motion Pictures films"
    ]
  },
  "49": {
    "Title": [
      "Aate Di Chidi"
    ],
    "Director": [
      "Harry Bhatti"
    ],
    "Starring": [
      "Amrit Maan",
      "Neeru Bajwa",
      "Gurpreet Ghuggi",
      "Karamjit Anmol",
      "Arjun Gupta",
      "Sardar Sohi",
      "Ashlyn J."
    ],
    "Running Time": "[]",
    "Country": [
      "India",
      "Canada",
      "Australia"
    ],
    "Language": [
      "Punjabi"
    ],
    "Time": [],
    "Location": [],
    "Text": "Aate Di Chidi (lit.Bird of dough) is an upcoming Punjabi black comedy film directed by Harry Bhatti and starring Amrit Maan, Neeru Bajwa, Gurpreet Ghuggi and Arjun Gupta in lead roles. The film will be released worldwide on 18 October 2018 on the holiday Dussehra. It was shot in Canada and Punjab.  Synopsis An expatriate Punjabi family heads to India after years of being away from their homeland. While the elders long to return to their roots, the young ones in the family are not too keen on this homecoming and hope to return to Canada soon. As both the generations vie to prove their point to one another, a hilarious series of events ensues.  Cast Amrit Maan as Vikram Neeru Bajwa as Eliza, a modern women who knows her priorities and managing very well between her job and her family life, except Dilip's wish of wanting to go to Punjab. Sardar Sohi as Dilip Singh, aged 65 who has been living with his family in Canada for last 20 years. He has only one dream to see Punjab which he has left long back which he still thinks that it is same as he left long back. Dilip lives with his son Vikram, daughter in law Eliza and grandson Lavi. Anmol Verma as Lavi Ashlyn J. as Saify Gurpreet Ghuggi Karamjit Anmol Nirmal Rishi B.N. Sharma Nisha Bano Harby Sangha Arjun Gupta as Karan Anshu Sawhney as Bihari woman  Production The filming of Aate Di Chidi took place between 15 March 2018 and July 2018 in India & Canada. The first portion was filmed in several villages of Punjab, India till 6 May 2018 and the second part was filmed in Canada. The film wrapped on 6 July 2018. Featuring Neeru Bajwa and Amrit Maan, Aate Di Chidi revolves around some serious issues, but the overall tone of the film is comedic. Singer and actor Amrit Maan is featured in his first lead role. It is also Harry Bhatti’s first movie in the field of comedy.  Release A preview of the film was released on 14 March 2018 at Chandigarh. All the major cast members were present at the event. Trailer of the film was released on 21 September 2018 on channel \"Lokdhun Punjabi\" on YouTube. The film was scheduled to released on 19 October 2018 but few days earlier it was announced that the film will be released one day earlier on 18 October 2018.Soon World TV Premiere of this movie on Pitaara TV  Reception Punjabi website Daah Films said, \"Aate di Chidi certainly ends on a very special message for everyone. The film is closely knit with the Punjabi culture and traditions and that has also been made evident from a few songs of the film. This is one of those films that will take you back to the belief that ones’s roots are one’s own and no matter what, we should always find ways to make ourselves connected with our rich culture and heritage.\" Also, appreciated the performance of Sardar Sohi in the film.  References External links Aate Di Chidi on IMDb  Aate Di Chidi on Rotten Tomatoes",
    "Categories": [
      "2018 films",
      "All articles with unsourced statements",
      "Articles with unsourced statements from December 2018",
      "Indian black comedy films",
      "Indian films",
      "Punjabi-language films"
    ]
  },
  "50": {
    "Title": [
      "Abar Basanta Bilap"
    ],
    "Director": [
      "[]"
    ],
    "Starring": [
      "[]"
    ],
    "Running Time": "[]",
    "Country": [
      "India"
    ],
    "Language": "[]",
    "Time": [],
    "Location": [
      "West Bengal"
    ],
    "Text": "Abar Basanta Bilap is a 2018 Bengali language romantic comedy film. A number of renowned figures have participated in the production of the film.  Plot summary Badur Bagan is a locality in North Kolkata. Just beside there is place named Muchi Bagan. Just like the way North Kolkata looks, this place is exactly the same, old houses big big windows, wide ground floor balcony for chit chat and gossips, narrow streets, by lanes and so on. And in this same locality our story’s main character Anadi Chakraborty resides by giving only 50 INR as monthly rent. He is an upper class Brahmin. By not following his ancestor’s footsteps and went to the same profession of being Hindu priests, he chooses to be a proofreader of an elite publication in College Street named Basanta Bilap, and he is the senior proof reader there. Though Anadi is a typical dedicated honest responsible simple man then also because of his single flaw he gets bad treatment everywhere starting from his wife to boss in his office. He often forget things, and that is his flaw. For example, if his wife Nilima asked him to bring fish from the market, he brings green vegetables while returning. This absent mindedness continues in office as well, and he often gets scolding from Paranpriyo, the manager. “You will soon lose your job, Anadi.” He himself used to stay very tensed regarding this job, he used to mummer “maybe I will lose this job.” He has a son named Shibu Chakraborty, who is jobless spoil brat. All of a sudden he falls for Radhika. But smart beautiful Radhika gives a shit about it; she was not at all interested. Radhika used to come to Muchi Bagan for Bengali tuition to Dimpida. Dimpida is bit different from the rest, bit feminine from inside. When he used to be in his college days, he was impressed by the character of Rishi Kapoor in the film named Sagar and started imagining himself as Dimple Kapadia.  Cast Paran Bandopadhyay Kharaj Mukherjee Moon Moon Sen Bihu Mukherjee Mir Afsar Ali as Dimpida  References External links Abar Basanta Bilap on IMDb",
    "Categories": [
      "2010s Bengali-language films",
      "2018 films",
      "All articles needing additional references",
      "Articles needing additional references from April 2018",
      "Bengali-language films",
      "Films set in West Bengal",
      "Indian drama films",
      "Indian films"
    ]
  }
}